joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
// license:BSD-3-Clause
// copyright-holders:Joe Landers
/***************************************************************************

    tms57002test.cpp

    Minimal TMS57002 semantics harness.

***************************************************************************/

#include "emu.h"

#include "cpu/tms57002/tms57002.h"

#include "screen.h"

#include <cstring>
#include <cstdlib>
#include <fstream>
#include <iomanip>
#include <sstream>
#include <string>
#include <vector>

namespace {

class tms57002test_state : public driver_device
{
public:
	tms57002test_state(const machine_config &mconfig, device_type type, const char *tag)
		: driver_device(mconfig, type, tag)
		, m_dsp(*this, "dsp")
	{
	}

	void tms57002test(machine_config &config);
	void dsp_ram_map(address_map &map);

protected:
	virtual void machine_start() override ATTR_COLD;

private:
	void run_tests_now();
	u32 screen_update(screen_device &screen, bitmap_rgb32 &bitmap, const rectangle &cliprect);

	static s64 sx48(u64 value)
	{
		constexpr u64 mask48 = (u64(1) << 48) - 1;
		value &= mask48;
		return BIT(value, 47) ? s64(value | ~mask48) : s64(value);
	}

	static s64 sx52(u64 value)
	{
		constexpr u64 mask52 = (u64(1) << 52) - 1;
		value &= mask52;
		return BIT(value, 51) ? s64(value | ~mask52) : s64(value);
	}

	static s64 sx24(u32 value)
	{
		constexpr u64 mask24 = 0x00ffffffU;
		u64 wide = value & mask24;
		return BIT(wide, 23) ? s64(wide | ~mask24) : s64(wide);
	}

	void check_equal(const char *name, s64 actual, s64 expected);
	void check_true(const char *name, bool actual);
	void check_false(const char *name, bool actual);
	void test_macc_output_clipping();
	void test_domh_movm_rounding_oracle_boundaries();
	void test_macc_output_unrounded_exceptions();
	void test_aovm_neg_abs_int32_min();
	void test_mac_a_d_full_width_port();
	void test_multiplier_a_port_drops_low_byte();
	void test_sequential_pc_wrap_halts_until_sync();
	void test_smld_raw_low_port();
	void test_mac_a_d_and_smld_port_semantics();
	void test_domh_sfmo2_trace_cases();
	[[maybe_unused]] void test_dsp3_a02_f8_ff_tail_chain();
	void test_instruction_level_serial_passthrough();
	void test_example53_bank_switched_serial_access();
	void test_example53_one_frame_output_latency();
	void test_example53_dos_deadline();
	[[maybe_unused]] void test_dsp3_mpy_dis_uses_prior_dmem();
	void test_dsp3_mpy_dis_uses_incoming_dmem();
	void test_dsp3_wre_smhd_orders_store_before_xwr();
	void test_dsp3_rde_sacc_uses_store_updated_cmem_for_xoa();
	void test_dsp3_lmhd_srbd_uses_store_updated_dmem_for_macc();
	void test_lacc_lira_same_word_uses_pre_lacc_aacc();
	void test_cmem_update_multiword_sequence();
	void test_cmem_update_waits_for_cload_high();
	void test_cmem_update_new_address_breaks_active_run();
	void test_pc33_mpy_mac_direct_coeff_chain();
	void test_pc33_producer_smhc_phase();
	void test_dsp3_rde_word0_sel1_dram_latency();
	void test_xmem_micro_oracles();
	void test_dsp3_snapshot_replay_case_with_program(const char *label, const char *program_path, const char *snapshot_path, const char *exec_path, const char *ram_path = nullptr);
	void test_dsp3_snapshot_replay_case(const char *label, const char *snapshot_path, const char *exec_path, const char *ram_path = nullptr);
	void test_dsp3_input_sensitivity_case_with_program(const char *label, const char *program_path, const char *snapshot_path, const char *exec_path, const char *ram_path);
	void test_dsp3_input_sensitivity_case(const char *label, const char *snapshot_path, const char *exec_path, const char *ram_path);
	void test_dsp3_a02_su480002_input_sensitivity();
	void test_dsp3_a02_su480003_input_sensitivity();
	void test_dsp3_a02_su480004_snapshot_replay();
	void test_dsp3_a02_sine_su480003_snapshot_replay();
	void test_dsp3_a02_su480004_input_sensitivity();
	void test_dsp3_a02_su480005_snapshot_replay();
	void test_dsp3_a02_su480005_input_sensitivity();
	void probe_dsp3_a02_su480005_state_sensitivity();
	void probe_dsp3_a02_su480005_first_diff_variants();
	void probe_dsp3_a02_su480004_producers();
	void probe_dsp3_a02_su480004_producer_site_ba0_variants();
	void probe_dsp3_a02_su480005_ba0_phase_sensitivity();
	void probe_dsp3_a02_su480005_site_ba0_variants();
	void probe_dsp3_a02_su480005_repeat_site_ba0_variants();
	void probe_dsp3_a02_tape_su480003_group_sensitivity();
	void probe_dsp3_a02_tape_su480003_producer_sensitivity();
	void probe_dsp3_a02_tape_su480002_hot_producer_sensitivity();
	void probe_dsp3_a02_tape_su480002_serial_firstdiff();
	void probe_dsp3_a02_tape_su480002_serial_path_checks();
	void probe_dsp3_serial_side_boundary_sensitivity();
	void probe_dsp3_a02_fix_su95299_coeff_sensitivity();
	void probe_dsp3_a02_fix_su95298_b3_operand_source();
	void probe_dsp3_a02_onset_boundary_replay();
	void probe_dsp3_a12_drone_regrowth();
	void probe_dsp3_a02_tape_boundary_replay();
	void probe_dsp3_a02_tape_cycle_budget();
	void test_dsp3_a02_su480006_snapshot_replay();
	void test_dsp3_a02_su480006_input_sensitivity();
	void test_dsp3_a02_su480001_pc68_mac_matches_input();
	void dump_dsp3_a02_su480006_replay_block();
	void test_dsp3_a02_su480082_snapshot_replay();
	void run_filter_replay_from_env();

	void run_all_focused_tests();
	void run_legacy_research_tests();

	required_device<tms57002_device> m_dsp;
	int m_failures = 0;
};


void tms57002test_state::machine_start()
{
	run_tests_now();
}

u32 tms57002test_state::screen_update(screen_device &screen, bitmap_rgb32 &bitmap, const rectangle &cliprect)
{
	return 0;
}

void tms57002test_state::check_equal(const char *name, s64 actual, s64 expected)
{
	if (actual != expected)
	{
		m_failures++;
		osd_printf_error("FAIL %-40s actual=%016llx expected=%016llx\n",
			name,
			(unsigned long long)actual,
			(unsigned long long)expected);
	}
	else
	{
		osd_printf_info("PASS %-40s value=%016llx\n", name, (unsigned long long)actual);
	}
}

void tms57002test_state::check_true(const char *name, bool actual)
{
	if (!actual)
	{
		m_failures++;
		osd_printf_error("FAIL %-40s actual=false expected=true\n", name);
	}
	else
	{
		osd_printf_info("PASS %-40s true\n", name);
	}
}

