joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
void tms57002test_state::check_false(const char *name, bool actual)
{
	if (actual)
	{
		m_failures++;
		osd_printf_error("FAIL %-40s actual=true expected=false\n", name);
	}
	else
	{
		osd_printf_info("PASS %-40s false\n", name);
	}
}

namespace {

static std::string legacy_asset_path(const char *path)
{
	const char *root = std::getenv("TMS57TEST_LEGACY_ASSET_ROOT");
	if (!root || !root[0])
		return path;

	std::string resolved(root);
	if (!resolved.empty() && resolved.back() != '/')
		resolved.push_back('/');
	return resolved + path;
}

static std::vector<std::string> load_text_lines(const char *path)
{
	const std::string resolved = legacy_asset_path(path);
	std::ifstream input(resolved);
	if (!input)
		throw emu_fatalerror("Unable to open %s (asset %s)", resolved, path);

	std::vector<std::string> lines;
	for (std::string line; std::getline(input, line); )
	{
		if (!line.empty())
			lines.push_back(line);
	}
	return lines;
}

static std::string field_value(const std::string &line, const char *key)
{
	const std::string needle(key);
	const std::size_t pos = line.find(needle);
	if (pos == std::string::npos)
		throw emu_fatalerror("Missing field %s in line: %s", key, line);

	const std::size_t start = pos + needle.size();
	const std::size_t end = line.find(',', start);
	return line.substr(start, end == std::string::npos ? std::string::npos : end - start);
}

static u32 parse_hex_u32(const std::string &text)
{
	return u32(std::strtoul(text.c_str(), nullptr, 16));
}

static u64 parse_hex_u64(const std::string &text)
{
	return u64(std::strtoull(text.c_str(), nullptr, 16));
}

static u64 parse_dec_u64(const std::string &text)
{
	return u64(std::strtoull(text.c_str(), nullptr, 10));
}

static int parse_dec_int(const std::string &text)
{
	return int(std::strtol(text.c_str(), nullptr, 10));
}

static std::array<u32, 4> parse_hex_slash4(const std::string &text)
{
	std::array<u32, 4> values{};
	std::stringstream ss(text);
	for (u32 i = 0; i < 4; i++)
	{
		std::string part;
		if (!std::getline(ss, part, '/'))
			throw emu_fatalerror("Expected 4 slash-separated hex values in %s", text);
		values[i] = parse_hex_u32(part);
	}
	return values;
}

static std::vector<u32> load_program_words(const char *path)
{
	const std::string resolved = legacy_asset_path(path);
	std::ifstream input(resolved, std::ios::binary);
	if (!input)
		throw emu_fatalerror("Unable to open %s (asset %s)", resolved, path);

	std::vector<u8> bytes((std::istreambuf_iterator<char>(input)), std::istreambuf_iterator<char>());
	if ((bytes.size() & 3) != 0)
		throw emu_fatalerror("Program image %s has non-word-aligned size %zu", path, bytes.size());

	std::vector<u32> words(bytes.size() / 4);
	for (std::size_t i = 0; i < words.size(); i++)
	{
		words[i] = u32(bytes[i * 4 + 0])
			| (u32(bytes[i * 4 + 1]) << 8)
			| (u32(bytes[i * 4 + 2]) << 16)
			| (u32(bytes[i * 4 + 3]) << 24);
	}
	return words;
}

static std::vector<u32> load_hex_words(const char *path, u32 mask = 0xffffffffU)
{
	std::ifstream input(path);
	if (!input)
		throw emu_fatalerror("Unable to open %s", path);

	std::vector<u32> words;
	for (std::string line; std::getline(input, line); )
	{
		const std::size_t comment = line.find('#');
		if (comment != std::string::npos)
			line.resize(comment);
		const std::size_t first = line.find_first_not_of(" \t\r\n");
		if (first == std::string::npos)
			continue;
		const std::size_t last = line.find_last_not_of(" \t\r\n");
		const std::string text = line.substr(first, last - first + 1);
		words.push_back(u32(std::strtoul(text.c_str(), nullptr, 0)) & mask);
	}
	return words;
}

static const char *required_env(const char *name)
{
	if (const char *value = std::getenv(name); value && value[0])
		return value;
	throw emu_fatalerror("Missing required environment variable %s", name);
}

static u32 env_hex(const char *name, u32 fallback = 0)
{
	// Base 16 (with or without 0x prefix). Base-0 auto-detect silently
	// misparsed bare-hex values like "8a0000" (-> 8) or leading-zero values
	// (-> octal).
	if (const char *value = std::getenv(name); value && value[0])
		return u32(std::strtoul(value, nullptr, 16));
	return fallback;
}

static int env_int(const char *name, int fallback = 0)
{
	if (const char *value = std::getenv(name); value && value[0])
		return int(std::strtol(value, nullptr, 0));
	return fallback;
}

static bool env_bool(const char *name, bool fallback = false)
{
	if (const char *value = std::getenv(name); value && value[0])
		return std::strtol(value, nullptr, 0) != 0;
	return fallback;
}

static std::vector<std::string> split_tab_line(const std::string &line)
{
	std::vector<std::string> parts;
	std::stringstream ss(line);
	for (std::string part; std::getline(ss, part, '\t'); )
		parts.push_back(part);
	return parts;
}

struct serial_replay_row
{
	u32 frame = 0;
	std::array<u32, 4> si{};
};

struct cload_replay_row
{
	u32 frame = 0;
	u8 sa = 0;
	u32 value = 0;
};

static std::vector<serial_replay_row> load_serial_replay_rows(const char *path)
{
	std::ifstream input(path);
	if (!input)
		throw emu_fatalerror("Unable to open %s", path);

	std::vector<serial_replay_row> rows;
	for (std::string line; std::getline(input, line); )
	{
		if (line.empty() || line[0] == '#')
			continue;
		const std::vector<std::string> parts = split_tab_line(line);
		if (parts.empty() || parts[0] == "frame")
			continue;
		if (parts.size() < 5)
			throw emu_fatalerror("Expected frame/si0/si1/si2/si3 in %s line: %s", path, line.c_str());

		serial_replay_row row;
		row.frame = u32(std::strtoul(parts[0].c_str(), nullptr, 0));
		for (u32 i = 0; i < 4; i++)
			row.si[i] = u32(std::strtoul(parts[1 + i].c_str(), nullptr, 0)) & 0x00ffffffU;
		rows.push_back(row);
	}
	return rows;
}

static std::vector<cload_replay_row> load_cload_replay_rows(const char *path)
{
	if (!path || !path[0])
		return {};
	std::ifstream input(path);
	if (!input)
		throw emu_fatalerror("Unable to open %s", path);

	std::vector<cload_replay_row> rows;
	for (std::string line; std::getline(input, line); )
	{
		if (line.empty() || line[0] == '#')
			continue;
		const std::vector<std::string> parts = split_tab_line(line);
		if (parts.empty() || parts[0] == "frame")
			continue;
		if (parts.size() < 3)
			throw emu_fatalerror("Expected frame/sa/value in %s line: %s", path, line.c_str());

		cload_replay_row row;
		row.frame = u32(std::strtoul(parts[0].c_str(), nullptr, 0));
		row.sa = u8(std::strtoul(parts[1].c_str(), nullptr, 0));
		row.value = u32(std::strtoul(parts[2].c_str(), nullptr, 0));
		rows.push_back(row);
	}
	return rows;
}

