joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
static void apply_replay_cload(tms57002_device &dsp, u8 sa, u32 value)
{
	dsp.cload_w(0);
	dsp.data_w(sa);
	dsp.data_w(u8((value >> 24) & 0xff));
	dsp.data_w(u8((value >> 16) & 0xff));
	dsp.data_w(u8((value >> 8) & 0xff));
	dsp.data_w(u8(value & 0xff));
	dsp.cload_w(1);
}

static void host_write_word24(tms57002_device &dsp, u32 value)
{
	dsp.data_w(u8((value >> 16) & 0xff));
	dsp.data_w(u8((value >> 8) & 0xff));
	dsp.data_w(u8(value & 0xff));
}

static void host_write_word32(tms57002_device &dsp, u32 value)
{
	dsp.data_w(u8((value >> 24) & 0xff));
	dsp.data_w(u8((value >> 16) & 0xff));
	dsp.data_w(u8((value >> 8) & 0xff));
	dsp.data_w(u8(value & 0xff));
}

static void host_download_cmem_image(tms57002_device &dsp, const std::array<u32, 256> &cmem)
{
	dsp.pload_w(0);
	dsp.cload_w(0);
	for (u32 value : cmem)
		host_write_word32(dsp, value);
}

static void host_download_program_image(tms57002_device &dsp, const std::vector<u32> &program, u32 st0, u32 st1)
{
	dsp.pload_w(0);
	dsp.cload_w(1);
	host_write_word24(dsp, st0);
	host_write_word24(dsp, st1);
	for (u32 addr = 0; addr < 256; addr++)
		host_write_word24(dsp, addr < program.size() ? program[addr] : 0);
}

static void write_hex24(std::ostream &out, u32 value)
{
	out << "0x" << std::hex << std::nouppercase << std::setw(6) << std::setfill('0') << (value & 0x00ffffffU) << std::dec << std::setfill(' ');
}

static void load_data_space_bytes(const char *path, address_space &space)
{
	if (!path)
		return;

	const std::string resolved = legacy_asset_path(path);
	std::ifstream input(resolved, std::ios::binary);
	if (!input)
		throw emu_fatalerror("Unable to open %s (asset %s)", resolved, path);

	std::vector<u8> bytes((std::istreambuf_iterator<char>(input)), std::istreambuf_iterator<char>());
	for (std::size_t i = 0; i < bytes.size(); i++)
		space.write_byte(u32(i), bytes[i]);
}

static tms57002_device::debug_snapshot load_snapshot_from_log(const char *path)
{
	tms57002_device::debug_snapshot snapshot;

	for (const std::string &line : load_text_lines(path))
	{
		if (line.find("KPROP_DSPSNAP_PRE_CORE") != std::string::npos)
		{
			snapshot.sound_updates = parse_dec_u64(field_value(line, "SU="));
			snapshot.pc = parse_hex_u32(field_value(line, "PC="));
			snapshot.hpc = parse_hex_u32(field_value(line, "HPC="));
			snapshot.ca = parse_hex_u32(field_value(line, "CA="));
			snapshot.id = parse_hex_u32(field_value(line, "ID="));
			snapshot.ba0 = parse_hex_u32(field_value(line, "BA0="));
			snapshot.ba1 = parse_hex_u32(field_value(line, "BA1="));
			snapshot.rptc = parse_hex_u32(field_value(line, "RPTC="));
			snapshot.rptc_next = parse_hex_u32(field_value(line, "RPTN="));
			snapshot.sa = parse_hex_u32(field_value(line, "SA="));
			snapshot.hidx = parse_hex_u32(field_value(line, "HIDX="));
			snapshot.allow_update = parse_hex_u32(field_value(line, "ALLOW="));
			snapshot.st0 = parse_hex_u32(field_value(line, "ST0="));
			snapshot.st1 = parse_hex_u32(field_value(line, "ST1="));
			snapshot.sti = parse_hex_u32(field_value(line, "STI="));
			snapshot.aacc = parse_hex_u32(field_value(line, "AACC="));
			snapshot.macc = parse_hex_u64(field_value(line, "MACC="));
			snapshot.macc_read = parse_hex_u64(field_value(line, "MACCR="));
			snapshot.macc_write = parse_hex_u64(field_value(line, "MACCW="));
			snapshot.creg = parse_hex_u32(field_value(line, "CREG="));
		}
		else if (line.find("KPROP_DSPSNAP_PRE_XMEM") != std::string::npos)
		{
			snapshot.xoa = parse_hex_u32(field_value(line, "XOA="));
			snapshot.xba = parse_hex_u32(field_value(line, "XBA="));
			snapshot.xwr = parse_hex_u32(field_value(line, "XWR="));
			snapshot.xrd = parse_hex_u32(field_value(line, "XRD="));
			snapshot.txrd = parse_hex_u32(field_value(line, "TXRD="));
			snapshot.xm_adr = parse_hex_u32(field_value(line, "XMADR="));
			snapshot.xm_cycles = parse_hex_u32(field_value(line, "XMCYC="));
			snapshot.xm_fetches = parse_hex_u32(field_value(line, "XMFET="));
		}
		else if (line.find("KPROP_DSPSNAP_PRE_SERIAL") != std::string::npos)
		{
			snapshot.si = parse_hex_slash4(field_value(line, "SI="));
			snapshot.so = parse_hex_slash4(field_value(line, "SO="));
			snapshot.serial_input_latch = parse_hex_slash4(field_value(line, "LATCH="));
			snapshot.serial_input_active = parse_hex_slash4(field_value(line, "ACTIVE="));
			snapshot.serial_input_frame = parse_hex_slash4(field_value(line, "FRAME="));
			snapshot.serial_input_prev_frame = parse_hex_slash4(field_value(line, "PREV="));
			snapshot.serial_input_pending = parse_hex_slash4(field_value(line, "PEND="));
			snapshot.serial_input_valid = parse_hex_u32(field_value(line, "LVALID="));
			snapshot.serial_input_active_valid = parse_hex_u32(field_value(line, "AVALID="));
			snapshot.serial_input_prev_valid = parse_hex_u32(field_value(line, "PVALID="));
			snapshot.serial_input_pending_valid = parse_hex_u32(field_value(line, "IPEND="));
			snapshot.serial_output_pending_valid = parse_hex_u32(field_value(line, "OPEND="));
			snapshot.serial_frame_mode = parse_hex_u32(field_value(line, "FMODE="));
			snapshot.serial_input_timing_mode = parse_hex_u32(field_value(line, "ITMODE="));
			snapshot.serial_frame_clocks = parse_dec_int(field_value(line, "FCLKS="));
			snapshot.serial_exec_halfcycles = parse_dec_int(field_value(line, "EXECHC="));
			snapshot.serial_input_pending_halfcycle = parse_dec_int(field_value(line, "INHC="));
			snapshot.serial_output_pending_halfcycle = parse_dec_int(field_value(line, "OUTHC="));
			snapshot.sync_polarity_rising = parse_hex_u32(field_value(line, "SYNCPOL="));
			snapshot.serial_output_muted = parse_hex_u32(field_value(line, "MUTED="));
		}
		else if (line.find("KPROP_DSPSNAP_PRE_PREXFER") != std::string::npos)
		{
			snapshot.pending_pre_transfer = parse_dec_int(field_value(line, "TYPE="));
			snapshot.pending_pre_transfer_addr = parse_hex_u32(field_value(line, "ADDR="));
			snapshot.pending_pre_transfer_value = parse_hex_u32(field_value(line, "VALUE="));
			snapshot.update_counter_head = parse_hex_u32(field_value(line, "HEAD="));
			snapshot.update_counter_tail = parse_hex_u32(field_value(line, "TAIL="));
			// New logs carry the unambiguous 0..16 count.  Legacy logs predate
			// that field, so recover 1..15 from the modulo indices; equal indices
			// must remain the legacy empty assumption because full is unknowable.
			snapshot.update_counter_count =
				line.find("COUNT=") != std::string::npos
					? parse_dec_int(field_value(line, "COUNT="))
					: ((snapshot.update_counter_head - snapshot.update_counter_tail) & 0x0f);
			if (line.find("ACTIVE=") != std::string::npos)
				snapshot.update_active = parse_dec_int(field_value(line, "ACTIVE="));
			if (line.find("ADDRRUN=") != std::string::npos)
				snapshot.update_address_run = parse_hex_u32(field_value(line, "ADDRRUN="));
		}
		else if (line.find("KPROP_DSPSNAP_PRE_CMEM") != std::string::npos)
		{
			const std::size_t base_pos = line.find("BASE=");
			if (base_pos == std::string::npos)
				throw emu_fatalerror("Missing BASE in CMEM line: %s", line);
			std::stringstream ss(line.substr(base_pos));
			std::string token;
			if (!std::getline(ss, token, ','))
				throw emu_fatalerror("Bad CMEM line: %s", line);
			const u32 base = parse_hex_u32(token.substr(5));
			for (u32 i = 0; i < 16; i++)
			{
				if (!std::getline(ss, token, ','))
					throw emu_fatalerror("Short CMEM line: %s", line);
				snapshot.cmem[(base + i) & 0xff] = parse_hex_u32(token);
			}
		}
		else if (line.find("KPROP_DSPSNAP_PRE_DMEM0") != std::string::npos)
		{
			const std::size_t base_pos = line.find("BASE=");
			if (base_pos == std::string::npos)
				throw emu_fatalerror("Missing BASE in DMEM0 line: %s", line);
			std::stringstream ss(line.substr(base_pos));
			std::string token;
			if (!std::getline(ss, token, ','))
				throw emu_fatalerror("Bad DMEM0 line: %s", line);
			const u32 base = parse_hex_u32(token.substr(5));
			for (u32 i = 0; i < 16; i++)
			{
				if (!std::getline(ss, token, ','))
					throw emu_fatalerror("Short DMEM0 line: %s", line);
				snapshot.dmem0[(base + i) & 0xff] = parse_hex_u32(token);
			}
		}
		else if (line.find("KPROP_DSPSNAP_PRE_DMEM1") != std::string::npos)
		{
			const std::size_t base_pos = line.find("BASE=");
			if (base_pos == std::string::npos)
				throw emu_fatalerror("Missing BASE in DMEM1 line: %s", line);
			std::stringstream ss(line.substr(base_pos));
			std::string token;
			if (!std::getline(ss, token, ','))
				throw emu_fatalerror("Bad DMEM1 line: %s", line);
			const u32 base = parse_hex_u32(token.substr(5));
			for (u32 i = 0; i < 16; i++)
			{
				if (!std::getline(ss, token, ','))
					throw emu_fatalerror("Short DMEM1 line: %s", line);
				snapshot.dmem1[(base + i) & 0x1f] = parse_hex_u32(token);
			}
		}
		else if (line.find("KPROP_DSPSNAP_PRE_UPDATE") != std::string::npos)
		{
			const u32 idx = parse_hex_u32(field_value(line, "IDX="));
			if (idx >= 16)
				throw emu_fatalerror("Bad update index %u in %s", idx, line);
			snapshot.update_sa[idx] = parse_hex_u32(field_value(line, "SA="));
			snapshot.update[idx] = parse_hex_u32(field_value(line, "VAL="));
			snapshot.update_enqueue_su[idx] = parse_dec_u64(field_value(line, "ENQSU="));
			snapshot.update_read_delay_seen[idx] = parse_dec_int(field_value(line, "RDSEEN="));
			if (line.find("ADDRRUN=") != std::string::npos)
				snapshot.update_address_run_for_entry[idx] = parse_hex_u32(field_value(line, "ADDRRUN="));
		}
	}

	return snapshot;
}

static tms57002_device::debug_snapshot load_snapshot_for_su_from_lines(const std::vector<std::string> &lines, u64 su)
{
	tms57002_device::debug_snapshot snapshot;
	const std::string su_needle = util::string_format("SU=%llu,", (unsigned long long)su);
	bool found = false;

	for (std::size_t line_index = 0; line_index < lines.size(); line_index++)
	{
		const std::string &line = lines[line_index];
		if (!found)
		{
			if (line.find("KPROP_DSPSNAP_PRE_CORE") == std::string::npos || line.find("TAG=:dsp3") == std::string::npos || line.find(su_needle) == std::string::npos)
				continue;
			found = true;
		}
		else if (line.find("KPROP_DSPSNAP_PRE_CORE") != std::string::npos)
		{
			break;
		}

		if (line.find("KPROP_DSPSNAP_PRE_") == std::string::npos)
			continue;

		if (line.find("KPROP_DSPSNAP_PRE_CORE") != std::string::npos && line.find("TAG=:dsp3") != std::string::npos)
		{
			snapshot.sound_updates = parse_dec_u64(field_value(line, "SU="));
			snapshot.pc = parse_hex_u32(field_value(line, "PC="));
			snapshot.hpc = parse_hex_u32(field_value(line, "HPC="));
			snapshot.ca = parse_hex_u32(field_value(line, "CA="));
			snapshot.id = parse_hex_u32(field_value(line, "ID="));
			snapshot.ba0 = parse_hex_u32(field_value(line, "BA0="));
			snapshot.ba1 = parse_hex_u32(field_value(line, "BA1="));
			snapshot.rptc = parse_hex_u32(field_value(line, "RPTC="));
			snapshot.rptc_next = parse_hex_u32(field_value(line, "RPTN="));
			snapshot.sa = parse_hex_u32(field_value(line, "SA="));
			snapshot.hidx = parse_hex_u32(field_value(line, "HIDX="));
			snapshot.allow_update = parse_hex_u32(field_value(line, "ALLOW="));
			snapshot.st0 = parse_hex_u32(field_value(line, "ST0="));
			snapshot.st1 = parse_hex_u32(field_value(line, "ST1="));
			snapshot.sti = parse_hex_u32(field_value(line, "STI="));
			snapshot.aacc = parse_hex_u32(field_value(line, "AACC="));
			snapshot.macc = parse_hex_u64(field_value(line, "MACC="));
			snapshot.macc_read = parse_hex_u64(field_value(line, "MACCR="));
			snapshot.macc_write = parse_hex_u64(field_value(line, "MACCW="));
			snapshot.creg = parse_hex_u32(field_value(line, "CREG="));
		}
		else if (line.find("KPROP_DSPSNAP_PRE_XMEM") != std::string::npos && line.find("TAG=:dsp3") != std::string::npos)
		{
			snapshot.xoa = parse_hex_u32(field_value(line, "XOA="));
			snapshot.xba = parse_hex_u32(field_value(line, "XBA="));
			snapshot.xwr = parse_hex_u32(field_value(line, "XWR="));
			snapshot.xrd = parse_hex_u32(field_value(line, "XRD="));
			snapshot.txrd = parse_hex_u32(field_value(line, "TXRD="));
			snapshot.xm_adr = parse_hex_u32(field_value(line, "XMADR="));
			snapshot.xm_cycles = parse_hex_u32(field_value(line, "XMCYC="));
			snapshot.xm_fetches = parse_hex_u32(field_value(line, "XMFET="));
		}
		else if (line.find("KPROP_DSPSNAP_PRE_SERIAL") != std::string::npos && line.find("TAG=:dsp3") != std::string::npos)
		{
			snapshot.si = parse_hex_slash4(field_value(line, "SI="));
			snapshot.so = parse_hex_slash4(field_value(line, "SO="));
			snapshot.serial_input_latch = parse_hex_slash4(field_value(line, "LATCH="));
			snapshot.serial_input_valid = parse_hex_u32(field_value(line, "LVALID="));
			snapshot.serial_input_active = parse_hex_slash4(field_value(line, "ACTIVE="));
			snapshot.serial_input_active_valid = parse_hex_u32(field_value(line, "AVALID="));
			snapshot.serial_input_frame = parse_hex_slash4(field_value(line, "FRAME="));
			snapshot.serial_input_prev_frame = parse_hex_slash4(field_value(line, "PREV="));
			snapshot.serial_input_prev_valid = parse_hex_u32(field_value(line, "PVALID="));
			snapshot.serial_input_pending = parse_hex_slash4(field_value(line, "PEND="));
			snapshot.serial_input_pending_valid = parse_hex_u32(field_value(line, "IPEND="));
			snapshot.serial_output_pending_valid = parse_hex_u32(field_value(line, "OPEND="));
			snapshot.serial_frame_mode = parse_dec_int(field_value(line, "FMODE="));
			snapshot.serial_input_timing_mode = parse_dec_int(field_value(line, "ITMODE="));
			snapshot.serial_frame_clocks = parse_dec_int(field_value(line, "FCLKS="));
			snapshot.serial_exec_halfcycles = parse_dec_int(field_value(line, "EXECHC="));
			snapshot.serial_input_pending_halfcycle = parse_dec_int(field_value(line, "INHC="));
			snapshot.serial_output_pending_halfcycle = parse_dec_int(field_value(line, "OUTHC="));
			snapshot.sync_polarity_rising = parse_dec_int(field_value(line, "SYNCPOL="));
			snapshot.serial_output_muted = parse_dec_int(field_value(line, "MUTED="));
		}
		else if (line.find("KPROP_DSPSNAP_PRE_PREXFER") != std::string::npos && line.find("TAG=:dsp3") != std::string::npos)
		{
			snapshot.pending_pre_transfer = parse_dec_int(field_value(line, "TYPE="));
			snapshot.pending_pre_transfer_addr = parse_hex_u32(field_value(line, "ADDR="));
			snapshot.pending_pre_transfer_value = parse_hex_u32(field_value(line, "VALUE="));
			snapshot.update_counter_head = parse_hex_u32(field_value(line, "HEAD="));
			snapshot.update_counter_tail = parse_hex_u32(field_value(line, "TAIL="));
			snapshot.update_counter_count =
				line.find("COUNT=") != std::string::npos
					? parse_dec_int(field_value(line, "COUNT="))
					: ((snapshot.update_counter_head - snapshot.update_counter_tail) & 0x0f);
			if (line.find("ACTIVE=") != std::string::npos)
				snapshot.update_active = parse_dec_int(field_value(line, "ACTIVE="));
			if (line.find("ADDRRUN=") != std::string::npos)
				snapshot.update_address_run = parse_hex_u32(field_value(line, "ADDRRUN="));
		}
		else if (line.find("KPROP_DSPSNAP_PRE_CMEM") != std::string::npos)
		{
			const u32 base = parse_hex_u32(field_value(line, "BASE="));
			const std::size_t pos = line.find("BASE=");
			const std::size_t comma = line.find(',', pos);
			std::stringstream ss(line.substr(comma + 1));
			for (u32 i = 0; i < 16; i++)
			{
				std::string part;
				std::getline(ss, part, ',');
				snapshot.cmem[base + i] = parse_hex_u32(part);
			}
		}
		else if (line.find("KPROP_DSPSNAP_PRE_DMEM0") != std::string::npos)
		{
			const u32 base = parse_hex_u32(field_value(line, "BASE="));
			const std::size_t pos = line.find("BASE=");
			const std::size_t comma = line.find(',', pos);
			std::stringstream ss(line.substr(comma + 1));
			for (u32 i = 0; i < 16; i++)
			{
				std::string part;
				std::getline(ss, part, ',');
				snapshot.dmem0[base + i] = parse_hex_u32(part);
			}
		}
		else if (line.find("KPROP_DSPSNAP_PRE_DMEM1") != std::string::npos)
		{
			const u32 base = parse_hex_u32(field_value(line, "BASE="));
			const std::size_t pos = line.find("BASE=");
			const std::size_t comma = line.find(',', pos);
			std::stringstream ss(line.substr(comma + 1));
			for (u32 i = 0; i < 16; i++)
			{
				std::string part;
				std::getline(ss, part, ',');
				snapshot.dmem1[base + i] = parse_hex_u32(part);
			}
		}
		else if (line.find("KPROP_DSPSNAP_PRE_UPDATE") != std::string::npos)
		{
			const u32 idx = parse_hex_u32(field_value(line, "IDX="));
			if (idx >= 16)
				throw emu_fatalerror("Bad update index %u in %s", idx, line);
			snapshot.update_sa[idx] = parse_hex_u32(field_value(line, "SA="));
			snapshot.update[idx] = parse_hex_u32(field_value(line, "VAL="));
			snapshot.update_enqueue_su[idx] = parse_dec_u64(field_value(line, "ENQSU="));
			snapshot.update_read_delay_seen[idx] = parse_dec_int(field_value(line, "RDSEEN="));
			if (line.find("ADDRRUN=") != std::string::npos)
				snapshot.update_address_run_for_entry[idx] = parse_hex_u32(field_value(line, "ADDRRUN="));
		}
	}

	if (!found)
		throw emu_fatalerror("Unable to find PRE snapshot for SU=%llu", (unsigned long long)su);

	return snapshot;
}

