joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
struct exec_post_expectation
{
	u8 executed_pc = 0;
	u8 ca = 0;
	u8 id = 0;
	u32 st1 = 0;
	u32 aacc = 0;
	u64 macc = 0;
	u64 maccr = 0;
	u64 maccw = 0;
	u32 creg = 0;
	u32 d00 = 0;
	u32 ddc = 0;
	u32 ddd = 0;
	u32 dde = 0;
	u32 ddf = 0;
	u32 xrd = 0;
	u32 txrd = 0;
	u32 d56 = 0;
	u32 d5d = 0;
	u32 d5f = 0;
	u32 so0 = 0;
	u32 so1 = 0;
	bool has_extended = false;
};

static std::vector<exec_post_expectation> load_exec_post_expectations(const char *path)
{
	std::vector<exec_post_expectation> expectations;
	for (const std::string &line : load_text_lines(path))
	{
		if (line.find("KPROP_DSPEXEC_POST") == std::string::npos)
			continue;

		exec_post_expectation exp;
		exp.executed_pc = parse_hex_u32(field_value(line, "PC="));
		exp.ca = parse_hex_u32(field_value(line, "CA="));
		exp.id = parse_hex_u32(field_value(line, "ID="));
		exp.st1 = parse_hex_u32(field_value(line, "ST1="));
		exp.aacc = parse_hex_u32(field_value(line, "AACC="));
		exp.macc = parse_hex_u64(field_value(line, "MACC="));
		exp.maccr = parse_hex_u64(field_value(line, "MACCR="));
		exp.maccw = parse_hex_u64(field_value(line, "MACCW="));
		exp.creg = parse_hex_u32(field_value(line, "CREG="));
		exp.has_extended = (line.find("D00=") != std::string::npos);
		if (exp.has_extended)
		{
			exp.d00 = parse_hex_u32(field_value(line, "D00="));
			exp.ddc = parse_hex_u32(field_value(line, "DDC="));
			exp.ddd = parse_hex_u32(field_value(line, "DDD="));
			exp.dde = parse_hex_u32(field_value(line, "DDE="));
			exp.ddf = parse_hex_u32(field_value(line, "DDF="));
			exp.xrd = parse_hex_u32(field_value(line, "XRD="));
			exp.txrd = parse_hex_u32(field_value(line, "TXRD="));
		}
		exp.d56 = parse_hex_u32(field_value(line, "D56="));
		exp.d5d = parse_hex_u32(field_value(line, "D5D="));
		exp.d5f = parse_hex_u32(field_value(line, "D5F="));
		const auto so = parse_hex_slash4(field_value(line, "SO="));
		exp.so0 = so[0];
		exp.so1 = so[1];
		expectations.push_back(exp);
	}

	if (expectations.empty())
		throw emu_fatalerror("No KPROP_DSPEXEC_POST lines found in %s", path);

	return expectations;
}

} // anonymous namespace

void tms57002test_state::test_macc_output_clipping()
{
	static constexpr u64 positive_overflow = 0x1000000000000ULL;
	static constexpr u64 negative_overflow = 0xf000000000000ULL;
	static constexpr u64 in_range = 0x0123456789abcULL;

	struct round_case
	{
		int rnd;
		u64 pos_expected;
		u64 neg_expected;
	};

	// The overflow rail is masked by the active RND width.  The negative
	// rail already has all discarded low bits clear, so it is unchanged.
	// These expectations are backed by the 436/436 standalone DOMH sweep.
	static constexpr round_case manual_cases[] = {
		{ 0, 0x7fffffffffffULL, 0x800000000000ULL },
		{ 1, 0x7fffffff0000ULL, 0x800000000000ULL },
		{ 2, 0x7fffff000000ULL, 0x800000000000ULL },
		{ 3, 0x7ffff0000000ULL, 0x800000000000ULL },
		{ 4, 0x7fff00000000ULL, 0x800000000000ULL },
	};

	auto eval = m_dsp->debug_eval_macc_output(in_range, 0, 0, tms57002_device::debug_macc_clip_mode::rounded);
	check_false("in-range keeps MOV clear", eval.mov);
	check_equal("in-range value unchanged", eval.value, sx52(in_range));

	for (const auto &tc : manual_cases)
	{
		char name[96];

		auto pos = m_dsp->debug_eval_macc_output(positive_overflow, 0, tc.rnd, tms57002_device::debug_macc_clip_mode::rounded);
		std::snprintf(name, sizeof(name), "SMOM positive overflow MOV rnd=%d", tc.rnd);
		check_true(name, pos.mov);
		std::snprintf(name, sizeof(name), "SMOM positive overflow value rnd=%d", tc.rnd);
		check_equal(name, pos.value, sx48(tc.pos_expected));

		auto neg = m_dsp->debug_eval_macc_output(negative_overflow, 0, tc.rnd, tms57002_device::debug_macc_clip_mode::rounded);
		std::snprintf(name, sizeof(name), "SMOM negative overflow MOV rnd=%d", tc.rnd);
		check_true(name, neg.mov);
		std::snprintf(name, sizeof(name), "SMOM negative overflow value rnd=%d", tc.rnd);
		check_equal(name, neg.value, sx48(tc.neg_expected));
	}
}

void tms57002test_state::test_domh_movm_rounding_oracle_boundaries()
{
	// Exact standalone-silicon programs and steady-state words from the
	// 2026-05-31 final-domh MOVM sweep.  These two points exposed the MOVM
	// saturation rule: the positive rail is masked by the active RND width.
	static constexpr u32 ST0_ORACLE = 0x000680;
	static constexpr u32 RAW_POSITIVE_OVERFLOW = 0x7fffffff;
	static constexpr u32 OP_LMHC_C00__SMOM = 0xcc0500;
	static constexpr u32 OP_NOP = 0x020800;
	static constexpr u32 OP_DOMH_SO0_L = 0x010000;
	static constexpr u32 OP_DOMH_SO0_R = 0x010800;
	static constexpr u32 OP_DOMH_SO1_L = 0x011000;
	static constexpr u32 OP_DOMH_SO1_R = 0x011800;
	static constexpr u32 OP_IDLE = 0xfc4000;

	struct oracle_case
	{
		const char *name;
		u32 rnd_opcode;
		u32 expected_word;
	};

	static constexpr oracle_case cases[] = {
		{ "MOVM RND20", 0x035800, 0x7ffff0 },
		{ "MOVM RND16", 0x036000, 0x7fff00 },
	};

	for (const oracle_case &test : cases)
	{
		const std::array<u32, 8> program{
			OP_LMHC_C00__SMOM,
			OP_NOP,
			test.rnd_opcode,
			OP_DOMH_SO0_L,
			OP_DOMH_SO0_R,
			OP_DOMH_SO1_L,
			OP_DOMH_SO1_R,
			OP_IDLE,
		};

		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_ORACLE, 0);
		m_dsp->debug_write_cmem(0x00, RAW_POSITIVE_OVERFLOW);
		m_dsp->debug_set_exec_state(0, 0, 0, 0, 0, ST0_ORACLE, 0, 0);
		m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);
		m_dsp->set_serial_frame_model(true);
		m_dsp->set_serial_frame_clocks(512);
		m_dsp->set_sync_polarity(1);
		for (int frame = 0; frame < 3; frame++)
			m_dsp->debug_run_sample_frame({ 0, 0, 0, 0 }, 16);

		for (int lane = 0; lane < 4; lane++)
		{
			char label[96];
			std::snprintf(label, sizeof(label), "%s DOMH SO%d", test.name, lane);
			check_equal(label, m_dsp->debug_serial_output_register(lane), test.expected_word);
		}
	}
}

void tms57002test_state::test_macc_output_unrounded_exceptions()
{
	static constexpr u64 positive_overflow = 0x1000000000000ULL;
	static constexpr u64 negative_overflow = 0xf000000000000ULL;

	for (int rnd = 0; rnd <= 4; rnd++)
	{
		char name[96];

