joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
		auto pos = m_dsp->debug_eval_macc_output(positive_overflow, 0, rnd, tms57002_device::debug_macc_clip_mode::unrounded);
		std::snprintf(name, sizeof(name), "DOMH positive overflow MOV rnd=%d", rnd);
		check_true(name, pos.mov);
		std::snprintf(name, sizeof(name), "DOMH positive overflow value rnd=%d", rnd);
		check_equal(name, pos.value, sx48(0x7fffffffffffULL));

		auto neg = m_dsp->debug_eval_macc_output(negative_overflow, 0, rnd, tms57002_device::debug_macc_clip_mode::unrounded);
		std::snprintf(name, sizeof(name), "DOMH negative overflow MOV rnd=%d", rnd);
		check_true(name, neg.mov);
		std::snprintf(name, sizeof(name), "DOMH negative overflow value rnd=%d", rnd);
		check_equal(name, neg.value, sx48(0x800000000000ULL));
	}
}

void tms57002test_state::test_aovm_neg_abs_int32_min()
{
	// Silicon oracle D0C-06 (2026-07-26): NEG and ABS both treat AACC as
	// signed 32-bit, set AOV on INT32_MIN, and clamp to INT32_MAX when
	// SAOM/AOVM is enabled.  RAOM preserves the wrapped 0x80000000 result.
	//
	// Keep this as a tiny instruction-level regression independent of the
	// retained full D0-C capture.  The opcodes below are the exact assembler
	// encodings used by that silicon program.
	static constexpr u32 ST0 = 0x01c083;
	static constexpr u32 OP_RAOM = 0x01e000;
	static constexpr u32 OP_SAOM = 0x01e800;
	static constexpr u32 OP_RAOV = 0x01c000;
	static constexpr u32 OP_LACC_C22 = 0x480522;
	static constexpr u32 OP_NEG = 0x080000;
	static constexpr u32 OP_ABS = 0x040000;
	static constexpr u32 OP_SACD_DE0 = 0x0011e0;
	static constexpr u32 OP_IDLE = 0xfc4000;

	struct boundary_case
	{
		const char *name;
		u32 mode_op;
		u32 arithmetic_op;
		u32 coefficient;
		u32 expected_dmem;
		bool expected_aov;
		bool expected_aovm;
	};

	static constexpr boundary_case cases[] = {
		{ "RAOM NEG INT32_MIN wraps", OP_RAOM, OP_NEG, 0x80000000, 0x800000, true, false },
		{ "SAOM NEG INT32_MIN clamps", OP_SAOM, OP_NEG, 0x80000000, 0x7fffff, true, true },
		{ "RAOM ABS INT32_MIN wraps", OP_RAOM, OP_ABS, 0x80000000, 0x800000, true, false },
		{ "SAOM ABS INT32_MIN clamps", OP_SAOM, OP_ABS, 0x80000000, 0x7fffff, true, true },
		{ "RAOM NEG ordinary positive", OP_RAOM, OP_NEG, 0x00000100, 0xffffff, false, false },
		{ "SAOM NEG ordinary positive", OP_SAOM, OP_NEG, 0x00000100, 0xffffff, false, true },
		{ "RAOM ABS ordinary negative", OP_RAOM, OP_ABS, 0xffffff00, 0x000001, false, false },
		{ "SAOM ABS ordinary negative", OP_SAOM, OP_ABS, 0xffffff00, 0x000001, false, true },
	};

	m_dsp->set_abs_saturate(false);
	for (const boundary_case &test : cases)
	{
		const std::array<u32, 6> program{
			test.mode_op,
			OP_RAOV,
			OP_LACC_C22,
			test.arithmetic_op,
			OP_SACD_DE0,
			OP_IDLE,
		};
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0, 0);
		m_dsp->debug_write_cmem(0x22, test.coefficient);
		m_dsp->debug_write_dmem0(0xe0, 0x55aa55);
		m_dsp->debug_set_exec_state(0, 0, 0, 0, 0, ST0, 0, 0);
		m_dsp->debug_run_cycles(16);
		const tms57002_device::debug_snapshot state = m_dsp->debug_capture_snapshot();

		char label[96];
		std::snprintf(label, sizeof(label), "%s result", test.name);
		check_equal(label, m_dsp->dmem0_value(0xe0), test.expected_dmem);
		std::snprintf(label, sizeof(label), "%s AOV", test.name);
		if (test.expected_aov)
			check_true(label, bool(state.st1 & tms57002_device::jit_st1_aov()));
		else
			check_false(label, bool(state.st1 & tms57002_device::jit_st1_aov()));
		std::snprintf(label, sizeof(label), "%s AOVM", test.name);
		if (test.expected_aovm)
			check_true(label, bool(state.st1 & tms57002_device::jit_st1_aovm()));
		else
			check_false(label, bool(state.st1 & tms57002_device::jit_st1_aovm()));
	}
}

void tms57002test_state::test_mac_a_d_full_width_port()
{
	static constexpr u32 ST0 = 0x01c083;
	static constexpr u32 OP_MAC_A_D15 = 0x00940115;

	std::array<u32, 2> program{ OP_MAC_A_D15, 0 };
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0, 0);
	m_dsp->debug_set_exec_state(0, 0, 0, 0, 0, ST0, 0, 0);
	m_dsp->debug_write_dmem0(0x15, 0xffff00);
	m_dsp->debug_set_accumulators(0x7fffffff, 0x100000000ULL, 0x100000000ULL, 0x100000000ULL, 0);
	m_dsp->debug_run_cycles(1);
	const auto state = m_dsp->debug_capture_snapshot();
	check_equal("MAC A,D keeps full-width AACC on C input", state.macc, 2);
	check_equal("MAC A,D writes full-width AACC to CREG", state.creg, 0x7fffffff);
}

void tms57002test_state::test_multiplier_a_port_drops_low_byte()
{
	static constexpr u32 ST0 = 0x01c083;
	static constexpr u32 OP_MPY_C02_A = 0x00880502;
	static constexpr u32 OP_MAC_C02_A = 0x00980502;
	static constexpr u32 OP_MACS_C02_A = 0x00b80502;

	struct test_case
	{
		const char *name;
		u32 opcode;
		u32 aacc;
		s64 macc_before;
		s64 expected;
	};
	static constexpr test_case cases[] = {
		{ "MPY C,A positive low byte", OP_MPY_C02_A, 0x000001ff, 0, 512 },
		{ "MPY C,A negative low byte", OP_MPY_C02_A, 0xffffff01, 0, -512 },
		{ "MAC C,A positive low byte", OP_MAC_C02_A, 0x000001ff, 37, 549 },
		{ "MACS C,A positive low byte", OP_MACS_C02_A, 0x000001ff, 37, 1061 },
	};

	for (const test_case &tc : cases)
	{
		std::array<u32, 2> program{ tc.opcode, 0 };
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0, 0);
		m_dsp->debug_set_exec_state(0, 0, 0, 0, 0, ST0, 0, 0);
		m_dsp->debug_write_cmem(0x02, 0x00010000);
		m_dsp->debug_set_accumulators(tc.aacc, u64(tc.macc_before), u64(tc.macc_before), u64(tc.macc_before), 0);
		m_dsp->debug_run_cycles(1);
		check_equal(tc.name, s64(m_dsp->debug_macc()), tc.expected);
	}
}

void tms57002test_state::test_sequential_pc_wrap_halts_until_sync()
{
	// A full 256-word program with no explicit IDLE consumes exactly one
	// silicon sample pass.  Sequential 0xff -> 0x00 therefore waits for the
	// next SYNC; it must not begin a second pass from the remaining MAME cycle
	// budget.  Zero words are inert here, so this isolates the control rule.
	std::array<u32, 0x100> program{};
	m_dsp->debug_load_program(program.data(), u32(program.size()), 0, 0);
	m_dsp->debug_begin_sample_frame({ 0, 0, 0, 0 });
	m_dsp->debug_run_cycles(256);

	check_equal("sequential PC wrap returns to PC 0", m_dsp->debug_capture_snapshot().pc, 0);
	check_equal("sequential PC wrap halts until SYNC", m_dsp->jit_is_idle(), true);

	m_dsp->debug_begin_sample_frame({ 0, 0, 0, 0 });
	check_equal("next SYNC releases PC-wrap halt", m_dsp->jit_is_idle(), false);
	m_dsp->debug_run_cycles(1);
	check_equal("next sample resumes at PC 0", m_dsp->debug_capture_snapshot().pc, 1);

