joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	// The halt is tied to sequential carry, not merely to observing PC 0.
	// Category-3 B 0 at PC ff takes the S_BRANCH path and must remain live.
	program[0xff] = 0x00fe4000;
	m_dsp->debug_load_program(program.data(), u32(program.size()), 0, 0);
	m_dsp->debug_begin_sample_frame({ 0, 0, 0, 0 });
	m_dsp->debug_run_cycles(256);
	check_equal("explicit branch target is PC 0", m_dsp->debug_capture_snapshot().pc, 0);
	check_equal("explicit branch to PC 0 remains live", m_dsp->jit_is_idle(), false);
}

void tms57002test_state::test_smld_raw_low_port()
{
	static constexpr u32 ST0 = 0x01c083;
	static constexpr u32 OP_SMLD_DE1 = 0x000021e1;

	static constexpr u64 raw_macc = 0x123456789abcdULL;
	for (u32 sfmo = 0; sfmo < 4; sfmo++)
	{
		const u32 st1 = sfmo << 11;
		std::array<u32, 2> program{ OP_SMLD_DE1, 0 };
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0, st1);
		m_dsp->debug_set_exec_state(0, 0, 0, 0, 0, ST0, st1, 0);
		m_dsp->debug_set_accumulators(0, raw_macc, raw_macc, raw_macc, 0);
		m_dsp->debug_run_cycles(1);

		char name[80];
		std::snprintf(name, sizeof(name), "SMLD raw low field sfmo=%u", sfmo);
		check_equal(name, m_dsp->dmem0_value(0xe1), 0x89abcd);
	}
}

void tms57002test_state::test_mac_a_d_and_smld_port_semantics()
{
	test_mac_a_d_full_width_port();
	test_smld_raw_low_port();
}

void tms57002test_state::test_domh_sfmo2_trace_cases()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_DSP3 = 0x000820;
	static constexpr u32 OPCODE_DOMH_SO0L = 0x00010000;
	static constexpr u32 OPCODE_DOMH_SO0R = 0x00010800;

	struct trace_case
	{
		const char *name;
		u32 opcode;
		u64 macc;
		u64 macc_read;
		u64 macc_write;
		int so_index;
		u32 so_expected;
		bool mov_expected;
	};

	static constexpr trace_case cases[] = {
		// These use the exact A02 controlled trace states, but account for execute_run()
		// advancing macc_read <- macc_write before the DOMH instruction executes.
		{ "DOMH sfmo2 impulse FE output", OPCODE_DOMH_SO0L, 0x012ff47f36cbaULL, 0xffffbb52e500895aULL, 0x00133b602aec38ULL, 0, 0x004ced80, false },
		{ "DOMH sfmo2 impulse FF output", OPCODE_DOMH_SO0R, 0x012ff47f36cbaULL, 0x00133b602aec38ULL, 0x012ff47f36cbaULL, 1, 0x004bfd1f, false },
		{ "DOMH sfmo2 sine FE output",    OPCODE_DOMH_SO0L, 0x020ffc0d97f64ULL, 0xffff88b4c600ee96ULL, 0x002168225e40cdULL, 0, 0x007fffff, true  },
		{ "DOMH sfmo2 sine FF output",    OPCODE_DOMH_SO0R, 0x020ffc0d97f64ULL, 0x002168225e40cdULL,   0x020ffc0d97f64ULL, 1, 0x007fffff, true  },
	};

	for (const auto &tc : cases)
	{
		std::array<u32, 2> program{ tc.opcode, 0 };
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_DSP3);
		m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP3, ST1_DSP3, 0);
		m_dsp->debug_set_accumulators(0, tc.macc, tc.macc_read, tc.macc_write, 0);
		m_dsp->debug_run_cycles(1);

		char name[96];
		std::snprintf(name, sizeof(name), "%s MOV", tc.name);
		const bool mov = bool(m_dsp->state_int(TMS57002_ST1) & 0x000040);
		if (tc.mov_expected) check_true(name, mov);
		else check_false(name, mov);

		std::snprintf(name, sizeof(name), "%s SO", tc.name);
		check_equal(name, m_dsp->debug_serial_output_register(tc.so_index), tc.so_expected);
	}
}

void tms57002test_state::test_dsp3_a02_f8_ff_tail_chain()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_START = 0x000020;
	static constexpr u32 OPCODE_F8 = 0x00880502; // mpy c(02),a
	static constexpr u32 OPCODE_F9 = 0x00901b5f; // mac d(5f),c*+ ; smhd d(5f)
	static constexpr u32 OPCODE_FA = 0x00fcc0c0; // lcak c0
	static constexpr u32 OPCODE_FB = 0x0000195d; // smhd d(5d)
	static constexpr u32 OPCODE_FC = 0x00840309; // mpy d(09),c*+
	static constexpr u32 OPCODE_FD = 0x00870b5d; // mpy d(5d),c*+ ; sfmo 2
	static constexpr u32 OPCODE_FE = 0x00010000; // domh so0_l
	static constexpr u32 OPCODE_FF = 0x00010800; // domh so0_r

	std::array<u32, 0x100> program{};
	program.fill(0);
	program[0xf8] = OPCODE_F8;
	program[0xf9] = OPCODE_F9;
	program[0xfa] = OPCODE_FA;
	program[0xfb] = OPCODE_FB;
	program[0xfc] = OPCODE_FC;
	program[0xfd] = OPCODE_FD;
	program[0xfe] = OPCODE_FE;
	program[0xff] = OPCODE_FF;

	struct tail_case
	{
		const char *tag;
		u8 ba0;
		u8 ba1;
		u32 d09;
		u32 d5d;
		u32 d5f;
		u32 aacc_after_f8;
		u64 macc_start;
		u64 macc_after_fc;
		u64 macc_after_fd;
		u64 macc_after_fe;
		u64 maccr_start;
		u64 maccw_start;
		u32 d_store;
		u32 so0_after_fe;
		u32 so1_after_ff;
		u32 st1_after_fe;
		u32 st1_after_ff;
	};

	static constexpr tail_case cases[] = {
		{
			"sine",
			0x6b, 0x95,
			0x0024c1, 0xe220a8, 0xeef68f,
			0xfff5f0b3,
			0xffff88b4c600ee96ULL,
			0x002168225e40cdULL,
			0x020ffc0d97f64ULL,
			0x020ffc0d97f64ULL,
			0xfffffffba1e49512ULL,
			0xfffffffcf0b3341bULL,
			0x88b4c6,
			0x007fffff,
			0x007fffff,
			0x000860,
			0x000860,
		},
		{
			"impulse",
			0x6d, 0x93,
			0x02679b, 0xda97ff, 0xe1dd00,
			0xfff5f0b3,
			0xffffbb52e500895aULL,
			0x00133b602aec38ULL,
			0x012ff47f36cbaULL,
			0x012ff47f36cbaULL,
			0xfffffffba1e49512ULL,
			0xfffffffcf0b3341bULL,
			0xbb52e5,
			0x004ced80,
			0x004bfd1f,
			0x000820,
			0x000820,
		},
	};

	for (const auto &tc : cases)
	{
		char name[128];
		const u8 phys_d09 = u8(tc.ba0 + 0x09);
		const u8 phys_d56 = u8(tc.ba0 + 0x56);
		const u8 phys_d5d = u8(tc.ba0 + 0x5d);
		const u8 phys_d5f = u8(tc.ba0 + 0x5f);

		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_START);
		m_dsp->debug_write_cmem(0x02, 0x7fffffff);
		m_dsp->debug_write_cmem(0x94, 0x00000000);
		m_dsp->debug_write_cmem(0xc0, 0xde36bc8f);
		m_dsp->debug_write_cmem(0xc1, 0xea05d421);
		m_dsp->debug_write_dmem0(phys_d09, tc.d09);
		m_dsp->debug_write_dmem0(phys_d5d, tc.d5d);
		m_dsp->debug_write_dmem0(phys_d5f, tc.d5f);
		m_dsp->debug_set_exec_state(0xf8, 0x94, 0x59, tc.ba0, tc.ba1, ST0_DSP3, ST1_START, 0);
		m_dsp->debug_set_accumulators(0xffff0000U, tc.macc_start, tc.maccr_start, tc.maccw_start, 0x7fffffff);

		m_dsp->debug_run_cycles(1); // f8
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f8 pc", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_PC), 0xf9);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f8 aacc", tc.tag);
		check_equal(name, u32(m_dsp->debug_aacc()), tc.aacc_after_f8);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f8 macc", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc()), s64(tc.macc_start));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f8 maccr", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_read()), s64(tc.maccw_start));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f8 maccw", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_write()), s64(tc.macc_start));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f8 creg", tc.tag);
		check_equal(name, m_dsp->debug_creg(), 0x7fffffffU);

		m_dsp->debug_run_cycles(1); // f9
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f9 pc", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_PC), 0xfa);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f9 macc", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc()), s64(tc.macc_start));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f9 maccr", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_read()), s64(tc.macc_start));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f9 maccw", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_write()), s64(tc.macc_start));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f9 creg", tc.tag);
		check_equal(name, m_dsp->debug_creg(), tc.aacc_after_f8);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s f9 d5f", tc.tag);
		check_equal(name, m_dsp->dmem0_value(phys_d5f), tc.d_store);

