joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
		m_dsp->debug_run_cycles(1); // fa
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fa pc", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_PC), 0xfb);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fa ca", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_CA), 0xc0);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fa creg", tc.tag);
		check_equal(name, m_dsp->debug_creg(), tc.aacc_after_f8);

		m_dsp->debug_run_cycles(1); // fb
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fb pc", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_PC), 0xfc);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fb d5d", tc.tag);
		check_equal(name, m_dsp->dmem0_value(phys_d5d), tc.d_store);

		m_dsp->debug_run_cycles(1); // fc
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fc pc", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_PC), 0xfd);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fc ca", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_CA), 0xc1);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fc macc", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc()), s64(tc.macc_after_fc));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fc creg", tc.tag);
		check_equal(name, m_dsp->debug_creg(), 0xdc27b873U);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fc d56", tc.tag);
		check_equal(name, m_dsp->dmem0_value(phys_d56), tc.d_store);

		m_dsp->debug_run_cycles(1); // fd
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fd pc", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_PC), 0xfe);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fd ca", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_CA), 0xc2);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fd macc", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc()), s64(tc.macc_after_fd));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fd maccr", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_read()), s64(tc.macc_start));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fd maccw", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_write()), s64(tc.macc_after_fc));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fd creg", tc.tag);
		check_equal(name, m_dsp->debug_creg(), 0xdc97b953U);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fd st1", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_ST1), 0x000820);

		m_dsp->debug_run_cycles(1); // fe
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fe pc", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_PC), 0xff);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fe macc", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc()), s64(tc.macc_after_fe));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fe maccr", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_read()), s64(tc.macc_after_fc));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fe maccw", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_write()), s64(tc.macc_after_fe));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fe st1", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_ST1), tc.st1_after_fe);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s fe so0", tc.tag);
		check_equal(name, m_dsp->debug_serial_output_register(0), tc.so0_after_fe);

		m_dsp->debug_run_cycles(1); // ff
		std::snprintf(name, sizeof(name), "dsp3 a02 %s ff pc", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_PC), 0x00);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s ff macc", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc()), s64(tc.macc_after_fe));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s ff maccr", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_read()), s64(tc.macc_after_fc));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s ff maccw", tc.tag);
		check_equal(name, s64(m_dsp->debug_macc_write()), s64(tc.macc_after_fe));
		std::snprintf(name, sizeof(name), "dsp3 a02 %s ff st1", tc.tag);
		check_equal(name, m_dsp->state_int(TMS57002_ST1), tc.st1_after_ff);
		std::snprintf(name, sizeof(name), "dsp3 a02 %s ff so1", tc.tag);
		check_equal(name, m_dsp->debug_serial_output_register(1), tc.so1_after_ff);
	}
}

void tms57002test_state::test_instruction_level_serial_passthrough()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_DSP3 = 0x000820;
	static constexpr u32 OPCODE_NOP = 0x000000;
	static constexpr u32 OPCODE_DIS_SI0L_D02 = 0x008102;
	static constexpr u32 OPCODE_DOS_SO0L_D02 = 0x00E102;
	static constexpr u32 OPCODE_IDLE = 0xFC4000;
	static constexpr u32 INPUT_SAMPLE = 0x00123456;

	std::array<u32, 0x3f> program{};
	program.fill(OPCODE_NOP);
	program[0x3c] = OPCODE_DIS_SI0L_D02;
	program[0x3d] = OPCODE_DOS_SO0L_D02;
	program[0x3e] = OPCODE_IDLE;

	m_dsp->set_serial_frame_model(true);
	m_dsp->set_serial_frame_clocks(512);
	m_dsp->set_sync_polarity(1);
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_DSP3);

	check_equal("serial load program st0", m_dsp->state_int(TMS57002_ST0), ST0_DSP3);
	check_equal("serial load program st1", m_dsp->state_int(TMS57002_ST1), ST1_DSP3);
	check_equal("serial load program pc", m_dsp->state_int(TMS57002_PC), 0);

	const auto one_cycle = m_dsp->debug_run_sample_frame({INPUT_SAMPLE, 0, 0, 0}, 1);
	check_equal("serial one-cycle so0", one_cycle[0], 0);
	check_equal("serial one-cycle so1", one_cycle[1], 0);
	check_equal("serial one-cycle pc", m_dsp->state_int(TMS57002_PC), 1);

	std::array<u32, 3> dis_program{ OPCODE_DIS_SI0L_D02, OPCODE_NOP, OPCODE_IDLE };
	m_dsp->debug_load_program(dis_program.data(), u32(dis_program.size()), ST0_DSP3, ST1_DSP3);
	const auto dis_frame = m_dsp->debug_run_sample_frame({INPUT_SAMPLE, 0, 0, 0}, 8);
	check_equal("serial dis ba0 after sync", m_dsp->debug_ba0(), 0xff);
	check_equal("serial dis physical d01", m_dsp->dmem0_value(0x01), INPUT_SAMPLE);
	check_equal("serial dis so0 remains zero", dis_frame[0], 0);
	check_equal("serial dis pc after idle", m_dsp->state_int(TMS57002_PC), 3);

	std::array<u32, 3> dos_program{ OPCODE_DIS_SI0L_D02, OPCODE_DOS_SO0L_D02, OPCODE_IDLE };
	m_dsp->debug_load_program(dos_program.data(), u32(dos_program.size()), ST0_DSP3, ST1_DSP3);
	const auto dos_frame = m_dsp->debug_run_sample_frame({INPUT_SAMPLE, 0, 0, 0}, 8);
	check_equal("serial dos physical d01", m_dsp->dmem0_value(0x01), INPUT_SAMPLE);
	check_equal("serial dos so0 register", m_dsp->debug_serial_output_register(0), INPUT_SAMPLE);
	check_equal("serial dos so0 pin first frame", dos_frame[0], 0);
	check_equal("serial dos pc after idle", m_dsp->state_int(TMS57002_PC), 3);
}

void tms57002test_state::test_example53_bank_switched_serial_access()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_DSP3 = 0x000820;
	static constexpr u32 OPCODE_IDLE = 0xFC4000;
	static constexpr u32 OPCODE_LDPK_1 = 0x022800;
	static constexpr u32 OPCODE_DIS_SI1L_D00 = 0x009100;
	static constexpr u32 OPCODE_DOS_SO1L_D00 = 0x00F100;
	static constexpr u32 INPUT_SAMPLE = 0x00543210;
	static constexpr u32 DMEM0_SENTINEL = 0x00111111;
	static constexpr u32 DMEM1_SENTINEL = 0x00222222;

	m_dsp->set_serial_frame_model(true);
	m_dsp->set_serial_frame_clocks(512);
	m_dsp->set_sync_polarity(1);

	{
		std::array<u32, 3> program{ OPCODE_LDPK_1, OPCODE_DIS_SI1L_D00, OPCODE_IDLE };
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_DSP3);
		m_dsp->debug_write_dmem0(0x01, DMEM0_SENTINEL);
		m_dsp->debug_write_dmem1(0x01, DMEM1_SENTINEL);
		const auto frame = m_dsp->debug_run_sample_frame({ 0, 0, INPUT_SAMPLE, 0 }, 8);
		check_equal("example53 dis bank-switched ba1", m_dsp->debug_ba1(), 0x01);
		check_equal("example53 dis writes dmem1[1]", m_dsp->dmem1_value(0x01), INPUT_SAMPLE);
		check_equal("example53 dis keeps dmem0[1]", m_dsp->dmem0_value(0x01), DMEM0_SENTINEL);
		check_equal("example53 dis frame pin stays zero", frame[2], 0);
	}

	{
		std::array<u32, 3> program{ OPCODE_LDPK_1, OPCODE_DOS_SO1L_D00, OPCODE_IDLE };
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_DSP3);
		m_dsp->debug_write_dmem0(0x01, DMEM0_SENTINEL);
		m_dsp->debug_write_dmem1(0x01, DMEM1_SENTINEL);
		const auto frame = m_dsp->debug_run_sample_frame({ 0, 0, 0, 0 }, 8);
		check_equal("example53 dos bank-switched so1_l reg", m_dsp->debug_serial_output_register(2), DMEM1_SENTINEL);
		check_equal("example53 dos bank-switched pin first frame", frame[2], 0);
	}
}

void tms57002test_state::test_example53_one_frame_output_latency()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_DSP3 = 0x000820;
	static constexpr u32 OPCODE_IDLE = 0xFC4000;
	static constexpr u32 OPCODE_DOS_SO0L_D01 = 0x00E101;
	static constexpr u32 OUTPUT_SAMPLE = 0x00654321;

