joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	std::array<u32, 0x100> program{};
	program.fill(0);
	program[0x00] = OPCODE_DOS_SO0L_D01;
	program[0xff] = OPCODE_IDLE;

	m_dsp->set_serial_frame_model(true);
	m_dsp->set_serial_frame_clocks(512);
	m_dsp->set_sync_polarity(1);
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_DSP3);
	m_dsp->debug_write_dmem0(0x00, OUTPUT_SAMPLE);

	const auto frame0 = m_dsp->debug_run_sample_frame({ 0, 0, 0, 0 }, 0x200);
	check_equal("example53 latency so0 reg after frame0", m_dsp->debug_serial_output_register(0), OUTPUT_SAMPLE);
	check_equal("example53 latency pin frame0", frame0[0], OUTPUT_SAMPLE);

	const auto frame1 = m_dsp->debug_run_sample_frame({ 0, 0, 0, 0 }, 0x200);
	check_equal("example53 latency pin frame1", frame1[0], 0);
}

void tms57002test_state::test_example53_dos_deadline()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_DSP3 = 0x000820;
	static constexpr u32 OPCODE_IDLE = 0xFC4000;
	static constexpr u32 OPCODE_DOS_SO0L_D01 = 0x00E101;
	static constexpr u32 OUTPUT_SAMPLE = 0x003579bd;

	auto run_case = [this](u8 dos_pc) -> std::array<u32, 2>
	{
		std::array<u32, 0x100> program{};
		program.fill(0);
		program[dos_pc] = OPCODE_DOS_SO0L_D01;
		program[0xff] = OPCODE_IDLE;

		m_dsp->set_serial_frame_model(true);
		m_dsp->set_serial_frame_clocks(512);
		m_dsp->set_sync_polarity(1);
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_DSP3);
		m_dsp->debug_write_dmem0(0x00, OUTPUT_SAMPLE);

		const auto frame0 = m_dsp->debug_run_sample_frame({ 0, 0, 0, 0 }, 0x200);
		const auto frame1 = m_dsp->debug_run_sample_frame({ 0, 0, 0, 0 }, 0x200);
		return { frame0[0], frame1[0] };
	};

	const auto at_fa = run_case(0xfa);
	check_equal("example53 dos@fa frame0", at_fa[0], OUTPUT_SAMPLE);
	check_equal("example53 dos@fa frame1", at_fa[1], 0);

	const auto at_fb = run_case(0xfb);
	check_equal("example53 dos@fb frame0", at_fb[0], OUTPUT_SAMPLE);
	check_equal("example53 dos@fb frame1", at_fb[1], 0);
}

void tms57002test_state::test_dsp3_mpy_dis_uses_prior_dmem()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_DSP3 = 0x000820;
	static constexpr u32 OPCODE_IDLE = 0xFC4000;
	static constexpr u32 OPCODE_DSP3_PC3C = 0x00848302; // mpy d(02),c*+ ; dis si0_l,d(02)
	static constexpr u32 OLD_SAMPLE = 0x00011111;
	static constexpr u32 NEW_SAMPLE = 0x00022222;
	static constexpr u32 UNITY_COEFF = 0x00000080;

	std::array<u32, 3> program{ OPCODE_DSP3_PC3C, OPCODE_IDLE, 0 };

	m_dsp->set_serial_frame_model(true);
	m_dsp->set_serial_frame_clocks(512);
	m_dsp->set_sync_polarity(1);
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_DSP3);
	m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);
	m_dsp->debug_write_cmem(0x00, UNITY_COEFF);
	m_dsp->debug_write_dmem0(0x01, OLD_SAMPLE); // d(02) after sync with BA0=ff

	const auto frame = m_dsp->debug_run_sample_frame({ NEW_SAMPLE, 0, 0, 0 }, 8);
	check_equal("dsp3 mpy/dis updates d(02) from SI", m_dsp->dmem0_value(0x01), NEW_SAMPLE);
	check_equal("dsp3 mpy/dis pin frame stays zero", frame[0], 0);
	check_equal("dsp3 mpy/dis macc uses prior dmem", s64(m_dsp->debug_macc()), s64(OLD_SAMPLE));
	check_equal("dsp3 mpy/dis macc_read holds prior cycle", s64(m_dsp->debug_macc_read()), 0);
}

void tms57002test_state::test_dsp3_mpy_dis_uses_incoming_dmem()
{
	// Four standalone silicon runs (312 exact words) establish that a DIS
	// co-issued with a DMEM-reading MPY writes early enough for MPY to consume
	// the incoming serial word. This is the live DSP3 distortion idiom.
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_DSP3 = 0x000820;
	static constexpr u32 OPCODE_IDLE = 0xFC4000;
	static constexpr u32 OPCODE_MPY_D02_CSTAR__DIS_SI0L_D02 = 0x00848302;
	static constexpr u32 OLD_SAMPLE = 0x00011111;
	static constexpr u32 INCOMING_SAMPLE = 0x00022222;
	static constexpr u32 UNITY_COEFF = 0x00000080;

	std::array<u32, 3> program{ OPCODE_MPY_D02_CSTAR__DIS_SI0L_D02, OPCODE_IDLE, 0 };
	m_dsp->set_serial_frame_model(true);
	m_dsp->set_serial_frame_clocks(512);
	m_dsp->set_sync_polarity(1);
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_DSP3);
	m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);
	m_dsp->debug_write_cmem(0x00, UNITY_COEFF);
	m_dsp->debug_write_dmem0(0x01, OLD_SAMPLE); // logical d(02) after SYNC makes BA0=ff

	const auto frame = m_dsp->debug_run_sample_frame({ INCOMING_SAMPLE, 0, 0, 0 }, 8);
	check_equal("dsp3 mpy/dis stores incoming SI word", m_dsp->dmem0_value(0x01), INCOMING_SAMPLE);
	check_equal("dsp3 mpy/dis pin frame stays zero", frame[0], 0);
	check_equal("dsp3 mpy/dis multiplier consumes incoming word", s64(m_dsp->debug_macc()), s64(INCOMING_SAMPLE));
	check_equal("dsp3 mpy/dis macc_read holds prior cycle", s64(m_dsp->debug_macc_read()), 0);
}

void tms57002test_state::test_dsp3_wre_smhd_orders_store_before_xwr()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_CLEAR = 0x000000;
	static constexpr u32 OPCODE_WRE_D00_CSTAR__SMHD_D00 = 0x00e01b00;
	static constexpr u32 DMEM_SAMPLE = 0x00123400;
	static constexpr u64 MACC_SAMPLE = 0x0123456789012ULL;

	std::array<u32, 0x20> program{};
	program.fill(0);
	program[0x00] = OPCODE_WRE_D00_CSTAR__SMHD_D00;
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_CLEAR);
	m_dsp->debug_write_dmem0(0x00, DMEM_SAMPLE);
	m_dsp->debug_write_cmem(0x7d, 0x00000001);
	m_dsp->debug_set_exec_state(0x00, 0x7d, 0x00, 0x00, 0x00, ST0_DSP3, ST1_CLEAR, 0);
	m_dsp->debug_set_accumulators(0, MACC_SAMPLE, MACC_SAMPLE, MACC_SAMPLE, 0);
	m_dsp->debug_set_xmem_state(0, 0x00008, 0, 0, 0, 0, 0, 0);

	address_space &ext = m_dsp->space(AS_DATA);
	ext.write_byte(0x12, 0x00);
	ext.write_byte(0x13, 0x00);

	m_dsp->debug_run_cycles(32);

	check_equal("dsp3 wre/smhd xwr uses store-updated dmem", m_dsp->debug_xwr(), 0x00123456);
	check_equal("dsp3 wre/smhd dmem updated after wre", m_dsp->dmem0_value(0x00), 0x00123456);
	check_equal("dsp3 wre/smhd ext byte hi", ext.read_byte(0x12), 0x12);
	check_equal("dsp3 wre/smhd ext byte lo", ext.read_byte(0x13), 0x34);
}

void tms57002test_state::test_dsp3_rde_sacc_uses_store_updated_cmem_for_xoa()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_CLEAR = 0x000000;
	static constexpr u32 OPCODE_NOP = 0x000000;
	static constexpr u32 OPCODE_RDE_C46__SACC_C46 = 0x00e40d46;

