joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	std::array<u32, 4> program{ OPCODE_RDE_C46__SACC_C46, OPCODE_NOP, OPCODE_NOP, OPCODE_NOP };
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_CLEAR);
	m_dsp->debug_write_cmem(0x46, 0x00000001);
	m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP3, ST1_CLEAR, 0);
	m_dsp->debug_set_accumulators(0x12345678, 0, 0, 0, 0);
	m_dsp->debug_set_xmem_state(0, 0x00008, 0, 0, 0, 0, 0, 0);

	m_dsp->debug_run_cycles(1);

	// The 2026-07-28 direct XRAM-bus discriminator proved that the category-2
	// store retires before RDE latches its address operand.
	check_equal("dsp3 rde/sacc xoa uses store-updated cmem", m_dsp->debug_xoa(), 0x12345678);
	check_equal("dsp3 rde/sacc cmem stores aacc", m_dsp->cmem_value(0x46), 0x12345678);
}

void tms57002test_state::test_dsp3_lmhd_srbd_uses_store_updated_dmem_for_macc()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_CLEAR = 0x000000;
	static constexpr u32 OPCODE_LMHD_D46__SRBD_D46 = 0x00c47946;
	static constexpr u32 OLD_DMEM = 0x00abcdef;
	static constexpr u32 XRD_VALUE = 0x00123456;

	std::array<u32, 2> program{ OPCODE_LMHD_D46__SRBD_D46, 0 };
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_CLEAR);
	m_dsp->debug_write_dmem0(0x46, OLD_DMEM);
	m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP3, ST1_CLEAR, 0);
	m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);
	m_dsp->debug_set_xmem_state(0, 0, 0, XRD_VALUE, 0, 0, 0, 0);

	m_dsp->debug_run_cycles(1);

	// SRBD retires before the co-issued LMHD reads DMEM, matching the same
	// silicon-proven store-before-category-1 rule.
	check_equal("dsp3 lmhd/srbd dmem becomes xrd", m_dsp->dmem0_value(0x46), XRD_VALUE);
	check_equal("dsp3 lmhd/srbd macc uses store-updated dmem", s64(m_dsp->debug_macc()), sx24(XRD_VALUE) << 24);
}

void tms57002test_state::test_lacc_lira_same_word_uses_pre_lacc_aacc()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_CLEAR = 0x000000;
	static constexpr u32 OPCODE_LACC_C79__LIRA = 0x00484d79;
	static constexpr u32 OLD_AACC = 0x46000000;
	static constexpr u32 C79_VALUE = 0xe08a067a;

	std::array<u32, 2> program{ OPCODE_LACC_C79__LIRA, 0 };
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_CLEAR);
	m_dsp->debug_write_cmem(0x79, C79_VALUE);
	m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP3, ST1_CLEAR, 0);
	m_dsp->debug_set_accumulators(OLD_AACC, 0, 0, 0, 0);

	m_dsp->debug_run_cycles(1);

	check_equal("lacc/lira same-word aacc", u32(m_dsp->debug_aacc()), C79_VALUE);
	check_equal("lacc/lira same-word id", m_dsp->state_int(TMS57002_ID), OLD_AACC >> 24);
}

void tms57002test_state::test_cmem_update_multiword_sequence()
{
	static constexpr u32 ST0_DSP2 = 0x01c082;
	static constexpr u32 ST1_DSP2 = 0x000020;
	static constexpr u32 OPCODE_NOP = 0x000000;
	static constexpr u32 OPCODE_LACC_C_BASE = 0x00480500;
	static constexpr u32 UPDATE0 = 0x00010000;
	static constexpr u32 UPDATE1 = 0x00020000;
	static constexpr u32 UPDATE2 = 0x00030000;

	const auto write_update_word = [this](u32 value)
	{
		m_dsp->data_w(u8(value >> 24));
		m_dsp->data_w(u8(value >> 16));
		m_dsp->data_w(u8(value >> 8));
		m_dsp->data_w(u8(value));
	};

	std::array<u32, 4> program{
		OPCODE_LACC_C_BASE | 0x10,
		OPCODE_LACC_C_BASE | 0x11,
		OPCODE_LACC_C_BASE | 0x12,
		OPCODE_NOP
	};

	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
	m_dsp->debug_write_cmem(0x10, 0x01010101);
	m_dsp->debug_write_cmem(0x11, 0x02020202);
	m_dsp->debug_write_cmem(0x12, 0x03030303);
	m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP2, ST1_DSP2, 0);
	m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);

	m_dsp->cload_w(0);
	m_dsp->data_w(0x10);
	write_update_word(UPDATE0);
	write_update_word(UPDATE1);
	write_update_word(UPDATE2);
	m_dsp->cload_w(1);

	check_equal("cmem update queued words", m_dsp->update_pending_count(), 3);

	m_dsp->debug_run_cycles(1);
	check_equal("cmem update0 aacc", u32(m_dsp->debug_aacc()), UPDATE0);
	check_equal("cmem update0 target", m_dsp->cmem_value(0x10), UPDATE0);
	check_equal("cmem update after first read pending", m_dsp->update_pending_count(), 2);

	m_dsp->debug_run_cycles(1);
	check_equal("cmem update1 aacc", u32(m_dsp->debug_aacc()), UPDATE1);
	check_equal("cmem update1 target", m_dsp->cmem_value(0x11), UPDATE1);
	check_equal("cmem update after second read pending", m_dsp->update_pending_count(), 1);

	m_dsp->debug_run_cycles(1);
	check_equal("cmem update2 aacc", u32(m_dsp->debug_aacc()), UPDATE2);
	check_equal("cmem update2 target", m_dsp->cmem_value(0x12), UPDATE2);
	check_equal("cmem update empty after sequence", m_dsp->update_pending_count(), 0);

	// The modulo head/tail representation aliases empty and full.  Exercise
	// all 16 physical update registers and verify that a seventeenth word does
	// not erase or overwrite the valid queue.
	std::array<u32, 16> full_program{};
	for (u32 i = 0; i < full_program.size(); i++)
		full_program[i] = OPCODE_LACC_C_BASE | (0x20 + i);
	const u32 program_version_before_full_load = m_dsp->jit_program_version();
	m_dsp->debug_load_program(full_program.data(), u32(full_program.size()), ST0_DSP2, ST1_DSP2);
	check_equal("cmem program reload invalidates pooled cache",
		m_dsp->jit_program_version(), program_version_before_full_load + 1);
	m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP2, ST1_DSP2, 0);
	m_dsp->cload_w(0);
	m_dsp->data_w(0x20);
	for (u32 i = 0; i < 16; i++)
		write_update_word(0x10000000U + i);

	auto full = m_dsp->debug_capture_snapshot();
	check_equal("cmem update full count", full.update_counter_count, 16);
	check_equal("cmem update full head-tail alias", full.update_counter_head, full.update_counter_tail);
	check_equal("cmem update full first preserved", full.update[0], 0x10000000);
	check_equal("cmem update full last preserved", full.update[15], 0x1000000f);
	check_equal("cmem update full EMPTY low", m_dsp->empty_r(), 0);

	write_update_word(0xdeadbeef);
	full = m_dsp->debug_capture_snapshot();
	check_equal("cmem update overflow count preserved", full.update_counter_count, 16);
	check_equal("cmem update overflow oldest preserved", full.update[0], 0x10000000);
	check_equal("cmem update overflow newest preserved", full.update[15], 0x1000000f);
	m_dsp->cload_w(1);
	m_dsp->debug_run_cycles(1);
	check_equal("cmem update pre-restore count", m_dsp->update_pending_count(), 15);
	m_dsp->debug_restore_snapshot(full);
	check_equal("cmem update full snapshot count restored", m_dsp->update_pending_count(), 16);
	check_equal("cmem update full snapshot EMPTY low", m_dsp->empty_r(), 0);
	m_dsp->cload_w(1);
	for (u32 i = 0; i < 16; i++)
	{
		m_dsp->debug_run_cycles(1);
		check_equal("cmem update full sequence value", m_dsp->cmem_value(0x20 + i), 0x10000000U + i);
	}
	check_equal("cmem update full sequence drained", m_dsp->update_pending_count(), 0);
	check_equal("cmem update drained EMPTY high", m_dsp->empty_r(), 1);

	// In the explicit pooled-CMEM test profile, the first pass above compiles
	// the program while executing it through the interpreter.  Restore the
	// identical full-ring state and prove that the cached native entry actually
	// runs and observes all 16 queued words rather than treating head == tail as
	// empty.  The normal public profile remains interpreter-only and skips this
	// additional backend-specific pass.
	const char *const perframe = std::getenv("KPROP_DSP_PERFRAME");
	const bool pooled_cmem_profile = perframe && std::atoi(perframe) == 4
		&& std::getenv("KPROP_PF4_CMEM_DEOPT");
	const bool forced_guard_compile_failure = std::getenv("KPROP_PF4_FORCE_CMEM_COMPILE_FAIL");
	if (pooled_cmem_profile)
	{
		m_dsp->debug_restore_snapshot(full);
		m_dsp->cload_w(1);
		const long runs_before = m_dsp->debug_pooled_run_count();
		const long cmem_runs_before = m_dsp->debug_pooled_cmem_run_count();
		for (u32 i = 0; i < 16; i++)
			m_dsp->debug_run_cycles(1);
		if (forced_guard_compile_failure)
		{
			check_equal("cmem missing guarded entry avoids native base", m_dsp->debug_pooled_run_count(), runs_before);
			check_equal("cmem missing guarded entry not selected", m_dsp->debug_pooled_cmem_run_count(), cmem_runs_before);
		}
		else
		{
			check_true("cmem pooled native entry executed", m_dsp->debug_pooled_run_count() > runs_before);
			check_true("cmem pooled guarded entry selected", m_dsp->debug_pooled_cmem_run_count() > cmem_runs_before);
		}
		check_equal("cmem pooled full sequence drained", m_dsp->update_pending_count(), 0);
		for (u32 i = 0; i < 16; i++)
			check_equal("cmem pooled full sequence value", m_dsp->cmem_value(0x20 + i), 0x10000000U + i);
		check_equal("cmem pooled drained EMPTY high", m_dsp->empty_r(), 1);
	}

	// JIT analysis takes and restores debug snapshots.  Preserve partially
	// received host bytes as well as HIDX, otherwise a restored packet can be
	// assembled from bytes written after the snapshot.
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
	m_dsp->cload_w(0);
	m_dsp->data_w(0x40);
	m_dsp->data_w(0x12);
	m_dsp->data_w(0x34);
	const auto partial = m_dsp->debug_capture_snapshot();
	check_equal("cmem partial snapshot hidx", partial.hidx, 2);
	check_equal("cmem partial snapshot byte0", partial.host[0], 0x12);
	check_equal("cmem partial snapshot byte1", partial.host[1], 0x34);
	m_dsp->data_w(0xaa);
	m_dsp->data_w(0xbb);
	m_dsp->debug_restore_snapshot(partial);
	m_dsp->data_w(0x56);
	check_equal("cmem partial fourth-STRB EMPTY low", m_dsp->empty_r(), 0);
	m_dsp->data_w(0x78);
	const auto restored = m_dsp->debug_capture_snapshot();
	check_equal("cmem partial restored queue count", restored.update_counter_count, 1);
	check_equal("cmem partial restored packet", restored.update[0], 0x12345678);
}

void tms57002test_state::test_cmem_update_waits_for_cload_high()
{
	static constexpr u32 ST0_DSP2 = 0x01c082;
	static constexpr u32 ST1_DSP2 = 0x000020;
	static constexpr u32 OPCODE_LACC_C10 = 0x00480510;
	static constexpr u32 OPCODE_NOP = 0x000000;
	static constexpr u32 OLD_C10 = 0x01010101;
	static constexpr u32 UPDATE0 = 0x00010000;

