joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	const auto write_update_word = [this](u32 value)
	{
		m_dsp->data_w(u8(value >> 24));
		m_dsp->data_w(u8(value >> 16));
		m_dsp->data_w(u8(value >> 8));
		m_dsp->data_w(u8(value));
	};

	std::array<u32, 3> program{
		OPCODE_LACC_C10,
		OPCODE_LACC_C10,
		OPCODE_NOP
	};

	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
	m_dsp->debug_write_cmem(0x10, OLD_C10);
	m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP2, ST1_DSP2, 0);
	m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);

	m_dsp->cload_w(0);
	m_dsp->data_w(0x10);
	write_update_word(UPDATE0);

	check_equal("cmem cload-low update queued", m_dsp->update_pending_count(), 1);

	m_dsp->debug_run_cycles(1);
	check_equal("cmem cload-low aacc remains old", u32(m_dsp->debug_aacc()), OLD_C10);
	check_equal("cmem cload-low target remains old", m_dsp->cmem_value(0x10), OLD_C10);
	check_equal("cmem cload-low update still pending", m_dsp->update_pending_count(), 1);

	m_dsp->cload_w(1);
	m_dsp->debug_run_cycles(1);
	check_equal("cmem cload-high aacc receives update", u32(m_dsp->debug_aacc()), UPDATE0);
	check_equal("cmem cload-high target updated", m_dsp->cmem_value(0x10), UPDATE0);
	check_equal("cmem cload-high update consumed", m_dsp->update_pending_count(), 0);
}

void tms57002test_state::test_cmem_update_new_address_breaks_active_run()
{
	static constexpr u32 ST0_DSP2 = 0x01c082;
	static constexpr u32 ST1_DSP2 = 0x000020;
	static constexpr u32 OPCODE_NOP = 0x000000;
	static constexpr u32 OPCODE_LACC_C_BASE = 0x00480500;
	static constexpr u32 OLD_C37 = 0x37373737;
	static constexpr u32 OLD_C38 = 0x38383838;
	static constexpr u32 OLD_C39 = 0x39393939;
	static constexpr u32 UPDATE38 = 0x11111111;
	static constexpr u32 UPDATE37 = 0x22222222;

	const auto write_update_word = [this](u32 value)
	{
		m_dsp->data_w(u8(value >> 24));
		m_dsp->data_w(u8(value >> 16));
		m_dsp->data_w(u8(value >> 8));
		m_dsp->data_w(u8(value));
	};

	std::array<u32, 4> program{
		OPCODE_LACC_C_BASE | 0x38,
		OPCODE_LACC_C_BASE | 0x39,
		OPCODE_LACC_C_BASE | 0x37,
		OPCODE_NOP
	};

	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
	m_dsp->debug_write_cmem(0x37, OLD_C37);
	m_dsp->debug_write_cmem(0x38, OLD_C38);
	m_dsp->debug_write_cmem(0x39, OLD_C39);
	m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP2, ST1_DSP2, 0);
	m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);

	m_dsp->cload_w(0);
	m_dsp->data_w(0x38);
	write_update_word(UPDATE38);
	m_dsp->cload_w(1);
	m_dsp->cload_w(0);
	m_dsp->data_w(0x37);
	write_update_word(UPDATE37);
	m_dsp->cload_w(1);

	check_equal("cmem explicit-address queue words", m_dsp->update_pending_count(), 2);

	m_dsp->debug_run_cycles(1);
	check_equal("cmem explicit update38 aacc", u32(m_dsp->debug_aacc()), UPDATE38);
	check_equal("cmem explicit update38 target", m_dsp->cmem_value(0x38), UPDATE38);
	check_equal("cmem explicit after c38 pending", m_dsp->update_pending_count(), 1);

	m_dsp->debug_run_cycles(1);
	check_equal("cmem explicit c39 remains old", u32(m_dsp->debug_aacc()), OLD_C39);
	check_equal("cmem explicit c39 target unchanged", m_dsp->cmem_value(0x39), OLD_C39);
	check_equal("cmem explicit after c39 pending", m_dsp->update_pending_count(), 1);

	m_dsp->debug_run_cycles(1);
	check_equal("cmem explicit update37 aacc", u32(m_dsp->debug_aacc()), UPDATE37);
	check_equal("cmem explicit update37 target", m_dsp->cmem_value(0x37), UPDATE37);
	check_equal("cmem explicit consumed after c37", m_dsp->update_pending_count(), 0);
}

void tms57002test_state::test_pc33_mpy_mac_direct_coeff_chain()
{
	static constexpr u32 ST0_DSP2 = 0x01c082;
	static constexpr u32 ST1_DSP2 = 0x000020;
	static constexpr u32 OPCODE_NOP = 0x000000;
	static constexpr u32 OPCODE_MPY_DSTAR_C40 = 0x00840740;
	static constexpr u32 OPCODE_MAC_DSTAR_C41 = 0x00900741;
	static constexpr u32 OPCODE_MAC_DSTAR_C42 = 0x00900742;
	static constexpr u32 OPCODE_MAC_DSTAR_C43 = 0x00900743;
	static constexpr u32 OPCODE_MPY_DSTAR_C45 = 0x00840745;
	static constexpr u32 OPCODE_MAC_DSTAR_C46 = 0x00900746;
	static constexpr u32 OPCODE_MAC_DSTAR_C47 = 0x00900747;
	static constexpr u32 OPCODE_MAC_DSTAR_C48 = 0x00900748;
	static constexpr u32 D40_VALUE = 0x000100;
	static constexpr u32 D41_VALUE = 0x000080;
	static constexpr u32 D42_VALUE = 0x000200;
	static constexpr u32 D43_VALUE = 0x000040;
	static constexpr u32 C40_VALUE = 0x00010000;
	static constexpr u32 C41_ZERO = 0x00000000;
	static constexpr u32 C42_ZERO = 0x00000000;
	static constexpr u32 C42_VALUE = 0x00020000;
	static constexpr u32 C43_ZERO = 0x00000000;
	static constexpr u32 C45_VALUE = 0x00030000;
	static constexpr u32 C46_ZERO = 0x00000000;
	static constexpr u32 C47_ZERO = 0x00000000;
	static constexpr u32 C47_VALUE = 0x00050000;
	static constexpr u32 C48_ZERO = 0x00000000;

	std::array<u32, 0x40> program;
	program.fill(OPCODE_NOP);
	program[0x33] = OPCODE_MPY_DSTAR_C40;
	program[0x34] = OPCODE_MAC_DSTAR_C41;
	program[0x35] = OPCODE_MAC_DSTAR_C42;
	program[0x36] = OPCODE_MAC_DSTAR_C43;
	program[0x3b] = OPCODE_MPY_DSTAR_C45;
	program[0x3c] = OPCODE_MAC_DSTAR_C46;
	program[0x3d] = OPCODE_MAC_DSTAR_C47;
	program[0x3e] = OPCODE_MAC_DSTAR_C48;

	const auto run_case = [&](u32 c42_value) -> std::array<u64, 3>
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
		m_dsp->debug_write_dmem0(0x40, D40_VALUE);
		m_dsp->debug_write_dmem0(0x41, D41_VALUE);
		m_dsp->debug_write_dmem0(0x42, D42_VALUE);
		m_dsp->debug_write_cmem(0x40, C40_VALUE);
		m_dsp->debug_write_cmem(0x41, C41_ZERO);
		m_dsp->debug_write_cmem(0x42, c42_value);
		m_dsp->debug_set_exec_state(0x33, 0x00, 0x40, 0x00, 0x00, ST0_DSP2, ST1_DSP2, 0);
		m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);

		m_dsp->debug_run_cycles(1);
		const u64 after_mpy = m_dsp->debug_macc();
		m_dsp->debug_run_cycles(1);
		const u64 after_mac_c41 = m_dsp->debug_macc();
		m_dsp->debug_run_cycles(1);
		const u64 after_mac_c42 = m_dsp->debug_macc();
		return { after_mpy, after_mac_c41, after_mac_c42 };
	};

