joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	const auto run_pc33_block = [&](u32 c42_value) -> std::array<u64, 4>
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
		m_dsp->debug_write_dmem0(0x07, D40_VALUE);
		m_dsp->debug_write_dmem0(0x08, D41_VALUE);
		m_dsp->debug_write_dmem0(0x09, D42_VALUE);
		m_dsp->debug_write_dmem0(0x0a, D43_VALUE);
		m_dsp->debug_write_cmem(0x40, C40_VALUE);
		m_dsp->debug_write_cmem(0x41, C41_ZERO);
		m_dsp->debug_write_cmem(0x42, c42_value);
		m_dsp->debug_write_cmem(0x43, C43_ZERO);
		m_dsp->debug_set_exec_state(0x33, 0x00, 0x07, 0x00, 0x00, ST0_DSP2, ST1_DSP2, 0);
		m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);

		std::array<u64, 4> out{};
		for (u32 i = 0; i < 4; i++)
		{
			m_dsp->debug_run_cycles(1);
			out[i] = m_dsp->debug_macc();
		}
		return out;
	};

	const auto run_pc3b_block = [&](u32 c47_value) -> std::array<u64, 4>
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
		m_dsp->debug_write_dmem0(0x07, D40_VALUE);
		m_dsp->debug_write_dmem0(0x08, D41_VALUE);
		m_dsp->debug_write_dmem0(0x09, D42_VALUE);
		m_dsp->debug_write_dmem0(0x0a, D43_VALUE);
		m_dsp->debug_write_cmem(0x45, C45_VALUE);
		m_dsp->debug_write_cmem(0x46, C46_ZERO);
		m_dsp->debug_write_cmem(0x47, c47_value);
		m_dsp->debug_write_cmem(0x48, C48_ZERO);
		m_dsp->debug_set_exec_state(0x3b, 0x00, 0x07, 0x00, 0x00, ST0_DSP2, ST1_DSP2, 0);
		m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);

		std::array<u64, 4> out{};
		for (u32 i = 0; i < 4; i++)
		{
			m_dsp->debug_run_cycles(1);
			out[i] = m_dsp->debug_macc();
		}
		return out;
	};

	const auto c42_zero = run_case(C42_ZERO);
	const auto c42_nonzero = run_case(C42_VALUE);
	const auto pc33_zero = run_pc33_block(C42_ZERO);
	const auto pc33_nonzero = run_pc33_block(C42_VALUE);
	const auto pc3b_zero = run_pc3b_block(C47_ZERO);
	const auto pc3b_nonzero = run_pc3b_block(C47_VALUE);

	osd_printf_info("PC33 chain c42=0      after_mpy=%013llx after_c41=%013llx after_c42=%013llx\n",
		(unsigned long long)c42_zero[0],
		(unsigned long long)c42_zero[1],
		(unsigned long long)c42_zero[2]);
	osd_printf_info("PC33 chain c42=20000  after_mpy=%013llx after_c41=%013llx after_c42=%013llx\n",
		(unsigned long long)c42_nonzero[0],
		(unsigned long long)c42_nonzero[1],
		(unsigned long long)c42_nonzero[2]);
	osd_printf_info("PC33..36 exact c42=0      pc33=%013llx pc34=%013llx pc35=%013llx pc36=%013llx\n",
		(unsigned long long)pc33_zero[0],
		(unsigned long long)pc33_zero[1],
		(unsigned long long)pc33_zero[2],
		(unsigned long long)pc33_zero[3]);
	osd_printf_info("PC33..36 exact c42=20000  pc33=%013llx pc34=%013llx pc35=%013llx pc36=%013llx\n",
		(unsigned long long)pc33_nonzero[0],
		(unsigned long long)pc33_nonzero[1],
		(unsigned long long)pc33_nonzero[2],
		(unsigned long long)pc33_nonzero[3]);
	osd_printf_info("PC3B..3E exact c47=0      pc3b=%013llx pc3c=%013llx pc3d=%013llx pc3e=%013llx\n",
		(unsigned long long)pc3b_zero[0],
		(unsigned long long)pc3b_zero[1],
		(unsigned long long)pc3b_zero[2],
		(unsigned long long)pc3b_zero[3]);
	osd_printf_info("PC3B..3E exact c47=50000  pc3b=%013llx pc3c=%013llx pc3d=%013llx pc3e=%013llx\n",
		(unsigned long long)pc3b_nonzero[0],
		(unsigned long long)pc3b_nonzero[1],
		(unsigned long long)pc3b_nonzero[2],
		(unsigned long long)pc3b_nonzero[3]);

	check_true("pc33 chain c40 produces macc", c42_zero[0] != 0);
	check_equal("pc33 chain zero c41 unchanged", s64(c42_zero[1]), s64(c42_zero[0]));
	check_equal("pc33 chain zero c42 unchanged", s64(c42_zero[2]), s64(c42_zero[1]));
	check_equal("pc33 chain nonzero c41 unchanged", s64(c42_nonzero[1]), s64(c42_nonzero[0]));
	check_true("pc33 chain nonzero c42 accumulates", c42_nonzero[2] != c42_nonzero[1]);
	check_true("pc33 exact c40 produces macc", pc33_zero[0] != 0);
	check_equal("pc33 exact zero c41 unchanged", s64(pc33_zero[1]), s64(pc33_zero[0]));
	check_equal("pc33 exact zero c42 unchanged", s64(pc33_zero[2]), s64(pc33_zero[1]));
	check_equal("pc33 exact zero c43 unchanged", s64(pc33_zero[3]), s64(pc33_zero[2]));
	check_equal("pc33 exact nonzero c41 unchanged", s64(pc33_nonzero[1]), s64(pc33_nonzero[0]));
	check_true("pc33 exact nonzero c42 accumulates", pc33_nonzero[2] != pc33_nonzero[1]);
	check_equal("pc33 exact nonzero c43 unchanged", s64(pc33_nonzero[3]), s64(pc33_nonzero[2]));
	check_true("pc3b exact c45 produces macc", pc3b_zero[0] != 0);
	check_equal("pc3b exact zero c46 unchanged", s64(pc3b_zero[1]), s64(pc3b_zero[0]));
	check_equal("pc3b exact zero c47 unchanged", s64(pc3b_zero[2]), s64(pc3b_zero[1]));
	check_equal("pc3b exact zero c48 unchanged", s64(pc3b_zero[3]), s64(pc3b_zero[2]));
	check_equal("pc3b exact nonzero c46 unchanged", s64(pc3b_nonzero[1]), s64(pc3b_nonzero[0]));
	check_true("pc3b exact nonzero c47 accumulates", pc3b_nonzero[2] != pc3b_nonzero[1]);
	check_equal("pc3b exact nonzero c48 unchanged", s64(pc3b_nonzero[3]), s64(pc3b_nonzero[2]));
}

void tms57002test_state::test_pc33_producer_smhc_phase()
{
	static constexpr u32 ST0_DSP2 = 0x01c082;
	static constexpr u32 ST1_DSP2 = 0x000020;
	static constexpr u32 OPCODE_NOP = 0x000000;
	static constexpr u32 OPCODE_LACC_C42 = 0x00480542;
	static constexpr u32 OPCODE_MPY_D0 = 0x00980200;
	static constexpr u32 OPCODE_LACC_CSTAR = 0x00480200;
	static constexpr u32 OPCODE_SMHC_C42 = 0x00002d42;
	static constexpr u32 OPCODE_SFMO = 0x00880200;
	static constexpr u32 OPCODE_LACC_C43 = 0x00480543;
	static constexpr u32 OPCODE_SMHC_C43 = 0x00002d43;
	static constexpr u32 OPCODE_LACC_C47 = 0x00480547;
	static constexpr u32 OPCODE_SMHC_C47 = 0x00002d47;
	static constexpr u32 OPCODE_LACC_C48 = 0x00480548;
	static constexpr u32 OPCODE_SMHC_C48 = 0x00002d48;
	static constexpr u8 PC_CD = 0xcd;
	static constexpr u8 PC_D0 = 0xd0;
	static constexpr u8 PC_D1 = 0xd1;
	static constexpr u8 PC_D5 = 0xd5;
	static constexpr u8 PC_E6 = 0xe6;
	static constexpr u8 PC_E9 = 0xe9;
	static constexpr u8 PC_ED = 0xed;
	static constexpr u8 PC_EE = 0xee;
	static constexpr u8 CA_DA = 0xda;
	static constexpr u8 CA_E9 = 0xe9;
	static constexpr u8 ID_TRACE = 0x3a;
	static constexpr u8 ID_E_TRACE = 0x90;
	static constexpr u8 BA0_TRACE = 0xaa;
	static constexpr u8 BA1_TRACE = 0x00;
	static constexpr u8 BA1_E_TRACE = 0x56;
	static constexpr u32 D_MPY = 0x366a00;
	static constexpr u32 D_C42_SIDE = 0x803138;
	static constexpr u32 D_C43_SIDE = 0x36cd7b;
	static constexpr u32 D_C47_SIDE = 0x000087;
	static constexpr u32 D_C48_SIDE = 0x00007a;
	static constexpr u32 CDB_SOURCE = 0x0e8b1d16;
	static constexpr u32 CED_SOURCE = 0x0ced19da;
	static constexpr u64 C46_MACCR_TRACE = 0x01ae43620cc01ULL;
	static constexpr u32 C42_SEED = 0x00020000;
	static constexpr u32 C47_SEED = 0x00050000;

	std::array<u32, 0x100> program;
	program.fill(OPCODE_NOP);
	program[0xcd] = OPCODE_LACC_C42;
	program[0xce] = OPCODE_MPY_D0;
	program[0xcf] = OPCODE_LACC_CSTAR;
	program[0xd0] = OPCODE_SMHC_C42;
	program[0xd1] = OPCODE_SFMO;
	program[0xd2] = OPCODE_LACC_C43;
	program[0xd3] = OPCODE_MPY_D0;
	program[0xd4] = OPCODE_LACC_CSTAR;
	program[0xd5] = OPCODE_SMHC_C43;
	program[0xe6] = OPCODE_LACC_C47;
	program[0xe7] = OPCODE_MPY_D0;
	program[0xe8] = OPCODE_LACC_CSTAR;
	program[0xe9] = OPCODE_SMHC_C47;
	program[0xea] = OPCODE_SFMO;
	program[0xeb] = OPCODE_LACC_C48;
	program[0xec] = OPCODE_MPY_D0;
	program[0xed] = OPCODE_LACC_CSTAR;
	program[0xee] = OPCODE_SMHC_C48;

	struct producer_result
	{
		u32 c42_after_d0 = 0;
		u64 macc_after_d1 = 0;
		u32 c43_after_d5 = 0;
	};
	struct producer_e_result
	{
		u32 c47_after_e9 = 0;
		u32 aacc_after_ed = 0;
		u32 c48_after_ee = 0;
	};

	const auto run_case = [&](u32 c42_seed) -> producer_result
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
		m_dsp->debug_write_cmem(0x42, c42_seed);
		m_dsp->debug_write_cmem(0x43, 0);
		m_dsp->debug_write_cmem(0xda, 0x7f000000);
		m_dsp->debug_write_cmem(0xdb, CDB_SOURCE);
		m_dsp->debug_write_cmem(0xdc, 0x00ffffff);
		m_dsp->debug_write_cmem(0xdd, 0x7f000000);
		m_dsp->debug_write_cmem(0xde, 0);
		m_dsp->debug_write_cmem(0xdf, 0x00ffffff);
		m_dsp->debug_write_dmem0(u8(0x00 + BA0_TRACE), D_MPY);
		m_dsp->debug_write_dmem0(u8(0x42 + BA0_TRACE), D_C42_SIDE);
		m_dsp->debug_write_dmem0(u8(0x43 + BA0_TRACE), D_C43_SIDE);
		m_dsp->debug_set_exec_state(PC_CD, CA_DA, ID_TRACE, BA0_TRACE, BA1_TRACE, ST0_DSP2, ST1_DSP2, 0);
		m_dsp->debug_set_accumulators(0, 0, 0, 0, 0);

