joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
		producer_result out;
		for (u32 pc = PC_CD; pc <= PC_D5; pc++)
		{
			m_dsp->debug_run_cycles(1);
			if (pc == PC_D0)
				out.c42_after_d0 = m_dsp->cmem_value(0x42);
			if (pc == PC_D1)
				out.macc_after_d1 = m_dsp->debug_macc();
			if (pc == PC_D5)
				out.c43_after_d5 = m_dsp->cmem_value(0x43);
		}
		return out;
	};

	const auto run_e_case = [&](u32 c47_seed) -> producer_e_result
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP2, ST1_DSP2);
		m_dsp->debug_write_cmem(0x47, c47_seed);
		m_dsp->debug_write_cmem(0x48, 0);
		m_dsp->debug_write_cmem(0xe9, 0x7f000000);
		m_dsp->debug_write_cmem(0xea, 0);
		m_dsp->debug_write_cmem(0xeb, 0x00ffffff);
		m_dsp->debug_write_cmem(0xec, 0x7f000000);
		m_dsp->debug_write_cmem(0xed, CED_SOURCE);
		m_dsp->debug_write_cmem(0xee, 0);
		m_dsp->debug_write_dmem0(u8(0x00 + BA0_TRACE), D_MPY);
		m_dsp->debug_write_dmem0(u8(0x47 + BA0_TRACE), D_C47_SIDE);
		m_dsp->debug_write_dmem0(u8(0x48 + BA0_TRACE), D_C48_SIDE);
		m_dsp->debug_set_exec_state(PC_E6, CA_E9, ID_E_TRACE, BA0_TRACE, BA1_E_TRACE, ST0_DSP2, ST1_DSP2, 0);
		m_dsp->debug_set_accumulators(0, 0, C46_MACCR_TRACE, 0, 0x00ffffff);

		producer_e_result out;
		for (u32 pc = PC_E6; pc <= PC_EE; pc++)
		{
			m_dsp->debug_run_cycles(1);
			if (pc == PC_E9)
				out.c47_after_e9 = m_dsp->cmem_value(0x47);
			if (pc == PC_ED)
				out.aacc_after_ed = u32(m_dsp->debug_aacc());
			if (pc == PC_EE)
				out.c48_after_ee = m_dsp->cmem_value(0x48);
		}
		return out;
	};

	const producer_result zero_seed = run_case(0);
	const producer_result nonzero_seed = run_case(C42_SEED);
	const producer_e_result e_zero_seed = run_e_case(0);
	const producer_e_result e_nonzero_seed = run_e_case(C47_SEED);

	osd_printf_info("PC CD..D5 producer c42=0      c42_after_d0=%08x macc_after_d1=%013llx c43_after_d5=%08x\n",
		zero_seed.c42_after_d0,
		(unsigned long long)zero_seed.macc_after_d1,
		zero_seed.c43_after_d5);
	osd_printf_info("PC CD..D5 producer c42=20000  c42_after_d0=%08x macc_after_d1=%013llx c43_after_d5=%08x\n",
		nonzero_seed.c42_after_d0,
		(unsigned long long)nonzero_seed.macc_after_d1,
		nonzero_seed.c43_after_d5);
	osd_printf_info("PC E6..EE producer c47=0      c47_after_e9=%08x aacc_after_ed=%08x c48_after_ee=%08x\n",
		e_zero_seed.c47_after_e9,
		e_zero_seed.aacc_after_ed,
		e_zero_seed.c48_after_ee);
	osd_printf_info("PC E6..EE producer c47=50000  c47_after_e9=%08x aacc_after_ed=%08x c48_after_ee=%08x\n",
		e_nonzero_seed.c47_after_e9,
		e_nonzero_seed.aacc_after_ed,
		e_nonzero_seed.c48_after_ee);

	check_equal("pc33 producer zero seed keeps c42 zero", zero_seed.c42_after_d0, 0);
	check_true("pc33 producer zero seed creates later macc", zero_seed.macc_after_d1 != 0);
	check_true("pc33 producer zero seed fills c43", zero_seed.c43_after_d5 != 0);
	check_true("pc33 producer nonzero seed fills c42", nonzero_seed.c42_after_d0 != 0);
	check_equal("pc33 producer e zero seed keeps c47 zero", e_zero_seed.c47_after_e9, 0);
	check_true("pc33 producer e zero seed reaches c48 source", e_zero_seed.aacc_after_ed != 0);
	check_equal("pc33 producer e zero seed keeps c48 zero", e_zero_seed.c48_after_ee, 0);
	check_true("pc33 producer e nonzero seed fills c47", e_nonzero_seed.c47_after_e9 != 0);
}

void tms57002test_state::test_dsp3_rde_word0_sel1_dram_latency()
{
	static constexpr u32 ST0_DSP3 = 0x018082;
	static constexpr u32 ST1_CLEAR = 0x000000;
	static constexpr u32 OPCODE_NOP = 0x000000;
	static constexpr u32 OPCODE_RDE_C46__SACC_C46 = 0x00e40d46;
	static constexpr u32 OPCODE_RDE_C47__SACC_C47 = 0x00e40d47;

	std::array<u32, 8> program{
		OPCODE_RDE_C46__SACC_C46,
		OPCODE_NOP, OPCODE_NOP, OPCODE_NOP, OPCODE_NOP, OPCODE_NOP,
		OPCODE_RDE_C47__SACC_C47,
		OPCODE_NOP
	};
	m_dsp->debug_load_program(program.data(), u32(program.size()), ST0_DSP3, ST1_CLEAR);
	m_dsp->debug_write_cmem(0x46, 0x00000001);
	m_dsp->debug_write_cmem(0x47, 0x00000002);
	m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, ST0_DSP3, ST1_CLEAR, 0);
	m_dsp->debug_set_accumulators(0, 0x123456780000ULL, 0x123456780000ULL, 0x123456780000ULL, 0);
	m_dsp->debug_set_xmem_state(0, 0x00008, 0, 0, 0, 0, 0, 0);

	address_space &ext = m_dsp->space(AS_DATA);
	ext.write_byte(0x12, 0x12);
	ext.write_byte(0x13, 0x34);

	m_dsp->debug_run_cycles(1);
	check_equal("dsp3 rde/sacc new CMEM address after issue", m_dsp->debug_xoa(), 0x00000000);
	check_equal("dsp3 rde latency xrd after issue", m_dsp->debug_xrd(), 0);

	m_dsp->debug_run_cycles(5);
	check_equal("dsp3 rde latency xrd after five followups", m_dsp->debug_xrd(), 0);

	m_dsp->debug_run_cycles(1);
	check_equal("dsp3 rde/sacc new-address read result", m_dsp->debug_xrd(), 0x00000000);
	check_equal("dsp3 rde/sacc competing issue uses updated address", m_dsp->debug_xoa(), 0x00000000);
}

void tms57002test_state::test_xmem_micro_oracles()
{
	// ST0 configurations (M=memory size, SEL/WORD=fetch width).
	static constexpr u32 ST0_16BIT_256K = 0x018082; // SEL, !WORD, 256K  (real DSP3)
	static constexpr u32 ST0_24BIT_256K = 0x01c082; // SEL,  WORD, 256K  (24-bit, real DSP2 word mode)
	static constexpr u32 ST0_16BIT_64K  = 0x008082; // SEL, !WORD, 64K   (DSP1-like small)

	// sti state bits (tms57002.h enum): S_READ=0x40, S_WRITE=0x80.
	static constexpr u32 S_READ_BIT  = 0x00000040;
	static constexpr u32 S_WRITE_BIT = 0x00000080;

	// WRE D00 C* / SMHD D00 : byte addr <- cmem[ca=0x7d] (NOT clobbered by smhd),
	// xwr <- dmem0[0x00]. Used only to exercise xm_init's address arithmetic.
	static constexpr u32 OP_WRE = 0x00e01b00;

	address_space &ext = m_dsp->space(AS_DATA);

	auto mem_mask = [](u32 st0) -> u32 {
		switch (st0 & 0x030000) {
		case 0x000000: return 0x0ffff;
		case 0x010000: return 0x3ffff;
		default:       return 0xfffff;
		}
	};
	// Byte address the core SHOULD compute for a (xoa,xba) word pair (mirrors xm_init).
	auto want_addr = [&](u32 st0, u32 xoa_word, u32 xba_word) -> u32 {
		u32 adr = xoa_word + xba_word;
		adr <<= (st0 & 0x004000) ? 2 : 1;   // WORD -> <<2, else <<1
		if (!(st0 & 0x008000)) adr <<= 1;    // !SEL -> extra <<1
		return adr & mem_mask(st0);
	};

