joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	// (A) READ ASSEMBLY: seed a read at xm_adr=base and pump until it delivers.
	auto pump_read = [&](u32 st0, u32 base) -> u32 {
		std::array<u32, 64> program{};   // all NOPs; they only pump xm_step_read
		program.fill(0);
		m_dsp->debug_load_program(program.data(), u32(program.size()), st0, 0);
		m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, st0, 0, S_READ_BIT);
		// (xoa, xba, xwr, xrd, txrd, xm_adr, xm_cycles, xm_fetches)
		m_dsp->debug_set_xmem_state(0, 0, 0, 0, 0, base, 0, 0);
		m_dsp->debug_run_cycles(24);
		return m_dsp->debug_xrd();
	};
	// (B) WRITE ASSEMBLY: seed a write of xwr=sample at xm_adr=base and pump.
	auto pump_write = [&](u32 st0, u32 base, u32 sample24) {
		std::array<u32, 64> program{};
		program.fill(0);
		m_dsp->debug_load_program(program.data(), u32(program.size()), st0, 0);
		m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, st0, 0, S_WRITE_BIT);
		m_dsp->debug_set_xmem_state(0, 0, sample24, 0, 0, base, 0, 0);
		m_dsp->debug_run_cycles(24);
	};
	// (C) ADDRESS ARITH: WRE op computes byte addr from cmem[0x7d]=xoa and xba.
	auto wre_addr_probe = [&](u32 st0, u32 xoa_word, u32 xba_word, u32 sample24) {
		std::array<u32, 64> program{};
		program.fill(0);
		program[0] = OP_WRE;
		m_dsp->debug_load_program(program.data(), u32(program.size()), st0, 0);
		m_dsp->debug_write_dmem0(0x00, sample24);
		m_dsp->debug_write_cmem(0x7d, xoa_word);
		m_dsp->debug_set_exec_state(0x00, 0x7d, 0x00, 0x00, 0x00, st0, 0, 0);
		// SMHD (co-issued) reads MACC; seed it like the shipped wre/smhd test.
		m_dsp->debug_set_accumulators(0, 0x0123456789012ULL, 0x0123456789012ULL, 0x0123456789012ULL, 0);
		m_dsp->debug_set_xmem_state(0, xba_word, 0, 0, 0, 0, 0, 0);
		m_dsp->debug_run_cycles(32);
	};

	// ==== (A) READ ASSEMBLY =================================================
	// A1. 16-bit mode: three ADJACENT words, distinct patterns -> catches byte
	//     swap, neighbor-word bleed, and the top-16 masking (low byte -> 0).
	{
		const u32 st0 = ST0_16BIT_256K;
		struct { u32 base; u8 hi; u8 lo; } w[] = {
			{ 0x100, 0x11, 0x33 }, { 0x102, 0xAB, 0xCD }, { 0x104, 0x55, 0xAA },
		};
		for (auto &c : w) { ext.write_byte(c.base, c.hi); ext.write_byte(c.base + 1, c.lo); }
		for (auto &c : w)
		{
			const u32 got = pump_read(st0, c.base);
			const u32 want = (u32(c.hi) << 16) | (u32(c.lo) << 8);
			osd_printf_info("XMEM readA 16b base=%05x bytes=%02x%02x read=%06x want=%06x\n",
				c.base, c.hi, c.lo, got, want);
			check_equal("xmem readA 16b lane+mask", s64(got), s64(want));
		}
	}
	// A2. 24-bit WORD+SEL mode: full 24-bit fidelity from three byte lanes.
	{
		const u32 st0 = ST0_24BIT_256K;
		const u32 base = 0x200;   // 4-byte aligned
		ext.write_byte(base + 0, 0xAB);
		ext.write_byte(base + 1, 0xCD);
		ext.write_byte(base + 2, 0xEF);
		const u32 got = pump_read(st0, base);
		osd_printf_info("XMEM readA 24b base=%05x bytes=ABCDEF read=%06x\n", base, got);
		check_equal("xmem readA 24b three-lane", s64(got), s64(0x00ABCDEF));
	}

	// ==== (B) WRITE ASSEMBLY ================================================
	// B1. 16-bit: write splits xwr[23:8] to two big-endian bytes, drops low byte.
	{
		const u32 st0 = ST0_16BIT_256K;
		const u32 base = 0x300;
		pump_write(st0, base, 0x00ABCDEF);
		const u8 b0 = ext.read_byte(base), b1 = ext.read_byte(base + 1);
		osd_printf_info("XMEM writeB 16b base=%05x wrote=ABCDEF -> bytes=%02x%02x\n", base, b0, b1);
		check_equal("xmem writeB 16b byte hi", s64(b0), s64(0xAB));
		check_equal("xmem writeB 16b byte mid", s64(b1), s64(0xCD));
	}
	// B2. 24-bit: three big-endian bytes carry the full word.
	{
		const u32 st0 = ST0_24BIT_256K;
		const u32 base = 0x304;
		pump_write(st0, base, 0x00123456);
		osd_printf_info("XMEM writeB 24b base=%05x wrote=123456 -> bytes=%02x%02x%02x\n",
			base, ext.read_byte(base), ext.read_byte(base + 1), ext.read_byte(base + 2));
		check_equal("xmem writeB 24b byte0", s64(ext.read_byte(base + 0)), s64(0x12));
		check_equal("xmem writeB 24b byte1", s64(ext.read_byte(base + 1)), s64(0x34));
		check_equal("xmem writeB 24b byte2", s64(ext.read_byte(base + 2)), s64(0x56));
	}

	// ==== (A)+(B) ROUND TRIP at LARGE addresses ============================
	// Write then read back at the very top of the 256K space (byte 0x3fffe).
	{
		const u32 st0 = ST0_16BIT_256K;
		const u32 base = 0x3fffe;   // highest 16-bit word in 256K
		pump_write(st0, base, 0x007F1200);
		const u32 got = pump_read(st0, base);
		osd_printf_info("XMEM rt 16b top base=%05x wrote=7F1200 read=%06x\n", base, got);
		check_equal("xmem rt 16b top-of-256K", s64(got), s64(0x007F1200 & 0xffff00));
	}

	// ==== (C) ADDRESS ARITHMETIC + CIRCULAR WRAP (via WRE) ==================
	// PAYLOAD: under the current general rule the co-issued store retires before
	// WRE latches its payload.  SMHD therefore stores the seeded MACC value into
	// DMEM first, and each WRE observes its high byte (0x12).  The five probes
	// still discriminate the computed addresses and wrap behavior.
	static constexpr u8 STORE_UPDATED_XWR_HIGH = 0x12;

	// C1. Sanity: xoa=1,xba=8 in 16-bit 256K -> byte 0x12.
	{
		const u32 st0 = ST0_16BIT_256K;
		const u32 a = want_addr(st0, 1, 8);
		ext.write_byte(a, 0x00);
		wre_addr_probe(st0, 1, 8, 0x00A5C300);
		osd_printf_info("XMEM addrC 16b xoa=1 xba=8 -> want=%05x landed@%05x=%02x\n",
			a, a, ext.read_byte(a));
		check_equal("xmem addrC 16b basic want addr", s64(a), s64(0x12));
		check_equal("xmem addrC 16b basic landed here", s64(ext.read_byte(a)), s64(STORE_UPDATED_XWR_HIGH));
	}
	// C2. Large address near top of 256K: word 0x1ffff -> byte 0x3fffe.
	{
		const u32 st0 = ST0_16BIT_256K;
		const u32 xoa = 1, xba = 0x1fffe;    // sum 0x1ffff
		const u32 a = want_addr(st0, xoa, xba);
		ext.write_byte(a, 0x00);
		wre_addr_probe(st0, xoa, xba, 0x007E0100);
		osd_printf_info("XMEM addrC 16b large xoa+xba=%05x -> want=%05x landed@%05x=%02x\n",
			xoa + xba, a, a, ext.read_byte(a));
		check_equal("xmem addrC 16b large want addr", s64(a), s64(0x3fffe));
		check_equal("xmem addrC 16b large landed here", s64(ext.read_byte(a)), s64(STORE_UPDATED_XWR_HIGH));
	}
	// C3. Wrap: (xoa+xba) overflows the 128K-word space -> aliases into low mem.
	//     word 0x20001 -> (0x20001<<1)&0x3ffff = byte 2. Decoy byte 0x40 must
	//     stay zero (no spurious placement).
	{
		const u32 st0 = ST0_16BIT_256K;
		const u32 xoa = 2, xba = 0x1ffff;    // sum 0x20001
		const u32 a = want_addr(st0, xoa, xba);
		ext.write_byte(0x02, 0x00); ext.write_byte(0x40, 0x00);
		wre_addr_probe(st0, xoa, xba, 0x00246800);
		osd_printf_info("XMEM addrC 16b wrap xoa+xba=%05x -> want=%05x landed@0002=%02x decoy@0040=%02x\n",
			xoa + xba, a, ext.read_byte(0x02), ext.read_byte(0x40));
		check_equal("xmem addrC 16b wrap want addr", s64(a), s64(0x00002));
		check_equal("xmem addrC 16b wrap landed low", s64(ext.read_byte(0x02)), s64(STORE_UPDATED_XWR_HIGH));
		check_equal("xmem addrC 16b wrap no spurious", s64(ext.read_byte(0x40)), s64(0x00));
	}
	// C4. xba full-range wrap continuity: the sync_w decrement wraps xba at
	//     0x80000 = 4 * the 0x20000-word physical space. A delay-line pointer
	//     that has wrapped (xba=0x7ffff) with offset must alias cleanly: word
	//     (1 + 0x7ffff) = 0x80000 -> byte 0 (== word 0). If it tore, byte != 0.
	{
		const u32 st0 = ST0_16BIT_256K;
		const u32 a = want_addr(st0, 1, 0x7ffff);
		ext.write_byte(0x00, 0x00);
		wre_addr_probe(st0, 1, 0x7ffff, 0x00CAFE00);
		osd_printf_info("XMEM addrC 16b xba-wrap want=%05x landed@0000=%02x\n", a, ext.read_byte(0x00));
		check_equal("xmem addrC 16b xba-wrap aliases word0", s64(a), s64(0x00000));
		check_equal("xmem addrC 16b xba-wrap landed", s64(ext.read_byte(0x00)), s64(STORE_UPDATED_XWR_HIGH));
	}
	// C5. Small (64K) memory wrap: word 0x8000 -> (0x8000<<1)&0xffff = byte 0.
	{
		const u32 st0 = ST0_16BIT_64K;
		const u32 a = want_addr(st0, 0x8000, 0);
		ext.write_byte(0x00, 0x00);
		wre_addr_probe(st0, 0x8000, 0, 0x00BE1100);
		osd_printf_info("XMEM addrC 64k wrap want=%05x landed@0000=%02x\n", a, ext.read_byte(0x00));
		check_equal("xmem addrC 64k wrap want addr", s64(a), s64(0x00000));
		check_equal("xmem addrC 64k wrap landed", s64(ext.read_byte(0x00)), s64(STORE_UPDATED_XWR_HIGH));
	}

	// ==== READ PIPELINE LATENCY ============================================
	// Seed a read, pump one instruction at a time, record the instruction
	// distance at which xrd is delivered and confirm it then holds.
	{
		const u32 st0 = ST0_16BIT_256K;
		const u32 base = 0x400;
		ext.write_byte(base, 0x5A); ext.write_byte(base + 1, 0xC3);
		const u32 want = 0x005AC300;

		std::array<u32, 64> program{};
		program.fill(0);
		m_dsp->debug_load_program(program.data(), u32(program.size()), st0, 0);
		m_dsp->debug_set_exec_state(0x00, 0x00, 0x00, 0x00, 0x00, st0, 0, S_READ_BIT);
		m_dsp->debug_set_xmem_state(0, 0, 0, 0, 0, base, 0, 0);

		int delivered_at = -1;
		for (int step = 1; step <= 16; step++)
		{
			m_dsp->debug_run_cycles(1);
			if (m_dsp->debug_xrd() == want && delivered_at < 0)
				delivered_at = step;
		}
		osd_printf_info("XMEM latency: value delivered at instruction distance %d, final xrd=%06x\n",
			delivered_at, m_dsp->debug_xrd());
		check_true("xmem read eventually delivered", delivered_at > 0);
		check_equal("xmem read value stable after delivery", s64(m_dsp->debug_xrd()), s64(want));
	}
}


