joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
void tms57002test_state::test_dsp3_a02_su480082_snapshot_replay()
{
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_replay_seed/snapshot_su480082_pc00_pre.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_replay_seed/execpost_su480082_pc00_10_sine.log";

	test_dsp3_snapshot_replay_case("dsp3 a02 su480082 replay", kSnapshotPath, kExecPath);
}

void tms57002test_state::test_dsp3_a02_su480006_snapshot_replay()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/snapshot_su480006_pc00_pre.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/execpost_su480006_full.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/ram/su480006_pc00_pre.bin";

	test_dsp3_snapshot_replay_case_with_program("dsp3 a02 sine su480006 replay", kProgramPath, kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::test_dsp3_a02_su480004_snapshot_replay()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/snapshot_su480004_pc00_pre.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/execpost_su480004_full.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/ram/su480004_pc00_pre.bin";

	test_dsp3_snapshot_replay_case_with_program("dsp3 a02 sine su480004 replay", kProgramPath, kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::test_dsp3_a02_sine_su480003_snapshot_replay()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/snapshot_su480003_pc00_pre.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/execpost_su480003_full.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/ram/su480003_pc00_pre.bin";

	test_dsp3_snapshot_replay_case_with_program("dsp3 a02 sine su480003 replay", kProgramPath, kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::test_dsp3_a02_su480005_snapshot_replay()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/snapshot_su480005_pc00_pre.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/execpost_su480005_full.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_long_20260408/ram/su480005_pc00_pre.bin";

	test_dsp3_snapshot_replay_case_with_program("dsp3 a02 sine su480005 replay", kProgramPath, kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::test_dsp3_input_sensitivity_case_with_program(const char *label, const char *program_path, const char *snapshot_path, const char *exec_path, const char *ram_path)
{
	const std::vector<u32> program = load_program_words(program_path);
	const tms57002_device::debug_snapshot base_snapshot = load_snapshot_from_log(snapshot_path);
	const std::vector<exec_post_expectation> expected = load_exec_post_expectations(exec_path);

	auto run_variant = [&](const char *variant, u32 input0)
	{
		tms57002_device::debug_snapshot snapshot = base_snapshot;
		snapshot.si[0] = input0;
		snapshot.serial_input_frame[0] = input0;
		snapshot.serial_input_prev_frame[0] = input0;
		m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
		load_data_space_bytes(ram_path, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(snapshot);
		for (std::size_t i = 0; i < expected.size(); i++)
			m_dsp->debug_run_cycles(1);
		osd_printf_info("INFO %s input %s so=%06x/%06x aacc=%08x macc=%013llx st1=%06x d5d=%06x d5f=%06x d56=%06x ba0=%02x\n",
			label,
			variant,
			m_dsp->debug_serial_output_register(0),
			m_dsp->debug_serial_output_register(1),
			u32(m_dsp->debug_aacc()),
			(unsigned long long)m_dsp->debug_macc(),
			m_dsp->state_int(TMS57002_ST1),
			m_dsp->dmem0_value(0x5d),
			m_dsp->dmem0_value(0x5f),
			m_dsp->dmem0_value(0x56),
			m_dsp->state_int(TMS57002_BA0));
	};

	run_variant("base", base_snapshot.si[0]);
	run_variant("zero", 0);
	run_variant("half", base_snapshot.si[0] >> 1);
	run_variant("posfs", 0x007fffff);
	run_variant("negfs", 0x00800000);
}

void tms57002test_state::test_dsp3_input_sensitivity_case(const char *label, const char *snapshot_path, const char *exec_path, const char *ram_path)
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";

	test_dsp3_input_sensitivity_case_with_program(label, kProgramPath, snapshot_path, exec_path, ram_path);
}

void tms57002test_state::test_dsp3_a02_su480002_input_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/snapshot_su480002_pc00_pre.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/execpost_su480002_full.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/ram/su480002_pc00_pre.bin";

	test_dsp3_input_sensitivity_case_with_program("dsp3 a02 sine su480002", kProgramPath, kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::test_dsp3_a02_su480003_input_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/snapshot_su480003_pc00_pre.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/execpost_su480003_full.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/ram/su480003_pc00_pre.bin";

	test_dsp3_input_sensitivity_case_with_program("dsp3 a02 sine su480003", kProgramPath, kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::test_dsp3_a02_su480004_input_sensitivity()
{
	static constexpr char kSnapshotPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kExecPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kRamPath[] = "tmp/kprop_a02_su480004_seed/xmem_su480004_pc00_pre_sine.bin";

