joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	test_dsp3_input_sensitivity_case("dsp3 a02 su480004", kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::test_dsp3_a02_su480005_input_sensitivity()
{
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_firstbad_seed/snapshot_su480005_pc00_pre_sine.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_firstbad_seed/execpost_only_su480005_sine.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_firstbad_seed/xmem_su480005_pc00_pre_sine.bin";

	test_dsp3_input_sensitivity_case("dsp3 a02 su480005", kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::probe_dsp3_a02_su480005_state_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_firstbad_seed/snapshot_su480005_pc00_pre_sine.log";
	static constexpr char kPrevSnapshotPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_firstbad_seed/execpost_only_su480005_sine.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_firstbad_seed/xmem_su480005_pc00_pre_sine.bin";

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(kSnapshotPath);
	const tms57002_device::debug_snapshot prev_snapshot = load_snapshot_from_log(kPrevSnapshotPath);
	const std::vector<exec_post_expectation> expected = load_exec_post_expectations(kExecPath);
	const int cycles_per_sample = int(expected.size());

	auto run_variant = [&](const char *label, const tms57002_device::debug_snapshot &base) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), base.st0, base.st1);
		load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(base);
		for (int sample = 0; sample < 3; sample++)
		{
			for (int i = 0; i < cycles_per_sample; i++)
				m_dsp->debug_run_cycles(1);

			osd_printf_info(
				"INFO dsp3 a02 su480005 state %s sample+%d so=%06x/%06x c00=%08x c37=%08x c42=%08x d40=%06x d41=%06x d42=%06x d45=%06x d48=%06x d49=%06x df0=%06x df1=%06x df2=%06x df3=%06x\n",
				label,
				sample + 1,
				m_dsp->debug_serial_output_register(0),
				m_dsp->debug_serial_output_register(1),
				m_dsp->cmem_value(0x00),
				m_dsp->cmem_value(0x37),
				m_dsp->cmem_value(0x42),
				m_dsp->dmem0_value(0x40),
				m_dsp->dmem0_value(0x41),
				m_dsp->dmem0_value(0x42),
				m_dsp->dmem0_value(0x45),
				m_dsp->dmem0_value(0x48),
				m_dsp->dmem0_value(0x49),
				m_dsp->dmem0_value(0xf0),
				m_dsp->dmem0_value(0xf1),
				m_dsp->dmem0_value(0xf2),
				m_dsp->dmem0_value(0xf3));
		}
	};

	run_variant("base", snapshot);

	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.cmem[0x00] = prev_snapshot.cmem[0x00];
		run_variant("prev_c00", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.cmem[0x37] = prev_snapshot.cmem[0x37];
		run_variant("prev_c37", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.cmem[0x42] = prev_snapshot.cmem[0x42];
		run_variant("prev_c42", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.cmem[0x00] = prev_snapshot.cmem[0x00];
		variant.cmem[0x37] = prev_snapshot.cmem[0x37];
		variant.cmem[0x42] = prev_snapshot.cmem[0x42];
		run_variant("prev_c00_c37_c42", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		for (u8 addr = 0x40; addr <= 0x4f; addr++)
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		run_variant("prev_d40_4f", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		for (u8 addr = 0xf0; addr <= 0xf3; addr++)
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		run_variant("prev_df0_df3", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		for (u8 addr = 0x40; addr <= 0x4f; addr++)
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		for (u8 addr = 0xf0; addr <= 0xf3; addr++)
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		run_variant("prev_hot_dmem", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.cmem[0x00] = prev_snapshot.cmem[0x00];
		variant.cmem[0x37] = prev_snapshot.cmem[0x37];
		variant.cmem[0x42] = prev_snapshot.cmem[0x42];
		for (u8 addr = 0x40; addr <= 0x4f; addr++)
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		for (u8 addr = 0xf0; addr <= 0xf3; addr++)
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		run_variant("prev_all_hot", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.ba0 = prev_snapshot.ba0;
		run_variant("prev_ba0", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.ba0 = snapshot.ba0 - 1;
		run_variant("next_ba0", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		for (u8 addr = 0x40; addr <= 0x47; addr++)
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		run_variant("prev_d40_47", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		for (u8 addr = 0x48; addr <= 0x4f; addr++)
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		run_variant("prev_d48_4f", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		for (u8 addr : { u8(0x41), u8(0x42), u8(0x45) })
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		run_variant("prev_d41_42_45", variant);
	}
	{
		tms57002_device::debug_snapshot variant = snapshot;
		for (u8 addr : { u8(0x48), u8(0x49), u8(0x4c) })
			variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		run_variant("prev_d48_49_4c", variant);
	}
	for (u8 addr : { u8(0x41), u8(0x42), u8(0x45), u8(0x48), u8(0x49), u8(0x4c) })
	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		char label[32];
		std::snprintf(label, sizeof(label), "prev_d%02x", addr);
		run_variant(label, variant);
	}
}

void tms57002test_state::probe_dsp3_a02_su480005_first_diff_variants()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_firstbad_seed/snapshot_su480005_pc00_pre_sine.log";
	static constexpr char kPrevSnapshotPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_firstbad_seed/xmem_su480005_pc00_pre_sine.bin";
	static constexpr int kCyclesPerSample = 512;

	struct replay_step
	{
		u8 pc = 0;
		u8 ca = 0;
		u8 id = 0;
		u32 st1 = 0;
		u32 aacc = 0;
		s64 macc = 0;
		u32 creg = 0;
		u32 so0 = 0;
		u32 so1 = 0;
		u32 c00 = 0;
		u32 c37 = 0;
		u32 c42 = 0;
		u32 d42 = 0;
		u32 d45 = 0;
		u32 d49 = 0;
		u32 d4c = 0;
	};

	auto capture = [&](const tms57002_device::debug_snapshot &base) -> std::vector<replay_step>
	{
		const std::vector<u32> program = load_program_words(kProgramPath);
		if (program.size() != 0x100)
			throw emu_fatalerror("Unexpected DSP3 program size %zu in %s", program.size(), kProgramPath);

		m_dsp->debug_load_program(program.data(), u32(program.size()), base.st0, base.st1);
		load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(base);

		std::vector<replay_step> out;
		out.reserve(kCyclesPerSample);
		for (int i = 0; i < kCyclesPerSample; i++)
		{
			m_dsp->debug_run_cycles(1);
			replay_step step;
			step.pc = u8(m_dsp->state_int(TMS57002_PC));
			step.ca = u8(m_dsp->state_int(TMS57002_CA));
			step.id = u8(m_dsp->state_int(TMS57002_ID));
			step.st1 = m_dsp->state_int(TMS57002_ST1);
			step.aacc = u32(m_dsp->debug_aacc());
			step.macc = s64(m_dsp->debug_macc());
			step.creg = m_dsp->debug_creg();
			step.so0 = m_dsp->debug_serial_output_register(0);
			step.so1 = m_dsp->debug_serial_output_register(1);
			step.c00 = m_dsp->cmem_value(0x00);
			step.c37 = m_dsp->cmem_value(0x37);
			step.c42 = m_dsp->cmem_value(0x42);
			step.d42 = m_dsp->dmem0_value(0x42);
			step.d45 = m_dsp->dmem0_value(0x45);
			step.d49 = m_dsp->dmem0_value(0x49);
			step.d4c = m_dsp->dmem0_value(0x4c);
			out.push_back(step);
		}
		return out;
	};

	auto report_first_diff = [&](const char *label, u8 ignored_addr, const std::vector<replay_step> &base, const std::vector<replay_step> &variant) -> void
	{
		for (std::size_t i = 0; i < base.size() && i < variant.size(); i++)
		{
			const replay_step &a = base[i];
			const replay_step &b = variant[i];
			const bool d42_diff = (ignored_addr != 0x42) && (a.d42 != b.d42);
			const bool d45_diff = (ignored_addr != 0x45) && (a.d45 != b.d45);
			const bool d49_diff = (ignored_addr != 0x49) && (a.d49 != b.d49);
			const bool d4c_diff = (ignored_addr != 0x4c) && (a.d4c != b.d4c);
			if (a.pc != b.pc || a.ca != b.ca || a.id != b.id || a.st1 != b.st1 || a.aacc != b.aacc || a.macc != b.macc || a.creg != b.creg || a.so0 != b.so0 || a.so1 != b.so1 || a.c00 != b.c00 || a.c37 != b.c37 || a.c42 != b.c42 || d42_diff || d45_diff || d49_diff || d4c_diff)
			{
				osd_printf_info(
					"INFO dsp3 a02 su480005 firstdiff %s step=%zu pc=%02x/%02x ca=%02x/%02x id=%02x/%02x st1=%06x/%06x aacc=%08x/%08x macc=%013llx/%013llx creg=%08x/%08x so=%06x/%06x vs %06x/%06x c00=%08x/%08x c37=%08x/%08x c42=%08x/%08x d42=%06x/%06x d45=%06x/%06x d49=%06x/%06x d4c=%06x/%06x\n",
					label,
					i + 1,
					a.pc, b.pc,
					a.ca, b.ca,
					a.id, b.id,
					a.st1, b.st1,
					a.aacc, b.aacc,
					(unsigned long long)a.macc, (unsigned long long)b.macc,
					a.creg, b.creg,
					a.so0, a.so1, b.so0, b.so1,
					a.c00, b.c00,
					a.c37, b.c37,
					a.c42, b.c42,
					a.d42, b.d42,
					a.d45, b.d45,
					a.d49, b.d49,
					a.d4c, b.d4c);
				return;
			}
		}

