joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
		osd_printf_info("INFO dsp3 a02 su480005 firstdiff %s none\n", label);
	};

	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(kSnapshotPath);
	const tms57002_device::debug_snapshot prev_snapshot = load_snapshot_from_log(kPrevSnapshotPath);
	const std::vector<replay_step> base = capture(snapshot);

	for (u8 addr : { u8(0x42), u8(0x45), u8(0x49), u8(0x4c) })
	{
		tms57002_device::debug_snapshot variant = snapshot;
		variant.dmem0[addr] = prev_snapshot.dmem0[addr];
		char label[32];
		std::snprintf(label, sizeof(label), "prev_d%02x", addr);
		report_first_diff(label, addr, base, capture(variant));
	}
}

void tms57002test_state::probe_dsp3_a02_su480004_producers()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSnapshotPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kRamPath[] = "tmp/kprop_a02_su480004_seed/xmem_su480004_pc00_pre_sine.bin";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(kSnapshotPath);

	if (program.size() != 0x100)
		throw emu_fatalerror("Unexpected DSP3 program size %zu in %s", program.size(), kProgramPath);

	m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
	load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
	m_dsp->debug_restore_snapshot(snapshot);

	for (int i = 0; i < kCyclesPerSample; i++)
	{
		const u8 execpc = u8(m_dsp->state_int(TMS57002_PC));
		const u8 execid = u8(m_dsp->state_int(TMS57002_ID));
		m_dsp->debug_run_cycles(1);

		if (execid != 0x1f)
			continue;

		u8 phys = 0xff;
		switch (execpc)
		{
		case 0xb0: phys = 0x42; break; // d53 with BA0=EF
		case 0xb6: phys = 0x45; break; // d56 with BA0=EF
		case 0xf5: phys = 0x49; break; // d5a with BA0=EF
		case 0xfb: phys = 0x4c; break; // d5d with BA0=EF
		default: break;
		}

		if (phys != 0xff)
		{
			const u64 macc = m_dsp->debug_macc();
			const u64 maccr = m_dsp->debug_macc_read();
			const u64 maccw = m_dsp->debug_macc_write();
			const u32 st1 = u32(m_dsp->state_int(TMS57002_ST1));
			const int sfmo_mode = int((st1 & 0x001800U) >> 11);
			const int rnd_mode = int((st1 & 0x038000U) >> 15);
			const auto mr_none = m_dsp->debug_eval_macc_output(maccr, sfmo_mode, rnd_mode, tms57002_device::debug_macc_clip_mode::none);
			const auto mr_round = m_dsp->debug_eval_macc_output(maccr, sfmo_mode, rnd_mode, tms57002_device::debug_macc_clip_mode::rounded);
			const auto mr_unrnd = m_dsp->debug_eval_macc_output(maccr, sfmo_mode, rnd_mode, tms57002_device::debug_macc_clip_mode::unrounded);
			const auto mw_none = m_dsp->debug_eval_macc_output(maccw, sfmo_mode, rnd_mode, tms57002_device::debug_macc_clip_mode::none);
			const auto mm_none = m_dsp->debug_eval_macc_output(macc, sfmo_mode, rnd_mode, tms57002_device::debug_macc_clip_mode::none);
			osd_printf_info(
				"INFO dsp3 a02 su480004 producer pc=%02x ba0=%02x phys=%02x val=%06x st1=%06x sfmo=%d rnd=%d "
				"macc=%013llx m24=%06x maccr=%013llx r24=%06x maccw=%013llx w24=%06x "
				"rnone=%06x rround=%06x runrnd=%06x wnone=%06x mnone=%06x so=%06x/%06x\n",
				execpc,
				m_dsp->debug_ba0(),
				phys,
				m_dsp->dmem0_value(phys),
				st1,
				sfmo_mode,
				rnd_mode,
				(unsigned long long)macc, u32((macc >> 24) & 0xffffff),
				(unsigned long long)maccr, u32((maccr >> 24) & 0xffffff),
				(unsigned long long)maccw, u32((maccw >> 24) & 0xffffff),
				u32((mr_none.value >> 24) & 0xffffff),
				u32((mr_round.value >> 24) & 0xffffff),
				u32((mr_unrnd.value >> 24) & 0xffffff),
				u32((mw_none.value >> 24) & 0xffffff),
				u32((mm_none.value >> 24) & 0xffffff),
				m_dsp->debug_serial_output_register(0),
				m_dsp->debug_serial_output_register(1));
		}
	}
}

void tms57002test_state::probe_dsp3_a02_su480004_producer_site_ba0_variants()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSnapshotPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kRamPath[] = "tmp/kprop_a02_su480004_seed/xmem_su480004_pc00_pre_sine.bin";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(kSnapshotPath);

	auto run_variant = [&](const char *label, u8 target_pc, int ba0_adjust, bool repeat) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
		load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(snapshot);

		bool patched_once = false;
		bool restore_next = false;
		for (int step = 0; step < kCyclesPerSample * 4; step++)
		{
			if ((!patched_once || repeat) && m_dsp->state_int(TMS57002_ID) == 0x1f && m_dsp->state_int(TMS57002_PC) == target_pc)
			{
				u8 new_ba0 = snapshot.ba0;
				u8 new_ba1 = snapshot.ba1;
				if (ba0_adjust < 0)
				{
					new_ba0 = snapshot.ba0 + 1;
					new_ba1 = snapshot.ba1 - 1;
				}
				else if (ba0_adjust > 0)
				{
					new_ba0 = snapshot.ba0 - 1;
					new_ba1 = snapshot.ba1 + 1;
				}
				m_dsp->debug_set_banks(new_ba0, new_ba1);
				patched_once = true;
				restore_next = true;
			}

			m_dsp->debug_run_cycles(1);

			if (restore_next)
			{
				m_dsp->debug_set_banks(snapshot.ba0, snapshot.ba1);
				restore_next = false;
			}

			if ((step + 1) % kCyclesPerSample == 0)
			{
				const int sample = (step + 1) / kCyclesPerSample;
				osd_printf_info(
					"INFO dsp3 a02 su480004 producersite %s pc=%02x sample+%d so=%06x/%06x c42=%08x d42=%06x d45=%06x d49=%06x d4c=%06x\n",
					label,
					target_pc,
					sample,
					m_dsp->debug_serial_output_register(0),
					m_dsp->debug_serial_output_register(1),
					m_dsp->cmem_value(0x42),
					m_dsp->dmem0_value(0x42),
					m_dsp->dmem0_value(0x45),
					m_dsp->dmem0_value(0x49),
					m_dsp->dmem0_value(0x4c));
			}
		}
	};

	for (u8 pc : { u8(0xb6), u8(0xfb) })
	{
		run_variant("prev_once", pc, -1, false);
		run_variant("next_once", pc, +1, false);
		run_variant("prev_each", pc, -1, true);
		run_variant("next_each", pc, +1, true);
	}
}

void tms57002test_state::probe_dsp3_a02_su480005_ba0_phase_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_firstbad_seed/snapshot_su480005_pc00_pre_sine.log";
	static constexpr char kPrevSnapshotPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_firstbad_seed/xmem_su480005_pc00_pre_sine.bin";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(kSnapshotPath);
	const tms57002_device::debug_snapshot prev_snapshot = load_snapshot_from_log(kPrevSnapshotPath);

