joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	auto run_variant = [&](const char *label, int ba0_adjust) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
		load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(snapshot);

		bool patched = false;
		for (int step = 0; step < kCyclesPerSample * 3; step++)
		{
			if (!patched && m_dsp->state_int(TMS57002_PC) == 0x00 && m_dsp->state_int(TMS57002_ID) == 0x1f)
			{
				u8 new_ba0 = snapshot.ba0;
				u8 new_ba1 = snapshot.ba1;
				if (ba0_adjust < 0)
				{
					new_ba0 = prev_snapshot.ba0;
					new_ba1 = prev_snapshot.ba1;
				}
				else if (ba0_adjust > 0)
				{
					new_ba0 = snapshot.ba0 - 1;
					new_ba1 = snapshot.ba1 + 1;
				}

				m_dsp->debug_set_exec_state(
					u8(m_dsp->state_int(TMS57002_PC)),
					u8(m_dsp->state_int(TMS57002_CA)),
					u8(m_dsp->state_int(TMS57002_ID)),
					new_ba0,
					new_ba1,
					m_dsp->state_int(TMS57002_ST0),
					m_dsp->state_int(TMS57002_ST1),
					snapshot.sti);
				patched = true;
			}

			m_dsp->debug_run_cycles(1);

			if ((step + 1) % kCyclesPerSample == 0)
			{
				const int sample = (step + 1) / kCyclesPerSample;
				osd_printf_info(
					"INFO dsp3 a02 su480005 ba0phase %s sample+%d so=%06x/%06x ba0=%02x ba1=%02x c00=%08x c37=%08x c42=%08x d42=%06x d45=%06x d49=%06x d4c=%06x\n",
					label,
					sample,
					m_dsp->debug_serial_output_register(0),
					m_dsp->debug_serial_output_register(1),
					m_dsp->debug_ba0(),
					u8(m_dsp->state_int(TMS57002_BA1)),
					m_dsp->cmem_value(0x00),
					m_dsp->cmem_value(0x37),
					m_dsp->cmem_value(0x42),
					m_dsp->dmem0_value(0x42),
					m_dsp->dmem0_value(0x45),
					m_dsp->dmem0_value(0x49),
					m_dsp->dmem0_value(0x4c));
			}
		}
	};

	run_variant("base", 0);
	run_variant("prev_on_id1f", -1);
	run_variant("next_on_id1f", +1);
}

void tms57002test_state::probe_dsp3_a02_su480005_site_ba0_variants()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_firstbad_seed/snapshot_su480005_pc00_pre_sine.log";
	static constexpr char kPrevSnapshotPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_firstbad_seed/xmem_su480005_pc00_pre_sine.bin";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(kSnapshotPath);
	const tms57002_device::debug_snapshot prev_snapshot = load_snapshot_from_log(kPrevSnapshotPath);

	auto run_variant = [&](const char *label, u8 target_pc, int ba0_adjust) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
		load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(snapshot);

		bool patched = false;
		bool restore_next = false;
		for (int step = 0; step < kCyclesPerSample * 2; step++)
		{
			if (!patched && m_dsp->state_int(TMS57002_ID) == 0x1f && m_dsp->state_int(TMS57002_PC) == target_pc)
			{
				u8 new_ba0 = snapshot.ba0;
				u8 new_ba1 = snapshot.ba1;
				if (ba0_adjust < 0)
				{
					new_ba0 = prev_snapshot.ba0;
					new_ba1 = prev_snapshot.ba1;
				}
				else if (ba0_adjust > 0)
				{
					new_ba0 = snapshot.ba0 - 1;
					new_ba1 = snapshot.ba1 + 1;
				}
				m_dsp->debug_set_banks(new_ba0, new_ba1);
				patched = true;
				restore_next = true;
			}

			m_dsp->debug_run_cycles(1);

			if (restore_next)
			{
				m_dsp->debug_set_banks(snapshot.ba0, snapshot.ba1);
				restore_next = false;
			}

			if ((step + 1) % kCyclesPerSample == 0)
			{
				const int sample = (step + 1) / kCyclesPerSample;
				osd_printf_info(
					"INFO dsp3 a02 su480005 siteba0 %s pc=%02x sample+%d so=%06x/%06x c00=%08x c37=%08x c42=%08x d42=%06x d45=%06x d49=%06x d4c=%06x\n",
					label,
					target_pc,
					sample,
					m_dsp->debug_serial_output_register(0),
					m_dsp->debug_serial_output_register(1),
					m_dsp->cmem_value(0x00),
					m_dsp->cmem_value(0x37),
					m_dsp->cmem_value(0x42),
					m_dsp->dmem0_value(0x42),
					m_dsp->dmem0_value(0x45),
					m_dsp->dmem0_value(0x49),
					m_dsp->dmem0_value(0x4c));
			}
		}
	};

	for (u8 pc : { u8(0xad), u8(0xb3), u8(0xf4), u8(0xf6) })
	{
		run_variant("prev_once", pc, -1);
		run_variant("next_once", pc, +1);
	}
}

void tms57002test_state::probe_dsp3_a02_su480005_repeat_site_ba0_variants()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_firstbad_seed/snapshot_su480005_pc00_pre_sine.log";
	static constexpr char kPrevSnapshotPath[] = "tmp/kprop_a02_su480004_seed/error.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_firstbad_seed/xmem_su480005_pc00_pre_sine.bin";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(kSnapshotPath);
	const tms57002_device::debug_snapshot prev_snapshot = load_snapshot_from_log(kPrevSnapshotPath);

	auto run_variant = [&](const char *label, u8 target_pc, int ba0_adjust) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
		load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(snapshot);

		bool restore_next = false;
		for (int step = 0; step < kCyclesPerSample * 4; step++)
		{
			if (m_dsp->state_int(TMS57002_ID) == 0x1f && m_dsp->state_int(TMS57002_PC) == target_pc)
			{
				u8 new_ba0 = snapshot.ba0;
				u8 new_ba1 = snapshot.ba1;
				if (ba0_adjust < 0)
				{
					new_ba0 = prev_snapshot.ba0;
					new_ba1 = prev_snapshot.ba1;
				}
				else if (ba0_adjust > 0)
				{
					new_ba0 = snapshot.ba0 - 1;
					new_ba1 = snapshot.ba1 + 1;
				}
				m_dsp->debug_set_banks(new_ba0, new_ba1);
				restore_next = true;
			}

			m_dsp->debug_run_cycles(1);

			if (restore_next)
			{
				m_dsp->debug_set_banks(snapshot.ba0, snapshot.ba1);
				restore_next = false;
			}

			if ((step + 1) % kCyclesPerSample == 0)
			{
				const int sample = (step + 1) / kCyclesPerSample;
				osd_printf_info(
					"INFO dsp3 a02 su480005 repeatsite %s pc=%02x sample+%d so=%06x/%06x c00=%08x c37=%08x c42=%08x d42=%06x d45=%06x d49=%06x d4c=%06x\n",
					label,
					target_pc,
					sample,
					m_dsp->debug_serial_output_register(0),
					m_dsp->debug_serial_output_register(1),
					m_dsp->cmem_value(0x00),
					m_dsp->cmem_value(0x37),
					m_dsp->cmem_value(0x42),
					m_dsp->dmem0_value(0x42),
					m_dsp->dmem0_value(0x45),
					m_dsp->dmem0_value(0x49),
					m_dsp->dmem0_value(0x4c));
			}
		}
	};

	for (u8 pc : { u8(0xb3), u8(0xf6) })
	{
		run_variant("prev_each", pc, -1);
		run_variant("next_each", pc, +1);
	}
}

void tms57002test_state::probe_dsp3_a02_tape_su480003_group_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSineLogPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/snapshot_su480003_pc00_pre.log";
	static constexpr char kImpulseLogPath[] = "00-extracted/kprop_a02_impulse_sample_tape_long_20260408/extracted/snapshot_su480003_pc00_pre.log";
	static constexpr char kSineRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/ram/su480003_pc00_pre.bin";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot sine = load_snapshot_from_log(kSineLogPath);
	const tms57002_device::debug_snapshot impulse = load_snapshot_from_log(kImpulseLogPath);

	auto phys = [&](u8 logical) -> u8 { return u8(logical + sine.ba0); };

	auto run_variant = [&](const char *label, const tms57002_device::debug_snapshot &base) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), base.st0, base.st1);
		load_data_space_bytes(kSineRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(base);
		for (int sample = 0; sample < 4; sample++)
		{
			for (int i = 0; i < kCyclesPerSample; i++)
				m_dsp->debug_run_cycles(1);
			osd_printf_info(
				"INFO dsp3 a02 tapegroup %s sample+%d so=%06x/%06x ba0=%02x d02=%06x d03=%06x d04=%06x d05=%06x d06=%06x d07=%06x d20=%06x d21=%06x d22=%06x d31=%06x d32=%06x d33=%06x d51=%06x d52=%06x d54=%06x d57=%06x\n",
				label,
				sample + 1,
				m_dsp->debug_serial_output_register(0),
				m_dsp->debug_serial_output_register(1),
				m_dsp->debug_ba0(),
				m_dsp->dmem0_value(phys(0x02)),
				m_dsp->dmem0_value(phys(0x03)),
				m_dsp->dmem0_value(phys(0x04)),
				m_dsp->dmem0_value(phys(0x05)),
				m_dsp->dmem0_value(phys(0x06)),
				m_dsp->dmem0_value(phys(0x07)),
				m_dsp->dmem0_value(phys(0x20)),
				m_dsp->dmem0_value(phys(0x21)),
				m_dsp->dmem0_value(phys(0x22)),
				m_dsp->dmem0_value(phys(0x31)),
				m_dsp->dmem0_value(phys(0x32)),
				m_dsp->dmem0_value(phys(0x33)),
				m_dsp->dmem0_value(phys(0x51)),
				m_dsp->dmem0_value(phys(0x52)),
				m_dsp->dmem0_value(phys(0x54)),
				m_dsp->dmem0_value(phys(0x57)));
		}
	};

	run_variant("sine_base", sine);
	run_variant("impulse_base", impulse);

	for (auto group : {
			std::vector<u8>{0x02,0x03,0x04,0x05,0x06,0x07},
			std::vector<u8>{0x20,0x21,0x22,0x23,0x24},
			std::vector<u8>{0x31,0x32,0x33,0x34,0x35,0x36},
			std::vector<u8>{0x51,0x52,0x53,0x54,0x55,0x57},
			std::vector<u8>{0x51},
			std::vector<u8>{0x52},
			std::vector<u8>{0x54},
			std::vector<u8>{0x55},
			std::vector<u8>{0x57},
			std::vector<u8>{0x53},
			std::vector<u8>{0x56},
			std::vector<u8>{0x51,0x54,0x57},
			std::vector<u8>{0x54,0x55,0x57},
			std::vector<u8>{0xc1,0xc2,0xc3,0xc4,0xc5} })
	{
		tms57002_device::debug_snapshot variant = sine;
		char label[64];
		std::snprintf(label, sizeof(label), "imp_");
		std::size_t off = std::strlen(label);
		for (std::size_t i = 0; i < group.size(); i++)
		{
			const u8 logical = group[i];
			variant.dmem0[(logical + variant.ba0) & 0xff] = impulse.dmem0[(logical + impulse.ba0) & 0xff];
			off += std::snprintf(label + off, sizeof(label) - off, i ? "_%02x" : "%02x", logical);
		}
		run_variant(label, variant);
	}
}

void tms57002test_state::probe_dsp3_a02_tape_su480003_producer_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSineLogPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/snapshot_su480003_pc00_pre.log";
	static constexpr char kImpulseLogPath[] = "00-extracted/kprop_a02_impulse_sample_tape_long_20260408/extracted/snapshot_su480003_pc00_pre.log";
	static constexpr char kSineRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/ram/su480003_pc00_pre.bin";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot sine = load_snapshot_from_log(kSineLogPath);
	const tms57002_device::debug_snapshot impulse = load_snapshot_from_log(kImpulseLogPath);

	auto copy_logical = [](tms57002_device::debug_snapshot &dst, const tms57002_device::debug_snapshot &src, std::initializer_list<u8> logicals) -> void
	{
		for (const u8 logical : logicals)
			dst.dmem0[(logical + dst.ba0) & 0xff] = src.dmem0[(logical + src.ba0) & 0xff];
	};

	auto run_variant = [&](const char *label, const tms57002_device::debug_snapshot &base) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), base.st0, base.st1);
		load_data_space_bytes(kSineRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(base);

		bool logged_b1 = false;
		bool logged_b7 = false;
		for (int step = 0; step < kCyclesPerSample * 4; step++)
		{
			m_dsp->debug_run_cycles(1);

			const int sample_index = step / kCyclesPerSample;
			if (sample_index == 0)
			{
				const u8 pc = u8(m_dsp->state_int(TMS57002_PC));
				const u8 id = u8(m_dsp->state_int(TMS57002_ID));
				const u8 ba0 = m_dsp->debug_ba0();
				auto logical = [&](u8 addr) { return m_dsp->dmem0_value((addr + ba0) & 0xff); };

				if (!logged_b1 && pc == 0xb1)
				{
					logged_b1 = true;
					osd_printf_info(
						"INFO dsp3 a02 tapeprodmid %s site=b0 id=%02x ba0=%02x aacc=%08x macc=%013llx so=%06x/%06x d50=%06x d51=%06x d52=%06x d53=%06x d54=%06x d55=%06x\n",
						label,
						id,
						ba0,
						u32(m_dsp->debug_aacc()),
						(unsigned long long)m_dsp->debug_macc(),
						m_dsp->debug_serial_output_register(0),
						m_dsp->debug_serial_output_register(1),
						logical(0x50),
						logical(0x51),
						logical(0x52),
						logical(0x53),
						logical(0x54),
						logical(0x55));
				}
				if (!logged_b7 && pc == 0xb7)
				{
					logged_b7 = true;
					osd_printf_info(
						"INFO dsp3 a02 tapeprodmid %s site=b6 id=%02x ba0=%02x aacc=%08x macc=%013llx so=%06x/%06x d53=%06x d54=%06x d55=%06x d56=%06x d57=%06x d58=%06x\n",
						label,
						id,
						ba0,
						u32(m_dsp->debug_aacc()),
						(unsigned long long)m_dsp->debug_macc(),
						m_dsp->debug_serial_output_register(0),
						m_dsp->debug_serial_output_register(1),
						logical(0x53),
						logical(0x54),
						logical(0x55),
						logical(0x56),
						logical(0x57),
						logical(0x58));
				}
			}

			if ((step + 1) % kCyclesPerSample == 0)
			{
				const int sample = (step + 1) / kCyclesPerSample;
				const u8 ba0 = m_dsp->debug_ba0();
				auto logical = [&](u8 addr) { return m_dsp->dmem0_value((addr + ba0) & 0xff); };
				osd_printf_info(
					"INFO dsp3 a02 tapeprod %s sample+%d so=%06x/%06x ba0=%02x aacc=%08x macc=%013llx d50=%06x d51=%06x d52=%06x d53=%06x d54=%06x d55=%06x d56=%06x d57=%06x d58=%06x\n",
					label,
					sample,
					m_dsp->debug_serial_output_register(0),
					m_dsp->debug_serial_output_register(1),
					ba0,
					u32(m_dsp->debug_aacc()),
					(unsigned long long)m_dsp->debug_macc(),
					logical(0x50),
					logical(0x51),
					logical(0x52),
					logical(0x53),
					logical(0x54),
					logical(0x55),
					logical(0x56),
					logical(0x57),
					logical(0x58));
			}
		}
	};

	run_variant("sine_base", sine);
	run_variant("impulse_base", impulse);

	{
		tms57002_device::debug_snapshot variant = sine;
		variant.aacc = impulse.aacc;
		variant.macc = impulse.macc;
		variant.macc_read = impulse.macc_read;
		variant.macc_write = impulse.macc_write;
		variant.creg = impulse.creg;
		run_variant("imp_core", variant);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_logical(variant, impulse, { 0x50, 0x51, 0x52 });
		run_variant("imp_d50_52", variant);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_logical(variant, impulse, { 0x53 });
		run_variant("imp_d53", variant);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_logical(variant, impulse, { 0x54, 0x55 });
		run_variant("imp_d54_55", variant);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_logical(variant, impulse, { 0x57, 0x58 });
		run_variant("imp_d57_58", variant);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_logical(variant, impulse, { 0x50, 0x51, 0x52, 0x53, 0x54, 0x55, 0x56, 0x57, 0x58 });
		run_variant("imp_d50_58", variant);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		variant.aacc = impulse.aacc;
		variant.macc = impulse.macc;
		variant.macc_read = impulse.macc_read;
		variant.macc_write = impulse.macc_write;
		variant.creg = impulse.creg;
		copy_logical(variant, impulse, { 0x50, 0x51, 0x52, 0x53, 0x54, 0x55, 0x56, 0x57, 0x58 });
		run_variant("imp_core_d50_58", variant);
	}
}

