joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
void tms57002test_state::probe_dsp3_a02_tape_su480002_hot_producer_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSineLogPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/snapshot_su480002_pc00_pre.log";
	static constexpr char kImpulseLogPath[] = "00-extracted/kprop_a02_impulse_sample_tape_long_20260408/extracted/snapshot_su480002_pc00_pre.log";
	static constexpr char kSineRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/ram/su480002_pc00_pre.bin";
	static constexpr char kImpulseRamPath[] = "00-extracted/kprop_a02_impulse_sample_tape_long_20260408/ram/su480002_pc00_pre.bin";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot sine = load_snapshot_from_log(kSineLogPath);
	const tms57002_device::debug_snapshot impulse = load_snapshot_from_log(kImpulseLogPath);

	auto copy_logical = [](tms57002_device::debug_snapshot &dst, const tms57002_device::debug_snapshot &src, std::initializer_list<u8> logicals) -> void
	{
		for (const u8 logical : logicals)
			dst.dmem0[(logical + dst.ba0) & 0xff] = src.dmem0[(logical + src.ba0) & 0xff];
	};

	auto copy_serial = [](tms57002_device::debug_snapshot &dst, const tms57002_device::debug_snapshot &src) -> void
	{
		dst.si = src.si;
		dst.serial_input_latch = src.serial_input_latch;
		dst.serial_input_active = src.serial_input_active;
		dst.serial_input_frame = src.serial_input_frame;
		dst.serial_input_prev_frame = src.serial_input_prev_frame;
		dst.serial_input_pending = src.serial_input_pending;
		dst.serial_input_valid = src.serial_input_valid;
		dst.serial_input_active_valid = src.serial_input_active_valid;
		dst.serial_input_prev_valid = src.serial_input_prev_valid;
		dst.serial_input_pending_valid = src.serial_input_pending_valid;
		dst.serial_output_pending_valid = src.serial_output_pending_valid;
		dst.serial_frame_mode = src.serial_frame_mode;
		dst.serial_input_timing_mode = src.serial_input_timing_mode;
		dst.serial_frame_clocks = src.serial_frame_clocks;
		dst.serial_exec_halfcycles = src.serial_exec_halfcycles;
		dst.serial_input_pending_halfcycle = src.serial_input_pending_halfcycle;
		dst.serial_output_pending_halfcycle = src.serial_output_pending_halfcycle;
		dst.sync_polarity_rising = src.sync_polarity_rising;
		dst.serial_output_muted = src.serial_output_muted;
	};

	auto copy_core = [](tms57002_device::debug_snapshot &dst, const tms57002_device::debug_snapshot &src) -> void
	{
		dst.aacc = src.aacc;
		dst.macc = src.macc;
		dst.macc_read = src.macc_read;
		dst.macc_write = src.macc_write;
		dst.creg = src.creg;
		dst.st1 = src.st1;
	};

	auto copy_xmem = [](tms57002_device::debug_snapshot &dst, const tms57002_device::debug_snapshot &src) -> void
	{
		dst.xoa = src.xoa;
		dst.xba = src.xba;
		dst.xwr = src.xwr;
		dst.xrd = src.xrd;
		dst.txrd = src.txrd;
		dst.xm_adr = src.xm_adr;
		dst.xm_cycles = src.xm_cycles;
		dst.xm_fetches = src.xm_fetches;
	};

	auto log_hot_state = [&](const char *label, u8 executed_pc) -> void
	{
		const u8 ba0 = m_dsp->debug_ba0();
		auto logical = [&](u8 addr) { return m_dsp->dmem0_value((addr + ba0) & 0xff); };
		osd_printf_info(
			"INFO dsp3 a02 su480002 hotprod %s pc=%02x id=%02x ca=%02x ba0=%02x aacc=%08x macc=%013llx creg=%08x "
			"d02=%06x d03=%06x d04=%06x d05=%06x d10=%06x d11=%06x d62=%06x d63=%06x d64=%06x "
			"l50=%06x l51=%06x l52=%06x l53=%06x l54=%06x l55=%06x l56=%06x l57=%06x l58=%06x "
			"xoa=%05x xba=%05x xrd=%06x txrd=%06x so=%06x/%06x\n",
			label,
			executed_pc,
			u8(m_dsp->state_int(TMS57002_ID)),
			u8(m_dsp->state_int(TMS57002_CA)),
			ba0,
			u32(m_dsp->debug_aacc()),
			(unsigned long long)m_dsp->debug_macc(),
			m_dsp->debug_creg(),
			logical(0x02),
			logical(0x03),
			logical(0x04),
			logical(0x05),
			logical(0x10),
			logical(0x11),
			logical(0x62),
			logical(0x63),
			logical(0x64),
			logical(0x50),
			logical(0x51),
			logical(0x52),
			logical(0x53),
			logical(0x54),
			logical(0x55),
			logical(0x56),
			logical(0x57),
			logical(0x58),
			m_dsp->debug_xoa(),
			m_dsp->debug_xba(),
			m_dsp->debug_xrd(),
			m_dsp->debug_txrd(),
			m_dsp->debug_serial_output_register(0),
			m_dsp->debug_serial_output_register(1));
	};

	auto run_variant = [&](const char *label, const tms57002_device::debug_snapshot &base, const char *ram_path) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), base.st0, base.st1);
		load_data_space_bytes(ram_path, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(base);

		for (int step = 0; step < kCyclesPerSample * 2; step++)
		{
			const int sample_index = step / kCyclesPerSample;
			const u8 executed_pc = u8(m_dsp->state_int(TMS57002_PC));
			const u8 executed_id = u8(m_dsp->state_int(TMS57002_ID));
			m_dsp->debug_run_cycles(1);

			if (sample_index == 0 && executed_id == 0x1f && (executed_pc == 0x82 || executed_pc == 0x83 || executed_pc == 0x88 || executed_pc == 0x8e || executed_pc == 0x8f || executed_pc == 0x90))
				log_hot_state(label, executed_pc);

			if ((step + 1) % kCyclesPerSample == 0)
			{
				const int sample = (step + 1) / kCyclesPerSample;
				const u8 ba0 = m_dsp->debug_ba0();
				auto logical = [&](u8 addr) { return m_dsp->dmem0_value((addr + ba0) & 0xff); };
				osd_printf_info(
					"INFO dsp3 a02 su480002 hotsummary %s sample+%d so=%06x/%06x ba0=%02x macc=%013llx l50=%06x l51=%06x l52=%06x l53=%06x l54=%06x l55=%06x l56=%06x l57=%06x l58=%06x\n",
					label,
					sample,
					m_dsp->debug_serial_output_register(0),
					m_dsp->debug_serial_output_register(1),
					ba0,
					(unsigned long long)m_dsp->debug_macc(),
					logical(0x50),
					logical(0x51),
					logical(0x52),
					logical(0x53),
					logical(0x54),
					logical(0x55),
					logical(0x56),
					logical(0x57),
					logical(0x58));
			}
		}
	};

	run_variant("sine_base", sine, kSineRamPath);
	run_variant("impulse_base", impulse, kImpulseRamPath);

	{
		tms57002_device::debug_snapshot variant = sine;
		copy_serial(variant, impulse);
		run_variant("imp_serial", variant, kSineRamPath);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_core(variant, impulse);
		run_variant("imp_core", variant, kSineRamPath);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_logical(variant, impulse, { 0x02, 0x03, 0x04, 0x05 });
		run_variant("imp_d02_05", variant, kSineRamPath);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_logical(variant, impulse, { 0x10, 0x11 });
		run_variant("imp_d10_11", variant, kSineRamPath);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		copy_xmem(variant, impulse);
		run_variant("imp_xmem", variant, kSineRamPath);
	}
	{
		tms57002_device::debug_snapshot variant = sine;
		for (u8 addr = 0; addr <= 0x10; addr++)
			variant.cmem[addr] = impulse.cmem[addr];
		run_variant("imp_c00_10", variant, kSineRamPath);
	}
}

