joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
void tms57002test_state::probe_dsp3_a02_tape_su480002_serial_firstdiff()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSineLogPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/snapshot_su480002_pc00_pre.log";
	static constexpr char kImpulseLogPath[] = "00-extracted/kprop_a02_impulse_sample_tape_long_20260408/extracted/snapshot_su480002_pc00_pre.log";
	static constexpr char kSineRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/ram/su480002_pc00_pre.bin";
	static constexpr int kCyclesPerSample = 512;

	struct replay_step
	{
		u8 pc = 0;
		u8 ca = 0;
		u8 id = 0;
		u32 st1 = 0;
		u32 aacc = 0;
		s64 macc = 0;
		u32 creg = 0;
		u32 xrd = 0;
		u32 so0 = 0;
		u32 so1 = 0;
		u32 d02 = 0;
		u32 d03 = 0;
		u32 d04 = 0;
		u32 d05 = 0;
		u32 d10 = 0;
		u32 d11 = 0;
		u32 d50 = 0;
		u32 d53 = 0;
		u32 d56 = 0;
	};

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot sine = load_snapshot_from_log(kSineLogPath);
	const tms57002_device::debug_snapshot impulse = load_snapshot_from_log(kImpulseLogPath);
	tms57002_device::debug_snapshot variant = sine;

	variant.si = impulse.si;
	variant.serial_input_latch = impulse.serial_input_latch;
	variant.serial_input_active = impulse.serial_input_active;
	variant.serial_input_frame = impulse.serial_input_frame;
	variant.serial_input_prev_frame = impulse.serial_input_prev_frame;
	variant.serial_input_pending = impulse.serial_input_pending;
	variant.serial_input_valid = impulse.serial_input_valid;
	variant.serial_input_active_valid = impulse.serial_input_active_valid;
	variant.serial_input_prev_valid = impulse.serial_input_prev_valid;
	variant.serial_input_pending_valid = impulse.serial_input_pending_valid;
	variant.serial_output_pending_valid = impulse.serial_output_pending_valid;
	variant.serial_frame_mode = impulse.serial_frame_mode;
	variant.serial_input_timing_mode = impulse.serial_input_timing_mode;
	variant.serial_frame_clocks = impulse.serial_frame_clocks;
	variant.serial_exec_halfcycles = impulse.serial_exec_halfcycles;
	variant.serial_input_pending_halfcycle = impulse.serial_input_pending_halfcycle;
	variant.serial_output_pending_halfcycle = impulse.serial_output_pending_halfcycle;
	variant.sync_polarity_rising = impulse.sync_polarity_rising;
	variant.serial_output_muted = impulse.serial_output_muted;

	auto capture = [&](const tms57002_device::debug_snapshot &base) -> std::vector<replay_step>
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), base.st0, base.st1);
		load_data_space_bytes(kSineRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(base);

		std::vector<replay_step> out;
		out.reserve(kCyclesPerSample);
		for (int i = 0; i < kCyclesPerSample; i++)
		{
			m_dsp->debug_run_cycles(1);
			const u8 ba0 = m_dsp->debug_ba0();
			auto logical = [&](u8 addr) { return m_dsp->dmem0_value((addr + ba0) & 0xff); };

			replay_step step;
			step.pc = u8(m_dsp->state_int(TMS57002_PC));
			step.ca = u8(m_dsp->state_int(TMS57002_CA));
			step.id = u8(m_dsp->state_int(TMS57002_ID));
			step.st1 = m_dsp->state_int(TMS57002_ST1);
			step.aacc = u32(m_dsp->debug_aacc());
			step.macc = s64(m_dsp->debug_macc());
			step.creg = m_dsp->debug_creg();
			step.xrd = m_dsp->debug_xrd();
			step.so0 = m_dsp->debug_serial_output_register(0);
			step.so1 = m_dsp->debug_serial_output_register(1);
			step.d02 = logical(0x02);
			step.d03 = logical(0x03);
			step.d04 = logical(0x04);
			step.d05 = logical(0x05);
			step.d10 = logical(0x10);
			step.d11 = logical(0x11);
			step.d50 = logical(0x50);
			step.d53 = logical(0x53);
			step.d56 = logical(0x56);
			out.push_back(step);
		}
		return out;
	};

	const std::vector<replay_step> base = capture(sine);
	const std::vector<replay_step> altered = capture(variant);

	int diffs_logged = 0;
	bool meaningful_logged = false;
	bool carry_logged = false;
	for (std::size_t i = 0; i < base.size() && i < altered.size(); i++)
	{
		const replay_step &a = base[i];
		const replay_step &b = altered[i];
		const bool any_diff = (a.pc != b.pc || a.ca != b.ca || a.id != b.id || a.st1 != b.st1 || a.aacc != b.aacc || a.macc != b.macc || a.creg != b.creg || a.xrd != b.xrd || a.so0 != b.so0 || a.so1 != b.so1 || a.d02 != b.d02 || a.d03 != b.d03 || a.d04 != b.d04 || a.d05 != b.d05 || a.d10 != b.d10 || a.d11 != b.d11 || a.d50 != b.d50 || a.d53 != b.d53 || a.d56 != b.d56);
		if (any_diff)
		{
			if (diffs_logged < 12)
			{
				osd_printf_info(
					"INFO dsp3 a02 su480002 serialdiff idx=%d step=%zu pc=%02x/%02x ca=%02x/%02x id=%02x/%02x st1=%06x/%06x "
					"aacc=%08x/%08x macc=%013llx/%013llx creg=%08x/%08x xrd=%06x/%06x so=%06x/%06x vs %06x/%06x "
					"d02=%06x/%06x d03=%06x/%06x d04=%06x/%06x d05=%06x/%06x d10=%06x/%06x d11=%06x/%06x d50=%06x/%06x d53=%06x/%06x d56=%06x/%06x\n",
					diffs_logged + 1,
					i + 1,
					a.pc, b.pc,
					a.ca, b.ca,
					a.id, b.id,
					a.st1, b.st1,
					a.aacc, b.aacc,
					(unsigned long long)a.macc, (unsigned long long)b.macc,
					a.creg, b.creg,
					a.xrd, b.xrd,
					a.so0, a.so1, b.so0, b.so1,
					a.d02, b.d02,
					a.d03, b.d03,
					a.d04, b.d04,
					a.d05, b.d05,
					a.d10, b.d10,
					a.d11, b.d11,
					a.d50, b.d50,
					a.d53, b.d53,
					a.d56, b.d56);
				diffs_logged++;
			}

			const bool meaningful = (a.macc != b.macc || a.so0 != b.so0 || a.so1 != b.so1 || a.d50 != b.d50 || a.d53 != b.d53 || a.d56 != b.d56);
			if (meaningful && !meaningful_logged)
			{
				osd_printf_info(
					"INFO dsp3 a02 su480002 serialmeaningful step=%zu pc=%02x/%02x ca=%02x/%02x id=%02x/%02x "
					"macc=%013llx/%013llx so=%06x/%06x vs %06x/%06x d50=%06x/%06x d53=%06x/%06x d56=%06x/%06x d02=%06x/%06x d03=%06x/%06x d04=%06x/%06x d05=%06x/%06x\n",
					i + 1,
					a.pc, b.pc,
					a.ca, b.ca,
					a.id, b.id,
					(unsigned long long)a.macc, (unsigned long long)b.macc,
					a.so0, a.so1, b.so0, b.so1,
					a.d50, b.d50,
					a.d53, b.d53,
					a.d56, b.d56,
					a.d02, b.d02,
					a.d03, b.d03,
					a.d04, b.d04,
					a.d05, b.d05);
				meaningful_logged = true;
			}

			const bool carry = (a.d50 != b.d50 || a.d53 != b.d53 || a.d56 != b.d56);
			if (carry && !carry_logged)
			{
				osd_printf_info(
					"INFO dsp3 a02 su480002 serialcarry step=%zu pc=%02x/%02x ca=%02x/%02x id=%02x/%02x "
					"d50=%06x/%06x d53=%06x/%06x d56=%06x/%06x macc=%013llx/%013llx d02=%06x/%06x\n",
					i + 1,
					a.pc, b.pc,
					a.ca, b.ca,
					a.id, b.id,
					a.d50, b.d50,
					a.d53, b.d53,
					a.d56, b.d56,
					(unsigned long long)a.macc, (unsigned long long)b.macc,
					a.d02, b.d02);
				carry_logged = true;
			}
		}
	}

