joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	if (diffs_logged == 0)
		osd_printf_info("INFO dsp3 a02 su480002 serialdiff none\n");
	if (!meaningful_logged)
		osd_printf_info("INFO dsp3 a02 su480002 serialmeaningful none\n");
	if (!carry_logged)
		osd_printf_info("INFO dsp3 a02 su480002 serialcarry none\n");
}

void tms57002test_state::probe_dsp3_a02_tape_su480002_serial_path_checks()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kSineLogPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/extracted/snapshot_su480002_pc00_pre.log";
	static constexpr char kImpulseLogPath[] = "00-extracted/kprop_a02_impulse_sample_tape_long_20260408/extracted/snapshot_su480002_pc00_pre.log";
	static constexpr char kSineRamPath[] = "00-extracted/kprop_a02_sine_sample_tape_480001_480006_20260408/ram/su480002_pc00_pre.bin";

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot sine = load_snapshot_from_log(kSineLogPath);
	const tms57002_device::debug_snapshot impulse = load_snapshot_from_log(kImpulseLogPath);
	tms57002_device::debug_snapshot imp_serial = sine;
	imp_serial.si = impulse.si;
	imp_serial.serial_input_latch = impulse.serial_input_latch;
	imp_serial.serial_input_active = impulse.serial_input_active;
	imp_serial.serial_input_frame = impulse.serial_input_frame;
	imp_serial.serial_input_prev_frame = impulse.serial_input_prev_frame;
	imp_serial.serial_input_pending = impulse.serial_input_pending;
	imp_serial.serial_input_valid = impulse.serial_input_valid;
	imp_serial.serial_input_active_valid = impulse.serial_input_active_valid;
	imp_serial.serial_input_prev_valid = impulse.serial_input_prev_valid;
	imp_serial.serial_input_pending_valid = impulse.serial_input_pending_valid;
	imp_serial.serial_output_pending_valid = impulse.serial_output_pending_valid;
	imp_serial.serial_frame_mode = impulse.serial_frame_mode;
	imp_serial.serial_input_timing_mode = impulse.serial_input_timing_mode;
	imp_serial.serial_frame_clocks = impulse.serial_frame_clocks;
	imp_serial.serial_exec_halfcycles = impulse.serial_exec_halfcycles;
	imp_serial.serial_input_pending_halfcycle = impulse.serial_input_pending_halfcycle;
	imp_serial.serial_output_pending_halfcycle = impulse.serial_output_pending_halfcycle;
	imp_serial.sync_polarity_rising = impulse.sync_polarity_rising;
	imp_serial.serial_output_muted = impulse.serial_output_muted;

	struct checkpoint
	{
		u32 aacc52_pre = 0;
		s64 macc52_pre = 0;
		s64 macc52_post = 0;
		u32 d02_52 = 0;
		s64 macc82_pre = 0;
		s64 macc82_post = 0;
		u32 d50_82 = 0;
		u8 ba0_82 = 0;
		s64 macc88_pre = 0;
		s64 macc88_post = 0;
		u32 d53_88 = 0;
		s64 macc8e_pre = 0;
		s64 macc8e_post = 0;
		u32 d56_8e = 0;
		bool have52 = false;
		bool have82 = false;
		bool have88 = false;
		bool have8e = false;
	};

	auto run = [&](const tms57002_device::debug_snapshot &base) -> checkpoint
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), base.st0, base.st1);
		load_data_space_bytes(kSineRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(base);

		checkpoint out;
		for (int step = 0; step < 512; step++)
		{
			const u8 executed_pc = u8(m_dsp->state_int(TMS57002_PC));
			const u8 executed_id = u8(m_dsp->state_int(TMS57002_ID));
			const u8 ba0 = m_dsp->debug_ba0();
			auto logical = [&](u8 addr) { return m_dsp->dmem0_value((addr + ba0) & 0xff); };

			if (executed_id == 0x00 && executed_pc == 0x52)
			{
				out.have52 = true;
				out.aacc52_pre = u32(m_dsp->debug_aacc());
				out.macc52_pre = s64(m_dsp->debug_macc());
				out.d02_52 = logical(0x02);
			}

			if (executed_id == 0x1f && executed_pc == 0x82)
			{
				out.have82 = true;
				out.macc82_pre = s64(m_dsp->debug_macc());
				out.ba0_82 = ba0;
			}
			if (executed_id == 0x1f && executed_pc == 0x88)
			{
				out.have88 = true;
				out.macc88_pre = s64(m_dsp->debug_macc());
			}
			if (executed_id == 0x1f && executed_pc == 0x8e)
			{
				out.have8e = true;
				out.macc8e_pre = s64(m_dsp->debug_macc());
			}

			m_dsp->debug_run_cycles(1);

			if (executed_id == 0x00 && executed_pc == 0x52)
				out.macc52_post = s64(m_dsp->debug_macc());
			if (executed_id == 0x1f && executed_pc == 0x82)
			{
				out.macc82_post = s64(m_dsp->debug_macc());
				out.d50_82 = m_dsp->dmem0_value((out.ba0_82 + 0x50) & 0xff);
			}
			if (executed_id == 0x1f && executed_pc == 0x88)
			{
				out.macc88_post = s64(m_dsp->debug_macc());
				out.d53_88 = m_dsp->dmem0_value((ba0 + 0x53) & 0xff);
			}
			if (executed_id == 0x1f && executed_pc == 0x8e)
			{
				out.macc8e_post = s64(m_dsp->debug_macc());
				out.d56_8e = m_dsp->dmem0_value((ba0 + 0x56) & 0xff);
				break;
			}
		}
		return out;
	};

	const checkpoint a = run(sine);
	const checkpoint b = run(imp_serial);
	const s64 expected_delta_a = (s64(s32(a.aacc52_pre)) * sx24(a.d02_52)) >> 7;
	const s64 expected_delta_b = (s64(s32(b.aacc52_pre)) * sx24(b.d02_52)) >> 7;

	osd_printf_info(
		"INFO dsp3 a02 su480002 serialpath pc52 sine aacc=%08x d02=%06x macc=%013llx->%013llx delta=%013llx expect=%013llx\n",
		a.aacc52_pre, a.d02_52,
		(unsigned long long)a.macc52_pre, (unsigned long long)a.macc52_post,
		(unsigned long long)(a.macc52_post - a.macc52_pre),
		(unsigned long long)expected_delta_a);
	osd_printf_info(
		"INFO dsp3 a02 su480002 serialpath pc52 impserial aacc=%08x d02=%06x macc=%013llx->%013llx delta=%013llx expect=%013llx\n",
		b.aacc52_pre, b.d02_52,
		(unsigned long long)b.macc52_pre, (unsigned long long)b.macc52_post,
		(unsigned long long)(b.macc52_post - b.macc52_pre),
		(unsigned long long)expected_delta_b);
	osd_printf_info(
		"INFO dsp3 a02 su480002 serialpath pc82 sine macc=%013llx->%013llx d50=%06x\n",
		(unsigned long long)a.macc82_pre, (unsigned long long)a.macc82_post, a.d50_82);
	osd_printf_info(
		"INFO dsp3 a02 su480002 serialpath pc82 impserial macc=%013llx->%013llx d50=%06x\n",
		(unsigned long long)b.macc82_pre, (unsigned long long)b.macc82_post, b.d50_82);
	osd_printf_info(
		"INFO dsp3 a02 su480002 serialpath pc88 sine macc=%013llx->%013llx d53=%06x\n",
		(unsigned long long)a.macc88_pre, (unsigned long long)a.macc88_post, a.d53_88);
	osd_printf_info(
		"INFO dsp3 a02 su480002 serialpath pc88 impserial macc=%013llx->%013llx d53=%06x\n",
		(unsigned long long)b.macc88_pre, (unsigned long long)b.macc88_post, b.d53_88);
	osd_printf_info(
		"INFO dsp3 a02 su480002 serialpath pc8e sine macc=%013llx->%013llx d56=%06x\n",
		(unsigned long long)a.macc8e_pre, (unsigned long long)a.macc8e_post, a.d56_8e);
	osd_printf_info(
		"INFO dsp3 a02 su480002 serialpath pc8e impserial macc=%013llx->%013llx d56=%06x\n",
		(unsigned long long)b.macc8e_pre, (unsigned long long)b.macc8e_post, b.d56_8e);
}

void tms57002test_state::probe_dsp3_a02_tape_boundary_replay()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kLogPath[] = "00-extracted/kprop_a02_sample_tape_20260408/error.log";
	static constexpr char kRamDir[] = "00-extracted/kprop_a02_sample_tape_20260408/ram";
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const std::vector<std::string> lines = load_text_lines(kLogPath);

	auto load_ram = [](u64 su) -> std::vector<u8>
	{
		const std::string path = util::string_format("%s/su%06llu_pc00_pre.bin", kRamDir, (unsigned long long)su);
		std::ifstream input(path, std::ios::binary);
		if (!input)
			throw emu_fatalerror("Unable to open %s", path);
		return std::vector<u8>((std::istreambuf_iterator<char>(input)), std::istreambuf_iterator<char>());
	};

	auto compare_and_log = [&](u64 su) -> void
	{
		const tms57002_device::debug_snapshot start = load_snapshot_for_su_from_lines(lines, su);
		const tms57002_device::debug_snapshot expect = load_snapshot_for_su_from_lines(lines, su + 1);
		const std::vector<u8> expect_ram = load_ram(su + 1);
		const std::string start_ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", kRamDir, (unsigned long long)su);

		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (int steps = 0; steps < kCyclesPerSample; steps++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(expect.serial_input_frame);

		const tms57002_device::debug_snapshot actual = m_dsp->debug_capture_snapshot();

		struct field_diff
		{
			const char *name;
			s64 actual;
			s64 expect;
		};

		std::vector<field_diff> diffs;
		auto note_diff = [&](const char *name, s64 actual_value, s64 expected_value)
		{
			if (actual_value != expected_value)
				diffs.push_back({ name, actual_value, expected_value });
		};

		note_diff("sound_updates", actual.sound_updates, expect.sound_updates);
		note_diff("pc", actual.pc, expect.pc);
		note_diff("ca", actual.ca, expect.ca);
		note_diff("id", actual.id, expect.id);
		note_diff("ba0", actual.ba0, expect.ba0);
		note_diff("ba1", actual.ba1, expect.ba1);
		note_diff("st1", actual.st1, expect.st1);
		note_diff("aacc", actual.aacc, expect.aacc);
		note_diff("macc", s64(actual.macc), s64(expect.macc));
		note_diff("maccr", s64(actual.macc_read), s64(expect.macc_read));
		note_diff("maccw", s64(actual.macc_write), s64(expect.macc_write));
		note_diff("creg", actual.creg, expect.creg);
		note_diff("xoa", actual.xoa, expect.xoa);
		note_diff("xba", actual.xba, expect.xba);
		note_diff("xrd", actual.xrd, expect.xrd);
		note_diff("txrd", actual.txrd, expect.txrd);
		note_diff("xwr", actual.xwr, expect.xwr);
		note_diff("si0", actual.si[0], expect.si[0]);
		note_diff("si1", actual.si[1], expect.si[1]);
		note_diff("so0", actual.so[0], expect.so[0]);
		note_diff("so1", actual.so[1], expect.so[1]);
		note_diff("l53", actual.dmem0[(actual.ba0 + 0x53) & 0xff], expect.dmem0[(expect.ba0 + 0x53) & 0xff]);
		note_diff("l54", actual.dmem0[(actual.ba0 + 0x54) & 0xff], expect.dmem0[(expect.ba0 + 0x54) & 0xff]);
		note_diff("l55", actual.dmem0[(actual.ba0 + 0x55) & 0xff], expect.dmem0[(expect.ba0 + 0x55) & 0xff]);
		note_diff("l56", actual.dmem0[(actual.ba0 + 0x56) & 0xff], expect.dmem0[(expect.ba0 + 0x56) & 0xff]);
		note_diff("l57", actual.dmem0[(actual.ba0 + 0x57) & 0xff], expect.dmem0[(expect.ba0 + 0x57) & 0xff]);
		note_diff("c00", actual.cmem[0x00], expect.cmem[0x00]);
		note_diff("c37", actual.cmem[0x37], expect.cmem[0x37]);
		note_diff("c42", actual.cmem[0x42], expect.cmem[0x42]);

		u32 first_ram_diff = 0xffffffffU;
		u8 actual_ram = 0;
		u8 expected_ram = 0;
		for (u32 addr = 0; addr < expect_ram.size(); addr++)
		{
			const u8 have = m_dsp->space(AS_DATA).read_byte(addr);
			const u8 want = expect_ram[addr];
			if (have != want)
			{
				first_ram_diff = addr;
				actual_ram = have;
				expected_ram = want;
				break;
			}
		}

		if (diffs.empty() && first_ram_diff == 0xffffffffU)
		{
			osd_printf_info("INFO dsp3 a02 tapeboundary su=%llu exact_to_next cycles=%d\n", (unsigned long long)su, kCyclesPerSample);
			return;
		}

		osd_printf_info("INFO dsp3 a02 tapeboundary su=%llu mismatches=%zu cycles=%d\n", (unsigned long long)su, diffs.size(), kCyclesPerSample);
		for (const auto &diff : diffs)
		{
			osd_printf_info(
				"INFO dsp3 a02 tapeboundary su=%llu field=%s actual=%016llx expect=%016llx\n",
				(unsigned long long)su,
				diff.name,
				(unsigned long long)diff.actual,
				(unsigned long long)diff.expect);
		}
		if (first_ram_diff != 0xffffffffU)
		{
			osd_printf_info(
				"INFO dsp3 a02 tapeboundary su=%llu ramdiff=%05x actual=%02x expect=%02x\n",
				(unsigned long long)su,
				first_ram_diff,
				actual_ram,
				expected_ram);
		}
	};

	for (u64 su = 480003; su <= 480005; su++)
		compare_and_log(su);
}

void tms57002test_state::probe_dsp3_a02_onset_boundary_replay()
{
	static constexpr char kProgramPath[] = "tmp/kprop_current_dump_2s/cur_dsp3.bin";
	static constexpr char kLogPath[] = "tmp/kprop_a02_onset_92847_92853/dspsnap.log";
	static constexpr char kRamDir[] = "tmp/kprop_a02_onset_92847_92853/ram";
	const char *program_path = kProgramPath;
	const char *log_path = kLogPath;
	const char *ram_dir = kRamDir;
	if (const char *env = std::getenv("TMS57TEST_ONSET_PROGRAM_PATH"))
		program_path = env;
	if (const char *env = std::getenv("TMS57TEST_ONSET_LOG_PATH"))
		log_path = env;
	if (const char *env = std::getenv("TMS57TEST_ONSET_RAM_DIR"))
		ram_dir = env;
	u64 start_su = 92851;
	if (const char *env = std::getenv("TMS57TEST_ONSET_SU"))
		start_su = parse_dec_u64(env);
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(program_path);
	const std::vector<std::string> lines = load_text_lines(log_path);
	const tms57002_device::debug_snapshot start = load_snapshot_for_su_from_lines(lines, start_su);
	const tms57002_device::debug_snapshot expect = load_snapshot_for_su_from_lines(lines, start_su + 1);
	const std::string start_ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", ram_dir, (unsigned long long)start_su);
	const std::string expect_ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", ram_dir, (unsigned long long)(start_su + 1));

