joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	std::ifstream expect_ram_input(expect_ram_path, std::ios::binary);
	if (!expect_ram_input)
		throw emu_fatalerror("Unable to open %s", expect_ram_path);
	const std::vector<u8> expect_ram((std::istreambuf_iterator<char>(expect_ram_input)), std::istreambuf_iterator<char>());

	m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
	load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
	m_dsp->debug_restore_snapshot(start);
	for (int steps = 0; steps < kCyclesPerSample; steps++)
		m_dsp->debug_run_cycles(1);
	m_dsp->debug_begin_sample_frame(expect.serial_input_frame);

	const tms57002_device::debug_snapshot actual = m_dsp->debug_capture_snapshot();

	auto logical0 = [](const tms57002_device::debug_snapshot &snapshot, u8 logical) -> u32
	{
		return snapshot.dmem0[(snapshot.ba0 + logical) & 0xff];
	};

	osd_printf_info(
		"INFO dsp3 onset boundary su=%llu->%llu actual so=%06x/%06x macc=%013llx aacc=%08x ba0=%02x st1=%06x "
		"expect so=%06x/%06x macc=%013llx aacc=%08x ba0=%02x st1=%06x\n",
		(unsigned long long)start_su,
		(unsigned long long)(start_su + 1),
		actual.so[0],
		actual.so[1],
		(unsigned long long)actual.macc,
		actual.aacc,
		actual.ba0,
		actual.st1,
		expect.so[0],
		expect.so[1],
		(unsigned long long)expect.macc,
		expect.aacc,
		expect.ba0,
		expect.st1);

	for (const u8 logical : { u8(0x02), u8(0x1f), u8(0x3a), u8(0x56) })
	{
		osd_printf_info(
			"INFO dsp3 onset boundary logical L%02X actual=%06x expect=%06x\n",
			logical,
			logical0(actual, logical),
			logical0(expect, logical));
	}

	for (const u8 cmem_addr : { u8(0x13), u8(0x23), u8(0x38), u8(0x3a), u8(0x3c), u8(0x3d), u8(0x42), u8(0xa4), u8(0xc0), u8(0xc1) })
	{
		osd_printf_info(
			"INFO dsp3 onset boundary cmem C%02X actual=%08x expect=%08x\n",
			cmem_addr,
			actual.cmem[cmem_addr],
			expect.cmem[cmem_addr]);
	}

	u32 first_ram_diff = 0xffffffffU;
	u8 actual_ram = 0;
	u8 expected_ram = 0;
	for (u32 addr = 0; addr < expect_ram.size(); addr++)
	{
		const u8 have = m_dsp->space(AS_DATA).read_byte(addr);
		const u8 want = expect_ram[addr];
		if (have != want)
		{
			first_ram_diff = addr;
			actual_ram = have;
			expected_ram = want;
			break;
		}
	}

	if (first_ram_diff == 0xffffffffU)
		osd_printf_info("INFO dsp3 onset boundary ram exact\n");
	else
		osd_printf_info("INFO dsp3 onset boundary ramdiff=%05x actual=%02x expect=%02x\n", first_ram_diff, actual_ram, expected_ram);

	check_equal("dsp3 onset boundary sound_updates", s64(actual.sound_updates), s64(expect.sound_updates));
	check_equal("dsp3 onset boundary pc", s64(actual.pc), s64(expect.pc));
	check_equal("dsp3 onset boundary ca", s64(actual.ca), s64(expect.ca));
	check_equal("dsp3 onset boundary id", s64(actual.id), s64(expect.id));
	check_equal("dsp3 onset boundary ba0", s64(actual.ba0), s64(expect.ba0));
	check_equal("dsp3 onset boundary ba1", s64(actual.ba1), s64(expect.ba1));
	check_equal("dsp3 onset boundary st1", s64(actual.st1), s64(expect.st1));
	check_equal("dsp3 onset boundary aacc", s64(actual.aacc), s64(expect.aacc));
	check_equal("dsp3 onset boundary macc", s64(actual.macc), s64(expect.macc));
	check_equal("dsp3 onset boundary so0", s64(actual.so[0]), s64(expect.so[0]));
	check_equal("dsp3 onset boundary so1", s64(actual.so[1]), s64(expect.so[1]));
	check_equal("dsp3 onset boundary ram", s64(first_ram_diff), s64(0xffffffffU));

	m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
	load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
	m_dsp->debug_restore_snapshot(start);

	bool saw_so0_clip = false;
	for (int step = 0; step < kCyclesPerSample; step++)
	{
		const tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
		m_dsp->debug_run_cycles(1);
		const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();

			const bool key_chain =
				pre.pc == 0x3c || pre.pc == 0x68 || pre.pc == 0x6a ||
				pre.pc == 0x93 || pre.pc == 0xa8 || pre.pc == 0xb6;
			const bool d3a_seed = pre.pc >= 0x6e && pre.pc <= 0x93;
			const bool d56_seed = pre.pc >= 0x9c && pre.pc <= 0xa8;
			const bool d56_producer = pre.pc >= 0xa9 && pre.pc <= 0xb6;
			const bool d4b_producer = pre.pc >= 0xc1 && pre.pc <= 0xd3;
			const bool final_mix = pre.pc >= 0xe9;
			const bool so_change = pre.so != post.so;
			if (!key_chain && !d3a_seed && !d56_seed && !d56_producer && !d4b_producer && !final_mix && !so_change)
				continue;

		if (key_chain)
		{
			osd_printf_info(
				"INFO dsp3 onset scan step=%03d pc=%02x raw=%08x macc=%013llx->%013llx aacc=%08x->%08x "
				"L02=%06x->%06x L1F=%06x->%06x L3A=%06x->%06x L56=%06x->%06x so=%06x/%06x->%06x/%06x\n",
				step,
				pre.pc,
				pre.pc < program.size() ? program[pre.pc] : 0,
				(unsigned long long)pre.macc,
				(unsigned long long)post.macc,
				pre.aacc,
				post.aacc,
				logical0(pre, 0x02),
				logical0(post, 0x02),
				logical0(pre, 0x1f),
				logical0(post, 0x1f),
				logical0(pre, 0x3a),
				logical0(post, 0x3a),
				logical0(pre, 0x56),
				logical0(post, 0x56),
				pre.so[0],
				pre.so[1],
					post.so[0],
					post.so[1]);
			}

			if (d3a_seed)
			{
				osd_printf_info(
					"INFO dsp3 onset d3aseed step=%03d pc=%02x raw=%08x ca=%02x id=%02x xoa=%05x xba=%05x xrd=%06x xwr=%06x "
					"macc=%013llx->%013llx aacc=%08x->%08x st1=%06x->%06x maccr=%013llx->%013llx maccw=%013llx->%013llx creg=%08x->%08x "
					"L00=%06x->%06x L01=%06x L02=%06x L1F=%06x L30=%06x->%06x L31=%06x L32=%06x->%06x L33=%06x L34=%06x->%06x L35=%06x "
					"L36=%06x->%06x L37=%06x L38=%06x->%06x L39=%06x L3A=%06x->%06x L3C=%06x L3D=%06x LA7=%06x->%06x LA8=%06x "
					"C00=%08x C02=%08x C30=%08x C31=%08x C32=%08x C33=%08x C34=%08x C35=%08x C36=%08x C37=%08x C38=%08x "
					"C39=%08x->%08x C3A=%08x->%08x C3C=%08x->%08x C3D=%08x->%08x CA2=%08x CA3=%08x so=%06x/%06x->%06x/%06x\n",
					step,
					pre.pc,
					pre.pc < program.size() ? program[pre.pc] : 0,
					pre.ca,
					pre.id,
					pre.xoa,
					pre.xba,
					pre.xrd,
					pre.xwr,
					(unsigned long long)pre.macc,
					(unsigned long long)post.macc,
					pre.aacc,
					post.aacc,
					pre.st1,
					post.st1,
					(unsigned long long)pre.macc_read,
					(unsigned long long)post.macc_read,
					(unsigned long long)pre.macc_write,
					(unsigned long long)post.macc_write,
					pre.creg,
					post.creg,
					logical0(pre, 0x00),
					logical0(post, 0x00),
					logical0(pre, 0x01),
					logical0(pre, 0x02),
					logical0(pre, 0x1f),
					logical0(pre, 0x30),
					logical0(post, 0x30),
					logical0(pre, 0x31),
					logical0(pre, 0x32),
					logical0(post, 0x32),
					logical0(pre, 0x33),
					logical0(pre, 0x34),
					logical0(post, 0x34),
					logical0(pre, 0x35),
					logical0(pre, 0x36),
					logical0(post, 0x36),
					logical0(pre, 0x37),
					logical0(pre, 0x38),
					logical0(post, 0x38),
					logical0(pre, 0x39),
					logical0(pre, 0x3a),
					logical0(post, 0x3a),
					logical0(pre, 0x3c),
					logical0(pre, 0x3d),
					logical0(pre, 0xa7),
					logical0(post, 0xa7),
					logical0(pre, 0xa8),
					pre.cmem[0x00],
					pre.cmem[0x02],
					pre.cmem[0x30],
					pre.cmem[0x31],
					pre.cmem[0x32],
					pre.cmem[0x33],
					pre.cmem[0x34],
					pre.cmem[0x35],
					pre.cmem[0x36],
					pre.cmem[0x37],
					pre.cmem[0x38],
					pre.cmem[0x39],
					post.cmem[0x39],
					pre.cmem[0x3a],
					post.cmem[0x3a],
					pre.cmem[0x3c],
					post.cmem[0x3c],
					pre.cmem[0x3d],
					post.cmem[0x3d],
					pre.cmem[0xa2],
					pre.cmem[0xa3],
					pre.so[0],
					pre.so[1],
					post.so[0],
					post.so[1]);
			}

			if (d56_seed)
			{
				osd_printf_info(
					"INFO dsp3 onset d56seed step=%03d pc=%02x raw=%08x ca=%02x id=%02x xoa=%05x xba=%05x xrd=%06x xwr=%06x "
					"macc=%013llx->%013llx aacc=%08x->%08x st1=%06x->%06x maccr=%013llx->%013llx maccw=%013llx->%013llx creg=%08x->%08x "
					"L00=%06x->%06x L01=%06x->%06x L02=%06x L3A=%06x L50=%06x->%06x L51=%06x L52=%06x L53=%06x L54=%06x L55=%06x L56=%06x "
					"LA4=%06x LA9=%06x LAA=%06x C00=%08x C02=%08x C0C=%08x CA4=%08x CA9=%08x CAA=%08x so=%06x/%06x->%06x/%06x\n",
					step,
					pre.pc,
					pre.pc < program.size() ? program[pre.pc] : 0,
					pre.ca,
					pre.id,
					pre.xoa,
					pre.xba,
					pre.xrd,
					pre.xwr,
					(unsigned long long)pre.macc,
					(unsigned long long)post.macc,
					pre.aacc,
					post.aacc,
					pre.st1,
					post.st1,
					(unsigned long long)pre.macc_read,
					(unsigned long long)post.macc_read,
					(unsigned long long)pre.macc_write,
					(unsigned long long)post.macc_write,
					pre.creg,
					post.creg,
					logical0(pre, 0x00),
					logical0(post, 0x00),
					logical0(pre, 0x01),
					logical0(post, 0x01),
					logical0(pre, 0x02),
					logical0(pre, 0x3a),
					logical0(pre, 0x50),
					logical0(post, 0x50),
					logical0(pre, 0x51),
					logical0(pre, 0x52),
					logical0(pre, 0x53),
					logical0(pre, 0x54),
					logical0(pre, 0x55),
					logical0(pre, 0x56),
					logical0(pre, 0xa4),
					logical0(pre, 0xa9),
					logical0(pre, 0xaa),
					pre.cmem[0x00],
					pre.cmem[0x02],
					pre.cmem[0x0c],
					pre.cmem[0xa4],
					pre.cmem[0xa9],
					pre.cmem[0xaa],
					pre.so[0],
					pre.so[1],
					post.so[0],
					post.so[1]);
			}

			if (d56_producer)
			{
				osd_printf_info(
					"INFO dsp3 onset d56prod step=%03d pc=%02x raw=%08x ca=%02x id=%02x "
					"macc=%013llx->%013llx aacc=%08x->%08x st1=%06x->%06x maccr=%013llx->%013llx maccw=%013llx->%013llx "
					"L50=%06x L51=%06x L52=%06x L53=%06x->%06x L54=%06x L55=%06x L56=%06x->%06x L57=%06x L58=%06x "
					"C50=%08x C51=%08x C52=%08x C53=%08x C54=%08x C55=%08x C56=%08x C57=%08x C58=%08x so=%06x/%06x->%06x/%06x\n",
					step,
					pre.pc,
					pre.pc < program.size() ? program[pre.pc] : 0,
					pre.ca,
					pre.id,
					(unsigned long long)pre.macc,
					(unsigned long long)post.macc,
					pre.aacc,
					post.aacc,
					pre.st1,
					post.st1,
					(unsigned long long)pre.macc_read,
					(unsigned long long)post.macc_read,
					(unsigned long long)pre.macc_write,
					(unsigned long long)post.macc_write,
					logical0(pre, 0x50),
					logical0(pre, 0x51),
					logical0(pre, 0x52),
					logical0(pre, 0x53),
					logical0(post, 0x53),
					logical0(pre, 0x54),
					logical0(pre, 0x55),
					logical0(pre, 0x56),
					logical0(post, 0x56),
					logical0(pre, 0x57),
					logical0(pre, 0x58),
					pre.cmem[0x50],
					pre.cmem[0x51],
					pre.cmem[0x52],
					pre.cmem[0x53],
					pre.cmem[0x54],
					pre.cmem[0x55],
					pre.cmem[0x56],
					pre.cmem[0x57],
					pre.cmem[0x58],
					pre.so[0],
					pre.so[1],
					post.so[0],
					post.so[1]);
			}

			if (d4b_producer)
			{
				osd_printf_info(
					"INFO dsp3 onset d4bprod step=%03d pc=%02x raw=%08x ca=%02x id=%02x xoa=%05x xba=%05x xrd=%06x xwr=%06x "
					"macc=%013llx->%013llx aacc=%08x->%08x st1=%06x->%06x maccr=%013llx->%013llx maccw=%013llx->%013llx "
					"L40=%06x L41=%06x L45=%06x->%06x L46=%06x->%06x L47=%06x->%06x L4B=%06x->%06x "
					"C44=%08x C45=%08x C46=%08x C47=%08x C48=%08x C49=%08x so=%06x/%06x->%06x/%06x\n",
					step,
					pre.pc,
					pre.pc < program.size() ? program[pre.pc] : 0,
					pre.ca,
					pre.id,
					pre.xoa,
					pre.xba,
					pre.xrd,
					pre.xwr,
					(unsigned long long)pre.macc,
					(unsigned long long)post.macc,
					pre.aacc,
					post.aacc,
					pre.st1,
					post.st1,
					(unsigned long long)pre.macc_read,
					(unsigned long long)post.macc_read,
					(unsigned long long)pre.macc_write,
					(unsigned long long)post.macc_write,
					logical0(pre, 0x40),
					logical0(pre, 0x41),
					logical0(pre, 0x45),
					logical0(post, 0x45),
					logical0(pre, 0x46),
					logical0(post, 0x46),
					logical0(pre, 0x47),
					logical0(post, 0x47),
					logical0(pre, 0x4b),
					logical0(post, 0x4b),
					pre.cmem[0x44],
					pre.cmem[0x45],
					pre.cmem[0x46],
					pre.cmem[0x47],
					pre.cmem[0x48],
					pre.cmem[0x49],
					pre.so[0],
					pre.so[1],
					post.so[0],
					post.so[1]);
			}

			if (final_mix || so_change)
			{
			osd_printf_info(
				"INFO dsp3 onset mix step=%03d pc=%02x raw=%08x macc=%013llx->%013llx aacc=%08x->%08x st1=%06x->%06x "
				"maccr=%013llx->%013llx maccw=%013llx->%013llx "
				"L06=%06x L07=%06x L09=%06x L0A=%06x L0B=%06x L4D=%06x L59=%06x L5A=%06x L5B=%06x L5D=%06x L5E=%06x L5F=%06x "
				"C02=%08x C4A=%08x C64=%08x CC0=%08x CC1=%08x so=%06x/%06x->%06x/%06x\n",
				step,
				pre.pc,
				pre.pc < program.size() ? program[pre.pc] : 0,
				(unsigned long long)pre.macc,
				(unsigned long long)post.macc,
				pre.aacc,
				post.aacc,
				pre.st1,
				post.st1,
				(unsigned long long)pre.macc_read,
				(unsigned long long)post.macc_read,
				(unsigned long long)pre.macc_write,
				(unsigned long long)post.macc_write,
				logical0(pre, 0x06),
				logical0(pre, 0x07),
				logical0(pre, 0x09),
				logical0(pre, 0x0a),
				logical0(pre, 0x0b),
				logical0(pre, 0x4d),
				logical0(pre, 0x59),
				logical0(pre, 0x5a),
				logical0(pre, 0x5b),
				logical0(pre, 0x5d),
				logical0(pre, 0x5e),
				logical0(pre, 0x5f),
				pre.cmem[0x02],
				pre.cmem[0x4a],
				pre.cmem[0x64],
				pre.cmem[0xc0],
				pre.cmem[0xc1],
				pre.so[0],
				pre.so[1],
				post.so[0],
				post.so[1]);
		}

		if (!saw_so0_clip && post.so[0] == 0x7fffff)
		{
			saw_so0_clip = true;
			osd_printf_info(
				"INFO dsp3 onset first so0 clip at step=%03d pc=%02x raw=%08x pre_macc=%013llx post_macc=%013llx so=%06x->%06x\n",
				step,
				pre.pc,
				pre.pc < program.size() ? program[pre.pc] : 0,
				(unsigned long long)pre.macc,
				(unsigned long long)post.macc,
				pre.so[0],
				post.so[0]);
		}
	}

