joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	if (start_su > 92847)
	{
		auto capture_second_pcfc = [&](u64 su) -> tms57002_device::debug_snapshot
		{
			const tms57002_device::debug_snapshot seed = load_snapshot_for_su_from_lines(lines, su);
			const std::string ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", ram_dir, (unsigned long long)su);
			m_dsp->debug_load_program(program.data(), u32(program.size()), seed.st0, seed.st1);
			load_data_space_bytes(ram_path.c_str(), m_dsp->space(AS_DATA));
			m_dsp->debug_restore_snapshot(seed);

			tms57002_device::debug_snapshot found;
			int hits = 0;
			for (int step = 0; step < kCyclesPerSample; step++)
			{
				const tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
				if (pre.pc == 0xfc)
				{
					found = pre;
					hits++;
				}
				m_dsp->debug_run_cycles(1);
			}
			if (hits < 2)
				throw emu_fatalerror("Unable to find second PC=FC for SU=%llu", (unsigned long long)su);
			return found;
		};

		const tms57002_device::debug_snapshot prev_pcfc = capture_second_pcfc(start_su - 1);
		const tms57002_device::debug_snapshot cur_pcfc = capture_second_pcfc(start_su);
		const u32 prev_l09 = logical0(prev_pcfc, 0x09);
		const u32 cur_l09 = logical0(cur_pcfc, 0x09);
		const u32 prev_c0 = prev_pcfc.cmem[0xc0];
		const u32 cur_c0 = cur_pcfc.cmem[0xc0];

		auto run_pcfc_variant = [&](const char *label, bool patch_l09, bool patch_c0) -> void
		{
			m_dsp->debug_load_program(program.data(), u32(program.size()), cur_pcfc.st0, cur_pcfc.st1);
			m_dsp->debug_restore_snapshot(cur_pcfc);
			if (patch_l09)
				m_dsp->debug_write_dmem0((cur_pcfc.ba0 + 0x09) & 0xff, prev_l09);
			if (patch_c0)
				m_dsp->debug_write_cmem(0xc0, prev_c0);

			const tms57002_device::debug_snapshot before_fc = m_dsp->debug_capture_snapshot();
			m_dsp->debug_run_cycles(1);
			const tms57002_device::debug_snapshot after_fc = m_dsp->debug_capture_snapshot();
			m_dsp->debug_run_cycles(1);
			const tms57002_device::debug_snapshot after_fd = m_dsp->debug_capture_snapshot();
			m_dsp->debug_run_cycles(1);
			const tms57002_device::debug_snapshot after_fe = m_dsp->debug_capture_snapshot();
			m_dsp->debug_run_cycles(1);
			const tms57002_device::debug_snapshot after_ff = m_dsp->debug_capture_snapshot();

			osd_printf_info(
				"INFO dsp3 onset pcfc variant label=%s l09=%06x c0=%08x fc_macc=%013llx fd_macc=%013llx "
				"fe_maccr=%013llx so_after_fe=%06x/%06x so_after_ff=%06x/%06x st1_after_fe=%06x\n",
				label,
				logical0(before_fc, 0x09),
				before_fc.cmem[0xc0],
				(unsigned long long)after_fc.macc,
				(unsigned long long)after_fd.macc,
				(unsigned long long)after_fe.macc_read,
				after_fe.so[0],
				after_fe.so[1],
				after_ff.so[0],
				after_ff.so[1],
				after_fe.st1);
		};

		osd_printf_info(
			"INFO dsp3 onset pcfc compare prev_su=%llu cur_su=%llu prev_l09=%06x cur_l09=%06x prev_c0=%08x cur_c0=%08x\n",
			(unsigned long long)(start_su - 1),
			(unsigned long long)start_su,
			prev_l09,
			cur_l09,
			prev_c0,
			cur_c0);
		run_pcfc_variant("cur", false, false);
		run_pcfc_variant("prev_l09", true, false);
		run_pcfc_variant("prev_c0", false, true);
		run_pcfc_variant("prev_l09_prev_c0", true, true);

		auto capture_second_pc = [&](u64 su, u8 target_pc) -> tms57002_device::debug_snapshot
		{
			const tms57002_device::debug_snapshot seed = load_snapshot_for_su_from_lines(lines, su);
			const std::string ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", ram_dir, (unsigned long long)su);
			m_dsp->debug_load_program(program.data(), u32(program.size()), seed.st0, seed.st1);
			load_data_space_bytes(ram_path.c_str(), m_dsp->space(AS_DATA));
			m_dsp->debug_restore_snapshot(seed);

			tms57002_device::debug_snapshot found;
			int hits = 0;
			for (int step = 0; step < kCyclesPerSample; step++)
			{
				const tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
				if (pre.pc == target_pc)
				{
					found = pre;
					hits++;
				}
				m_dsp->debug_run_cycles(1);
			}
			if (hits < 2)
				throw emu_fatalerror("Unable to find second PC=%02x for SU=%llu", target_pc, (unsigned long long)su);
			return found;
		};

		const tms57002_device::debug_snapshot prev_pced = capture_second_pc(start_su - 1, 0xed);
		const tms57002_device::debug_snapshot cur_pced = capture_second_pc(start_su, 0xed);
		const u32 prev_l0b = logical0(prev_pced, 0x0b);
		const u32 cur_l0b = logical0(cur_pced, 0x0b);

		auto run_pced_variant = [&](const char *label, bool patch_aacc, bool patch_l0b) -> void
		{
			m_dsp->debug_load_program(program.data(), u32(program.size()), cur_pced.st0, cur_pced.st1);
			m_dsp->debug_restore_snapshot(cur_pced);
			if (patch_aacc)
				m_dsp->debug_set_accumulators(prev_pced.aacc, cur_pced.macc, cur_pced.macc_read, cur_pced.macc_write, cur_pced.creg);
			if (patch_l0b)
				m_dsp->debug_write_dmem0((cur_pced.ba0 + 0x0b) & 0xff, prev_l0b);

			tms57002_device::debug_snapshot before_fc;
			tms57002_device::debug_snapshot after_fc;
			tms57002_device::debug_snapshot after_fe;
			tms57002_device::debug_snapshot after_ff;
			bool saw_fc = false;
			bool saw_fe = false;
			bool saw_ff = false;
			for (int step = 0; step < 32; step++)
			{
				const tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
				m_dsp->debug_run_cycles(1);
				const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();
				if (pre.pc == 0xfc)
				{
					before_fc = pre;
					after_fc = post;
					saw_fc = true;
				}
				else if (pre.pc == 0xfe)
				{
					after_fe = post;
					saw_fe = true;
				}
				else if (pre.pc == 0xff)
				{
					after_ff = post;
					saw_ff = true;
					break;
				}
			}
			if (!saw_fc || !saw_fe || !saw_ff)
				throw emu_fatalerror("PC=ED variant %s did not reach final mix", label);

			osd_printf_info(
				"INFO dsp3 onset pced variant label=%s aacc=%08x l0b=%06x l09_at_fc=%06x fc_macc=%013llx "
				"fe_maccr=%013llx so_after_fe=%06x/%06x so_after_ff=%06x/%06x\n",
				label,
				patch_aacc ? prev_pced.aacc : cur_pced.aacc,
				patch_l0b ? prev_l0b : cur_l0b,
				logical0(before_fc, 0x09),
				(unsigned long long)after_fc.macc,
				(unsigned long long)after_fe.macc_read,
				after_fe.so[0],
				after_fe.so[1],
				after_ff.so[0],
				after_ff.so[1]);
		};

		osd_printf_info(
			"INFO dsp3 onset pced compare prev_su=%llu cur_su=%llu prev_aacc=%08x cur_aacc=%08x prev_l0b=%06x cur_l0b=%06x c02=%08x c64=%08x\n",
			(unsigned long long)(start_su - 1),
			(unsigned long long)start_su,
			prev_pced.aacc,
			cur_pced.aacc,
			prev_l0b,
			cur_l0b,
			cur_pced.cmem[0x02],
			cur_pced.cmem[0x64]);
		run_pced_variant("cur", false, false);
		run_pced_variant("prev_aacc", true, false);
		run_pced_variant("prev_l0b", false, true);
		run_pced_variant("prev_aacc_prev_l0b", true, true);

