joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
			auto capture_nth_pc = [&](u64 su, u8 target_pc, int wanted_hit) -> tms57002_device::debug_snapshot
			{
				const tms57002_device::debug_snapshot seed = load_snapshot_for_su_from_lines(lines, su);
				const std::string ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", ram_dir, (unsigned long long)su);
				m_dsp->debug_load_program(program.data(), u32(program.size()), seed.st0, seed.st1);
			load_data_space_bytes(ram_path.c_str(), m_dsp->space(AS_DATA));
			m_dsp->debug_restore_snapshot(seed);

			int hits = 0;
			for (int step = 0; step < kCyclesPerSample; step++)
			{
				const tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
				if (pre.pc == target_pc)
				{
					hits++;
					if (hits == wanted_hit)
						return pre;
				}
				m_dsp->debug_run_cycles(1);
				}
				throw emu_fatalerror("Unable to find PC=%02x hit=%d for SU=%llu", target_pc, wanted_hit, (unsigned long long)su);
			};

			struct final_loop_summary
			{
				int step_e9 = -1;
				tms57002_device::debug_snapshot before_e9;
				tms57002_device::debug_snapshot after_ea;
				tms57002_device::debug_snapshot before_eb;
				tms57002_device::debug_snapshot after_eb;
				tms57002_device::debug_snapshot after_ec;
				tms57002_device::debug_snapshot after_ed;
				tms57002_device::debug_snapshot after_ee;
				tms57002_device::debug_snapshot after_f0;
				tms57002_device::debug_snapshot before_fc;
				tms57002_device::debug_snapshot after_fc;
				tms57002_device::debug_snapshot after_fe;
				tms57002_device::debug_snapshot after_ff;
			};

			auto capture_final_loop_summary = [&](u64 su, int wanted_hit) -> final_loop_summary
			{
				const tms57002_device::debug_snapshot seed = load_snapshot_for_su_from_lines(lines, su);
				const std::string ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", ram_dir, (unsigned long long)su);
				m_dsp->debug_load_program(program.data(), u32(program.size()), seed.st0, seed.st1);
				load_data_space_bytes(ram_path.c_str(), m_dsp->space(AS_DATA));
				m_dsp->debug_restore_snapshot(seed);

				final_loop_summary out;
				bool armed = false;
				bool saw_after_ea = false;
				bool saw_before_eb = false;
				bool saw_after_ec = false;
				bool saw_after_ed = false;
				bool saw_after_ee = false;
				bool saw_after_f0 = false;
				bool saw_fc = false;
				bool saw_fe = false;
				bool saw_ff = false;
				int hits = 0;
				for (int step = 0; step < kCyclesPerSample; step++)
				{
					const tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
					if (pre.pc == 0xe9)
					{
						hits++;
						if (hits == wanted_hit)
						{
							armed = true;
							out.step_e9 = step;
							out.before_e9 = pre;
						}
					}

					m_dsp->debug_run_cycles(1);
					const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();
					if (!armed)
						continue;

					if (pre.pc == 0xea)
					{
						out.after_ea = post;
						saw_after_ea = true;
					}
					else if (pre.pc == 0xeb)
					{
						out.before_eb = pre;
						out.after_eb = post;
						saw_before_eb = true;
					}
					else if (pre.pc == 0xec)
					{
						out.after_ec = post;
						saw_after_ec = true;
					}
					else if (pre.pc == 0xed)
					{
						out.after_ed = post;
						saw_after_ed = true;
					}
					else if (pre.pc == 0xee)
					{
						out.after_ee = post;
						saw_after_ee = true;
					}
					else if (pre.pc == 0xf0)
					{
						out.after_f0 = post;
						saw_after_f0 = true;
					}
					else if (pre.pc == 0xfc)
					{
						out.before_fc = pre;
						out.after_fc = post;
						saw_fc = true;
					}
					else if (pre.pc == 0xfe)
					{
						out.after_fe = post;
						saw_fe = true;
					}
					else if (pre.pc == 0xff)
					{
						out.after_ff = post;
						saw_ff = true;
						break;
					}
				}

				if (!armed || !saw_after_ea || !saw_before_eb || !saw_after_ec || !saw_after_ed || !saw_after_ee || !saw_after_f0 || !saw_fc || !saw_fe || !saw_ff)
					throw emu_fatalerror("Unable to summarize final loop hit=%d for SU=%llu", wanted_hit, (unsigned long long)su);

				return out;
			};

			auto log_final_loop_summary = [&](u64 su, int wanted_hit) -> void
			{
				const final_loop_summary summary = capture_final_loop_summary(su, wanted_hit);
				osd_printf_info(
					"INFO dsp3 onset loophist su=%llu hit=%d step_e9=%03d ba0=%02x phys_l0a=%02x phys_l09=%02x "
					"d06_e9=%06x d07_e9=%06x aacc_after_ea=%08x l0a_eb=%06x eb_creg=%08x eb_macc=%013llx "
					"after_ec_creg=%08x c02=%08x c64=%08x ed_macc=%013llx l0b_after_ee=%06x ee_macc=%013llx "
					"l09_after_f0=%06x l09_at_fc=%06x l5d_at_fc=%06x fc_macc=%013llx so_fe=%06x/%06x so_ff=%06x/%06x\n",
					(unsigned long long)su,
					wanted_hit,
					summary.step_e9,
					summary.before_eb.ba0,
					(summary.before_eb.ba0 + 0x0a) & 0xff,
					(summary.before_fc.ba0 + 0x09) & 0xff,
					logical0(summary.before_e9, 0x06),
					logical0(summary.before_e9, 0x07),
					summary.after_ea.aacc,
					logical0(summary.before_eb, 0x0a),
					summary.before_eb.creg,
					(unsigned long long)summary.after_eb.macc,
					summary.after_ec.creg,
					summary.before_eb.cmem[0x02],
					summary.before_eb.cmem[0x64],
					(unsigned long long)summary.after_ed.macc,
					logical0(summary.after_ee, 0x0b),
					(unsigned long long)summary.after_ee.macc,
					logical0(summary.after_f0, 0x09),
					logical0(summary.before_fc, 0x09),
					logical0(summary.before_fc, 0x5d),
					(unsigned long long)summary.after_fc.macc,
					summary.after_fe.so[0],
					summary.after_fe.so[1],
					summary.after_ff.so[0],
					summary.after_ff.so[1]);
			};

			const u64 first_history_su = start_su > 92851 ? start_su - 4 : 92847;
				for (u64 su = first_history_su; su <= start_su; su++)
				{
					log_final_loop_summary(su, 1);
					log_final_loop_summary(su, 2);
				}

				struct producer_summary
				{
					int step_b5 = -1;
					int step_e4 = -1;
					tms57002_device::debug_snapshot before_b5;
					tms57002_device::debug_snapshot after_b6;
					tms57002_device::debug_snapshot after_b8;
					tms57002_device::debug_snapshot before_ba;
					tms57002_device::debug_snapshot after_ba;
					tms57002_device::debug_snapshot after_bb;
					tms57002_device::debug_snapshot after_bc;
					tms57002_device::debug_snapshot before_e4;
					tms57002_device::debug_snapshot after_e5;
					tms57002_device::debug_snapshot before_e6;
					tms57002_device::debug_snapshot after_e6;
					tms57002_device::debug_snapshot after_e7;
					tms57002_device::debug_snapshot after_e8;
					tms57002_device::debug_snapshot after_ea;
					tms57002_device::debug_snapshot before_eb;
					tms57002_device::debug_snapshot after_f0;
					tms57002_device::debug_snapshot before_fc;
					tms57002_device::debug_snapshot after_fc;
					tms57002_device::debug_snapshot after_fe;
					tms57002_device::debug_snapshot after_ff;
				};

				auto capture_producer_summary = [&](u64 su, int wanted_hit) -> producer_summary
				{
					const tms57002_device::debug_snapshot seed = load_snapshot_for_su_from_lines(lines, su);
					const std::string ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", ram_dir, (unsigned long long)su);
					m_dsp->debug_load_program(program.data(), u32(program.size()), seed.st0, seed.st1);
					load_data_space_bytes(ram_path.c_str(), m_dsp->space(AS_DATA));
					m_dsp->debug_restore_snapshot(seed);

