joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
					producer_summary out;
					bool armed_b = false;
					bool armed_e = false;
					bool saw_after_b6 = false;
					bool saw_after_b8 = false;
					bool saw_before_ba = false;
					bool saw_after_ba = false;
					bool saw_after_bb = false;
					bool saw_after_bc = false;
					bool saw_after_e5 = false;
					bool saw_before_e6 = false;
					bool saw_after_e6 = false;
					bool saw_after_e7 = false;
					bool saw_after_e8 = false;
					bool saw_after_ea = false;
					bool saw_before_eb = false;
					bool saw_after_f0 = false;
					bool saw_fc = false;
					bool saw_fe = false;
					bool saw_ff = false;
					int b_hits = 0;
					int e_hits = 0;

					for (int step = 0; step < kCyclesPerSample; step++)
					{
						const tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
						if (pre.pc == 0xb5)
						{
							b_hits++;
							if (b_hits == wanted_hit)
							{
								armed_b = true;
								out.step_b5 = step;
								out.before_b5 = pre;
							}
						}
						if (pre.pc == 0xe4)
						{
							e_hits++;
							if (e_hits == wanted_hit)
							{
								armed_e = true;
								out.step_e4 = step;
								out.before_e4 = pre;
							}
						}

						m_dsp->debug_run_cycles(1);
						const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();

						if (armed_b)
						{
							if (pre.pc == 0xb6)
							{
								out.after_b6 = post;
								saw_after_b6 = true;
							}
							else if (pre.pc == 0xb8)
							{
								out.after_b8 = post;
								saw_after_b8 = true;
							}
							else if (pre.pc == 0xba)
							{
								out.before_ba = pre;
								out.after_ba = post;
								saw_before_ba = true;
								saw_after_ba = true;
							}
							else if (pre.pc == 0xbb)
							{
								out.after_bb = post;
								saw_after_bb = true;
							}
							else if (pre.pc == 0xbc)
							{
								out.after_bc = post;
								saw_after_bc = true;
							}
						}

						if (!armed_e)
							continue;

						if (pre.pc == 0xe5)
						{
							out.after_e5 = post;
							saw_after_e5 = true;
						}
						else if (pre.pc == 0xe6)
						{
							out.before_e6 = pre;
							out.after_e6 = post;
							saw_before_e6 = true;
							saw_after_e6 = true;
						}
						else if (pre.pc == 0xe7)
						{
							out.after_e7 = post;
							saw_after_e7 = true;
						}
						else if (pre.pc == 0xe8)
						{
							out.after_e8 = post;
							saw_after_e8 = true;
						}
						else if (pre.pc == 0xea)
						{
							out.after_ea = post;
							saw_after_ea = true;
						}
						else if (pre.pc == 0xeb)
						{
							out.before_eb = pre;
							saw_before_eb = true;
						}
						else if (pre.pc == 0xf0)
						{
							out.after_f0 = post;
							saw_after_f0 = true;
						}
						else if (pre.pc == 0xfc)
						{
							out.before_fc = pre;
							out.after_fc = post;
							saw_fc = true;
						}
						else if (pre.pc == 0xfe)
						{
							out.after_fe = post;
							saw_fe = true;
						}
						else if (pre.pc == 0xff)
						{
							out.after_ff = post;
							saw_ff = true;
							break;
						}
					}

					if (!armed_b || !armed_e || !saw_after_b6 || !saw_after_b8 || !saw_before_ba || !saw_after_ba || !saw_after_bb || !saw_after_bc
						|| !saw_after_e5 || !saw_before_e6 || !saw_after_e6 || !saw_after_e7 || !saw_after_e8 || !saw_after_ea
						|| !saw_before_eb || !saw_after_f0 || !saw_fc || !saw_fe || !saw_ff)
						throw emu_fatalerror("Unable to summarize producer hit=%d for SU=%llu", wanted_hit, (unsigned long long)su);

					return out;
				};

				auto log_producer_summary = [&](u64 su, int wanted_hit) -> void
				{
					const producer_summary summary = capture_producer_summary(su, wanted_hit);
					osd_printf_info(
						"INFO dsp3 onset prodhist su=%llu hit=%d step_b5=%03d step_e4=%03d "
						"b5_l4a=%06x b5_l4b=%06x b5_l4c=%06x b5_l56=%06x b5_l59=%06x "
						"b6_l56=%06x b8_c4b=%08x ba_l56=%06x ba_c40=%08x ba_macc=%013llx bb_l4c=%06x bb_c41=%08x bb_macc=%013llx bc_l59=%06x bc_macc=%013llx "
						"e5_l4d=%06x e6_l4b=%06x e6_l59=%06x e6_c4a=%08x e6_c4b=%08x e6_macc=%013llx e7_macc=%013llx e8_macc=%013llx "
						"d06_after_ea=%06x aacc_after_ea=%08x l09_after_f0=%06x l09_at_fc=%06x fc_macc=%013llx so_fe=%06x/%06x so_ff=%06x/%06x\n",
						(unsigned long long)su,
						wanted_hit,
						summary.step_b5,
						summary.step_e4,
						logical0(summary.before_b5, 0x4a),
						logical0(summary.before_b5, 0x4b),
						logical0(summary.before_b5, 0x4c),
						logical0(summary.before_b5, 0x56),
						logical0(summary.before_b5, 0x59),
						logical0(summary.after_b6, 0x56),
						summary.after_b8.cmem[0x4b],
						logical0(summary.before_ba, 0x56),
						summary.before_ba.cmem[0x40],
						(unsigned long long)summary.after_ba.macc,
						logical0(summary.after_bb, 0x4c),
						summary.before_ba.cmem[0x41],
						(unsigned long long)summary.after_bb.macc,
						logical0(summary.after_bc, 0x59),
						(unsigned long long)summary.after_bc.macc,
						logical0(summary.after_e5, 0x4d),
						logical0(summary.before_e6, 0x4b),
						logical0(summary.before_e6, 0x59),
						summary.before_e6.cmem[0x4a],
						summary.before_e6.cmem[0x4b],
						(unsigned long long)summary.after_e6.macc,
						(unsigned long long)summary.after_e7.macc,
						(unsigned long long)summary.after_e8.macc,
						logical0(summary.after_ea, 0x06),
						summary.after_ea.aacc,
						logical0(summary.after_f0, 0x09),
						logical0(summary.before_fc, 0x09),
						(unsigned long long)summary.after_fc.macc,
						summary.after_fe.so[0],
						summary.after_fe.so[1],
						summary.after_ff.so[0],
						summary.after_ff.so[1]);
				};

				for (u64 su = first_history_su; su <= start_su; su++)
				{
					log_producer_summary(su, 1);
					log_producer_summary(su, 2);
				}

				auto signed_half24 = [](u32 value) -> u32
				{
					value &= 0x00ffffffU;
					const s32 signed_value = (value & 0x00800000U) ? s32(value | 0xff000000U) : s32(value);
					return u32(signed_value / 2) & 0x00ffffffU;
				};

				auto signed_half32_for_producer = [](u32 value) -> u32
				{
					return u32(s32(value) / 2);
				};

				const tms57002_device::debug_snapshot prev_pce61 = capture_nth_pc(start_su - 1, 0xe6, 1);
				const tms57002_device::debug_snapshot cur_pce61 = capture_nth_pc(start_su, 0xe6, 1);
				const tms57002_device::debug_snapshot cur_pce62 = capture_nth_pc(start_su, 0xe6, 2);

				auto run_pce6_variant = [&](const char *label, bool patch_l4b, u32 l4b_value, bool patch_l59, u32 l59_value, bool patch_c4a, u32 c4a_value, bool patch_c4b, u32 c4b_value) -> void
				{
					m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
					load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
					m_dsp->debug_restore_snapshot(start);

					tms57002_device::debug_snapshot before_e6;
					tms57002_device::debug_snapshot after_e6;
					tms57002_device::debug_snapshot after_e7;
					tms57002_device::debug_snapshot after_e8;
					tms57002_device::debug_snapshot after_ea1;
					tms57002_device::debug_snapshot before_eb2;
					tms57002_device::debug_snapshot after_f0_2;
					tms57002_device::debug_snapshot before_fc2;
					tms57002_device::debug_snapshot after_fc2;
					tms57002_device::debug_snapshot after_fe2;
					tms57002_device::debug_snapshot after_ff2;
					bool patched = false;
					bool saw_e6 = false;
					bool saw_e7 = false;
					bool saw_e8 = false;
					bool saw_ea1 = false;
					bool saw_eb2 = false;
					bool saw_f0_2 = false;
					bool saw_fc2 = false;
					bool saw_fe2 = false;
					bool saw_ff2 = false;
					int e6_hits = 0;
					int eb_hits = 0;
					int fc_hits = 0;
					int hit_step = -1;

					for (int step = 0; step < kCyclesPerSample; step++)
					{
						tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
						if (pre.pc == 0xe6)
						{
							e6_hits++;
							if (e6_hits == 1)
							{
								if (patch_l4b)
									m_dsp->debug_write_dmem0((pre.ba0 + 0x4b) & 0xff, l4b_value & 0x00ffffffU);
								if (patch_l59)
									m_dsp->debug_write_dmem0((pre.ba0 + 0x59) & 0xff, l59_value & 0x00ffffffU);
								if (patch_c4a)
									m_dsp->debug_write_cmem(0x4a, c4a_value);
								if (patch_c4b)
									m_dsp->debug_write_cmem(0x4b, c4b_value);
								pre = m_dsp->debug_capture_snapshot();
								before_e6 = pre;
								patched = true;
								saw_e6 = true;
								hit_step = step;
							}
						}

						m_dsp->debug_run_cycles(1);
						const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();

