joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
						if (!patched)
							continue;

						if (pre.pc == 0xe6 && e6_hits == 1)
							after_e6 = post;
						else if (pre.pc == 0xe7 && e6_hits == 1)
						{
							after_e7 = post;
							saw_e7 = true;
						}
						else if (pre.pc == 0xe8 && e6_hits == 1)
						{
							after_e8 = post;
							saw_e8 = true;
						}
						else if (pre.pc == 0xea && e6_hits == 1)
						{
							after_ea1 = post;
							saw_ea1 = true;
						}
						else if (pre.pc == 0xeb)
						{
							eb_hits++;
							if (eb_hits == 2)
							{
								before_eb2 = pre;
								saw_eb2 = true;
							}
						}
						else if (pre.pc == 0xf0 && eb_hits == 2)
						{
							after_f0_2 = post;
							saw_f0_2 = true;
						}
						else if (pre.pc == 0xfc)
						{
							fc_hits++;
							if (fc_hits == 2)
							{
								before_fc2 = pre;
								after_fc2 = post;
								saw_fc2 = true;
							}
						}
						else if (pre.pc == 0xfe && fc_hits == 2)
						{
							after_fe2 = post;
							saw_fe2 = true;
						}
						else if (pre.pc == 0xff && fc_hits == 2)
						{
							after_ff2 = post;
							saw_ff2 = true;
							break;
						}
					}

					if (!saw_e6 || !saw_e7 || !saw_e8 || !saw_ea1 || !saw_eb2 || !saw_f0_2 || !saw_fc2 || !saw_fe2 || !saw_ff2)
						throw emu_fatalerror("PC=E6 variant %s did not reach second final path", label);

					osd_printf_info(
						"INFO dsp3 onset pce6 variant label=%s step=%d l4b=%06x l59=%06x c4a=%08x c4b=%08x "
						"e6_macc=%013llx e7_macc=%013llx e8_macc=%013llx d06_after_ea1=%06x aacc_after_ea1=%08x "
						"hit2_l0a=%06x hit2_l0b=%06x hit2_aacc_after_f0=%08x hit2_l09=%06x fc_macc=%013llx so_after_fe=%06x/%06x so_after_ff=%06x/%06x\n",
						label,
						hit_step,
						logical0(before_e6, 0x4b),
						logical0(before_e6, 0x59),
						before_e6.cmem[0x4a],
						before_e6.cmem[0x4b],
						(unsigned long long)after_e6.macc,
						(unsigned long long)after_e7.macc,
						(unsigned long long)after_e8.macc,
						logical0(after_ea1, 0x06),
						after_ea1.aacc,
						logical0(before_eb2, 0x0a),
						logical0(before_eb2, 0x0b),
						after_f0_2.aacc,
						logical0(after_f0_2, 0x09),
						(unsigned long long)after_fc2.macc,
						after_fe2.so[0],
						after_fe2.so[1],
						after_ff2.so[0],
						after_ff2.so[1]);
				};

				osd_printf_info(
					"INFO dsp3 onset pce6 compare prev_l4b=%06x cur_l4b=%06x prev_l59=%06x cur_l59=%06x "
					"hit2_l4b=%06x hit2_l59=%06x prev_c4a=%08x cur_c4a=%08x prev_c4b=%08x cur_c4b=%08x\n",
					logical0(prev_pce61, 0x4b),
					logical0(cur_pce61, 0x4b),
					logical0(prev_pce61, 0x59),
					logical0(cur_pce61, 0x59),
					logical0(cur_pce62, 0x4b),
					logical0(cur_pce62, 0x59),
					prev_pce61.cmem[0x4a],
					cur_pce61.cmem[0x4a],
					prev_pce61.cmem[0x4b],
					cur_pce61.cmem[0x4b]);
				run_pce6_variant("cur", false, 0, false, 0, false, 0, false, 0);
				run_pce6_variant("prev_l4b", true, logical0(prev_pce61, 0x4b), false, 0, false, 0, false, 0);
				run_pce6_variant("prev_l59", false, 0, true, logical0(prev_pce61, 0x59), false, 0, false, 0);
				run_pce6_variant("prev_l4b_prev_l59", true, logical0(prev_pce61, 0x4b), true, logical0(prev_pce61, 0x59), false, 0, false, 0);
				run_pce6_variant("l4b_half", true, signed_half24(logical0(cur_pce61, 0x4b)), false, 0, false, 0, false, 0);
				run_pce6_variant("l59_half", false, 0, true, signed_half24(logical0(cur_pce61, 0x59)), false, 0, false, 0);
				run_pce6_variant("l4b_hit2", true, logical0(cur_pce62, 0x4b), false, 0, false, 0, false, 0);
				run_pce6_variant("l4b_hit2_l59_fullscale", true, logical0(cur_pce62, 0x4b), true, 0x3fffff, false, 0, false, 0);
				run_pce6_variant("hit2_operands", true, logical0(cur_pce62, 0x4b), true, logical0(cur_pce62, 0x59), false, 0, false, 0);
				run_pce6_variant("l59_fullscale", false, 0, true, 0x3fffff, false, 0, false, 0);
				run_pce6_variant("l4b_zero", true, 0, false, 0, false, 0, false, 0);
				run_pce6_variant("l59_zero", false, 0, true, 0, false, 0, false, 0);
				run_pce6_variant("c4a_half", false, 0, false, 0, true, signed_half32_for_producer(cur_pce61.cmem[0x4a]), false, 0);
				run_pce6_variant("c4b_half", false, 0, false, 0, false, 0, true, signed_half32_for_producer(cur_pce61.cmem[0x4b]));
				run_pce6_variant("c4a_zero", false, 0, false, 0, true, 0, false, 0);
				run_pce6_variant("c4b_zero", false, 0, false, 0, false, 0, true, 0);

				auto run_pcce_variant = [&](const char *label, bool forward_d46_from_xrd, bool forward_d47_from_xrd) -> void
				{
					m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
					load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
					m_dsp->debug_restore_snapshot(start);

					tms57002_device::debug_snapshot before_ce;
					tms57002_device::debug_snapshot after_ce;
					tms57002_device::debug_snapshot before_d1;
					tms57002_device::debug_snapshot after_d1;
					tms57002_device::debug_snapshot after_d3;
					tms57002_device::debug_snapshot before_e6;
					tms57002_device::debug_snapshot after_e8;
					tms57002_device::debug_snapshot after_ea1;
					tms57002_device::debug_snapshot before_eb2;
					tms57002_device::debug_snapshot after_f0_2;
					tms57002_device::debug_snapshot after_fc2;
					tms57002_device::debug_snapshot after_fe2;
					tms57002_device::debug_snapshot after_ff2;
					bool patched = false;
					bool saw_ce = false;
					bool saw_d1 = false;
					bool saw_d3 = false;
					bool saw_e6 = false;
					bool saw_e8 = false;
					bool saw_ea1 = false;
					bool saw_eb2 = false;
					bool saw_f0_2 = false;
					bool saw_fc2 = false;
					bool saw_fe2 = false;
					bool saw_ff2 = false;
					int ce_hits = 0;
					int d1_hits = 0;
					int eb_hits = 0;
					int fc_hits = 0;

					for (int step = 0; step < kCyclesPerSample; step++)
					{
						tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
						if (pre.pc == 0xce)
						{
							ce_hits++;
							if (ce_hits == 1)
							{
								if (forward_d46_from_xrd)
									m_dsp->debug_write_dmem0((pre.ba0 + 0x46) & 0xff, pre.xrd & 0x00ffffffU);
								pre = m_dsp->debug_capture_snapshot();
								before_ce = pre;
								patched = true;
								saw_ce = true;
							}
						}
						else if (pre.pc == 0xd1)
						{
							d1_hits++;
							if (d1_hits == 1)
							{
								if (forward_d47_from_xrd)
									m_dsp->debug_write_dmem0((pre.ba0 + 0x47) & 0xff, pre.xrd & 0x00ffffffU);
								pre = m_dsp->debug_capture_snapshot();
								before_d1 = pre;
								saw_d1 = true;
							}
						}

						m_dsp->debug_run_cycles(1);
						const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();

