joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
						if (!patched)
							continue;

						if (pre.pc == 0xce && ce_hits == 1)
							after_ce = post;
						else if (pre.pc == 0xd1 && d1_hits == 1)
							after_d1 = post;
						else if (pre.pc == 0xd3 && ce_hits == 1)
						{
							after_d3 = post;
							saw_d3 = true;
						}
						else if (pre.pc == 0xe6 && ce_hits == 1)
						{
							before_e6 = pre;
							saw_e6 = true;
						}
						else if (pre.pc == 0xe8 && ce_hits == 1)
						{
							after_e8 = post;
							saw_e8 = true;
						}
						else if (pre.pc == 0xea && ce_hits == 1)
						{
							after_ea1 = post;
							saw_ea1 = true;
						}
						else if (pre.pc == 0xeb)
						{
							eb_hits++;
							if (eb_hits == 2)
							{
								before_eb2 = pre;
								saw_eb2 = true;
							}
						}
						else if (pre.pc == 0xf0 && eb_hits == 2)
						{
							after_f0_2 = post;
							saw_f0_2 = true;
						}
						else if (pre.pc == 0xfc)
						{
							fc_hits++;
							if (fc_hits == 2)
							{
								after_fc2 = post;
								saw_fc2 = true;
							}
						}
						else if (pre.pc == 0xfe && fc_hits == 2)
						{
							after_fe2 = post;
							saw_fe2 = true;
						}
						else if (pre.pc == 0xff && fc_hits == 2)
						{
							after_ff2 = post;
							saw_ff2 = true;
							break;
						}
					}

					if (!saw_ce || !saw_d1 || !saw_d3 || !saw_e6 || !saw_e8 || !saw_ea1 || !saw_eb2 || !saw_f0_2 || !saw_fc2 || !saw_fe2 || !saw_ff2)
						throw emu_fatalerror("PC=CE variant %s did not reach second final path", label);

					osd_printf_info(
						"INFO dsp3 onset pcce variant label=%s ce_xrd=%06x ce_l46=%06x ce_macc=%013llx d1_xrd=%06x d1_l47=%06x d1_macc=%013llx "
						"d3_l4b=%06x e6_l4b=%06x e6_l59=%06x e8_macc=%013llx d06_after_ea1=%06x "
						"hit2_l0a=%06x hit2_l0b=%06x hit2_aacc_after_f0=%08x hit2_l09=%06x fc_macc=%013llx so_after_fe=%06x/%06x so_after_ff=%06x/%06x\n",
						label,
						before_ce.xrd,
						logical0(before_ce, 0x46),
						(unsigned long long)after_ce.macc,
						before_d1.xrd,
						logical0(before_d1, 0x47),
						(unsigned long long)after_d1.macc,
						logical0(after_d3, 0x4b),
						logical0(before_e6, 0x4b),
						logical0(before_e6, 0x59),
						(unsigned long long)after_e8.macc,
						logical0(after_ea1, 0x06),
						logical0(before_eb2, 0x0a),
						logical0(before_eb2, 0x0b),
						after_f0_2.aacc,
						logical0(after_f0_2, 0x09),
						(unsigned long long)after_fc2.macc,
						after_fe2.so[0],
						after_fe2.so[1],
						after_ff2.so[0],
						after_ff2.so[1]);
				};

				run_pcce_variant("cur", false, false);
				run_pcce_variant("forward_d46_xrd", true, false);
				run_pcce_variant("forward_d47_xrd", false, true);
				run_pcce_variant("forward_d46_d47_xrd", true, true);

				const tms57002_device::debug_snapshot cur_pcb02 = capture_nth_pc(start_su, 0xb0, 2);
				auto run_pcb0_ce_variant = [&](const char *label, bool patch_b0_l53, bool forward_ce_d46) -> void
				{
					m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
					load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
					m_dsp->debug_restore_snapshot(start);

					tms57002_device::debug_snapshot before_b0;
					tms57002_device::debug_snapshot after_b6;
					tms57002_device::debug_snapshot before_ce;
					tms57002_device::debug_snapshot after_d3;
					tms57002_device::debug_snapshot before_e6;
					tms57002_device::debug_snapshot after_e8;
					tms57002_device::debug_snapshot after_ea1;
					tms57002_device::debug_snapshot after_f0_2;
					tms57002_device::debug_snapshot after_fc2;
					tms57002_device::debug_snapshot after_fe2;
					tms57002_device::debug_snapshot after_ff2;
					bool saw_b0 = false;
					bool saw_b6 = false;
					bool saw_ce = false;
					bool saw_d3 = false;
					bool saw_e6 = false;
					bool saw_e8 = false;
					bool saw_ea1 = false;
					bool saw_f0_2 = false;
					bool saw_fc2 = false;
					bool saw_fe2 = false;
					bool saw_ff2 = false;
					int b0_hits = 0;
					int ce_hits = 0;
					int eb_hits = 0;
					int fc_hits = 0;
					const u32 hit2_l53 = logical0(cur_pcb02, 0x53);

					for (int step = 0; step < kCyclesPerSample; step++)
					{
						tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
						if (pre.pc == 0xb0)
						{
							b0_hits++;
							if (b0_hits == 1)
							{
								if (patch_b0_l53)
									m_dsp->debug_write_dmem0((pre.ba0 + 0x53) & 0xff, hit2_l53);
								pre = m_dsp->debug_capture_snapshot();
								before_b0 = pre;
								saw_b0 = true;
							}
						}
						else if (pre.pc == 0xce)
						{
							ce_hits++;
							if (ce_hits == 1)
							{
								if (forward_ce_d46)
									m_dsp->debug_write_dmem0((pre.ba0 + 0x46) & 0xff, pre.xrd & 0x00ffffffU);
								pre = m_dsp->debug_capture_snapshot();
								before_ce = pre;
								saw_ce = true;
							}
						}

						m_dsp->debug_run_cycles(1);
						const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();

						if (pre.pc == 0xb6 && b0_hits >= 1 && !saw_b6)
						{
							after_b6 = post;
							saw_b6 = true;
						}
						else if (pre.pc == 0xd3 && ce_hits >= 1 && !saw_d3)
						{
							after_d3 = post;
							saw_d3 = true;
						}
						else if (pre.pc == 0xe6 && ce_hits >= 1 && !saw_e6)
						{
							before_e6 = pre;
							saw_e6 = true;
						}
						else if (pre.pc == 0xe8 && ce_hits >= 1 && !saw_e8)
						{
							after_e8 = post;
							saw_e8 = true;
						}
						else if (pre.pc == 0xea && ce_hits >= 1 && !saw_ea1)
						{
							after_ea1 = post;
							saw_ea1 = true;
						}
						else if (pre.pc == 0xeb)
						{
							eb_hits++;
						}
						else if (pre.pc == 0xf0 && eb_hits == 2)
						{
							after_f0_2 = post;
							saw_f0_2 = true;
						}
						else if (pre.pc == 0xfc)
						{
							fc_hits++;
							if (fc_hits == 2)
							{
								after_fc2 = post;
								saw_fc2 = true;
							}
						}
						else if (pre.pc == 0xfe && fc_hits == 2)
						{
							after_fe2 = post;
							saw_fe2 = true;
						}
						else if (pre.pc == 0xff && fc_hits == 2)
						{
							after_ff2 = post;
							saw_ff2 = true;
							break;
						}
					}

