joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
					if (!saw_b0 || !saw_b6 || !saw_ce || !saw_d3 || !saw_e6 || !saw_e8 || !saw_ea1 || !saw_f0_2 || !saw_fc2 || !saw_fe2 || !saw_ff2)
						throw emu_fatalerror("PC=B0/CE variant %s did not reach second final path", label);

					osd_printf_info(
						"INFO dsp3 onset pcb0ce variant label=%s b0_l53=%06x b6_l56=%06x ce_xrd=%06x ce_l46=%06x d3_l4b=%06x "
						"e6_l4b=%06x e6_l59=%06x e8_macc=%013llx d06_after_ea1=%06x hit2_l09=%06x fc_macc=%013llx so_after_fe=%06x/%06x so_after_ff=%06x/%06x\n",
						label,
						logical0(before_b0, 0x53),
						logical0(after_b6, 0x56),
						before_ce.xrd,
						logical0(before_ce, 0x46),
						logical0(after_d3, 0x4b),
						logical0(before_e6, 0x4b),
						logical0(before_e6, 0x59),
						(unsigned long long)after_e8.macc,
						logical0(after_ea1, 0x06),
						logical0(after_f0_2, 0x09),
						(unsigned long long)after_fc2.macc,
						after_fe2.so[0],
						after_fe2.so[1],
						after_ff2.so[0],
						after_ff2.so[1]);
				};

				run_pcb0_ce_variant("cur", false, false);
				run_pcb0_ce_variant("b0_l53_hit2", true, false);
				run_pcb0_ce_variant("ce_d46_xrd", false, true);
				run_pcb0_ce_variant("b0_l53_hit2_ce_d46_xrd", true, true);

				const tms57002_device::debug_snapshot prev_pceb1 = capture_nth_pc(start_su - 1, 0xeb, 1);
				const tms57002_device::debug_snapshot cur_pceb1 = capture_nth_pc(start_su, 0xeb, 1);
			const tms57002_device::debug_snapshot prev_pceb2 = capture_nth_pc(start_su - 1, 0xeb, 2);
			const tms57002_device::debug_snapshot cur_pceb2 = capture_nth_pc(start_su, 0xeb, 2);

		auto run_pceb_variant = [&](const char *label, int wanted_hit, const tms57002_device::debug_snapshot &prev_ref, bool patch_l0a, bool patch_creg) -> void
		{
			m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
			load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
			m_dsp->debug_restore_snapshot(start);

			tms57002_device::debug_snapshot before_eb;
			tms57002_device::debug_snapshot after_eb;
			tms57002_device::debug_snapshot first_after_ee;
			tms57002_device::debug_snapshot before_fc;
			tms57002_device::debug_snapshot after_fc;
			tms57002_device::debug_snapshot after_fe;
			tms57002_device::debug_snapshot after_ff;
			bool patched = false;
			bool saw_eb = false;
			bool saw_first_ee = false;
			bool saw_fc = false;
			bool saw_fe = false;
			bool saw_ff = false;
			int hits = 0;
			int hit_step = -1;

			for (int step = 0; step < kCyclesPerSample; step++)
			{
				tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
				if (pre.pc == 0xeb)
				{
					hits++;
					if (hits == wanted_hit)
					{
						if (patch_l0a)
							m_dsp->debug_write_dmem0((pre.ba0 + 0x0a) & 0xff, logical0(prev_ref, 0x0a));
						if (patch_creg)
							m_dsp->debug_set_accumulators(pre.aacc, pre.macc, pre.macc_read, pre.macc_write, prev_ref.creg);
						pre = m_dsp->debug_capture_snapshot();
						before_eb = pre;
						patched = true;
						saw_eb = true;
						hit_step = step;
					}
				}

				m_dsp->debug_run_cycles(1);
				const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();

				if (patched && pre.pc == 0xeb && hits == wanted_hit)
					after_eb = post;
				if (patched && pre.pc == 0xee && !saw_first_ee)
				{
					first_after_ee = post;
					saw_first_ee = true;
				}
				if (patched && pre.pc == 0xfc)
				{
					before_fc = pre;
					after_fc = post;
					saw_fc = true;
				}
				if (patched && pre.pc == 0xfe)
				{
					after_fe = post;
					saw_fe = true;
				}
				if (patched && pre.pc == 0xff)
				{
					after_ff = post;
					saw_ff = true;
				}
			}

			if (!saw_eb || !saw_first_ee || !saw_fc || !saw_fe || !saw_ff)
				throw emu_fatalerror("PC=EB variant %s did not reach expected final path", label);

			osd_printf_info(
				"INFO dsp3 onset pceb variant label=%s hit=%d step=%d l0a=%06x creg=%08x eb_macc=%013llx "
				"first_ee_l0b=%06x first_ee_maccr=%013llx l09_at_fc=%06x l0b_at_fc=%06x fc_macc=%013llx "
				"fe_maccr=%013llx so_after_fe=%06x/%06x so_after_ff=%06x/%06x\n",
				label,
				wanted_hit,
				hit_step,
				logical0(before_eb, 0x0a),
				before_eb.creg,
				(unsigned long long)after_eb.macc,
				logical0(first_after_ee, 0x0b),
				(unsigned long long)first_after_ee.macc_read,
				logical0(before_fc, 0x09),
				logical0(before_fc, 0x0b),
				(unsigned long long)after_fc.macc,
				(unsigned long long)after_fe.macc_read,
				after_fe.so[0],
				after_fe.so[1],
				after_ff.so[0],
				after_ff.so[1]);
		};

			osd_printf_info(
				"INFO dsp3 onset pceb compare hit=1 prev_l0a=%06x cur_l0a=%06x prev_creg=%08x cur_creg=%08x "
				"hit=2 prev_l0a=%06x cur_l0a=%06x prev_creg=%08x cur_creg=%08x\n",
				logical0(prev_pceb1, 0x0a),
				logical0(cur_pceb1, 0x0a),
			prev_pceb1.creg,
			cur_pceb1.creg,
				logical0(prev_pceb2, 0x0a),
				logical0(cur_pceb2, 0x0a),
				prev_pceb2.creg,
				cur_pceb2.creg);
			osd_printf_info(
				"INFO dsp3 onset pceb cstar compare hit=1 prev_ca=%02x prev_cstar=%08x cur_ca=%02x cur_cstar=%08x "
				"hit=2 prev_ca=%02x prev_cstar=%08x cur_ca=%02x cur_cstar=%08x\n",
				prev_pceb1.ca,
				prev_pceb1.cmem[prev_pceb1.ca],
				cur_pceb1.ca,
				cur_pceb1.cmem[cur_pceb1.ca],
				prev_pceb2.ca,
				prev_pceb2.cmem[prev_pceb2.ca],
				cur_pceb2.ca,
				cur_pceb2.cmem[cur_pceb2.ca]);
			run_pceb_variant("hit1_cur", 1, prev_pceb1, false, false);
			run_pceb_variant("hit1_prev_l0a", 1, prev_pceb1, true, false);
			run_pceb_variant("hit1_prev_creg", 1, prev_pceb1, false, true);
			run_pceb_variant("hit1_prev_l0a_prev_creg", 1, prev_pceb1, true, true);
			run_pceb_variant("hit2_prev_l0a", 2, prev_pceb2, true, false);

			auto signed_half32 = [](u32 value) -> u32
			{
				return u32(s32(value) / 2);
			};

			auto signed_neg32 = [](u32 value) -> u32
			{
				return u32(-s64(s32(value)));
			};

			auto run_hit1_mix_variant = [&](const char *label, bool patch_l0a, bool patch_eb_creg, u32 eb_creg_value, bool patch_eb_cmem, u32 eb_cmem_value, bool patch_c02, u32 c02_value, bool patch_c64, u32 c64_value) -> void
			{
				m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
				load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
				m_dsp->debug_restore_snapshot(start);

				tms57002_device::debug_snapshot before_eb;
				tms57002_device::debug_snapshot after_eb;
				tms57002_device::debug_snapshot after_ec;
				tms57002_device::debug_snapshot after_ed;
				tms57002_device::debug_snapshot first_after_ee;
				tms57002_device::debug_snapshot before_fc;
				tms57002_device::debug_snapshot after_fc;
				tms57002_device::debug_snapshot after_fe;
				tms57002_device::debug_snapshot after_ff;
				bool patched = false;
				bool saw_eb = false;
				bool saw_ec = false;
				bool saw_ed = false;
				bool saw_first_ee = false;
				bool saw_fc = false;
				bool saw_fe = false;
				bool saw_ff = false;
				int hits = 0;
				int hit_step = -1;

				for (int step = 0; step < kCyclesPerSample; step++)
				{
					tms57002_device::debug_snapshot pre = m_dsp->debug_capture_snapshot();
					if (pre.pc == 0xeb)
					{
						hits++;
						if (hits == 1)
						{
							if (patch_l0a)
								m_dsp->debug_write_dmem0((pre.ba0 + 0x0a) & 0xff, logical0(prev_pceb1, 0x0a));
							if (patch_eb_cmem)
								m_dsp->debug_write_cmem(pre.ca, eb_cmem_value);
							if (patch_c02)
								m_dsp->debug_write_cmem(0x02, c02_value);
							if (patch_c64)
								m_dsp->debug_write_cmem(0x64, c64_value);
							if (patch_eb_creg)
								m_dsp->debug_set_accumulators(pre.aacc, pre.macc, pre.macc_read, pre.macc_write, eb_creg_value);
							pre = m_dsp->debug_capture_snapshot();
							before_eb = pre;
							patched = true;
							saw_eb = true;
							hit_step = step;
						}
					}

					m_dsp->debug_run_cycles(1);
					const tms57002_device::debug_snapshot post = m_dsp->debug_capture_snapshot();

					if (patched && pre.pc == 0xeb && hits == 1)
						after_eb = post;
					if (patched && pre.pc == 0xec && !saw_ec)
					{
						after_ec = post;
						saw_ec = true;
					}
					if (patched && pre.pc == 0xed && !saw_ed)
					{
						after_ed = post;
						saw_ed = true;
					}
					if (patched && pre.pc == 0xee && !saw_first_ee)
					{
						first_after_ee = post;
						saw_first_ee = true;
					}
					if (patched && pre.pc == 0xfc)
					{
						before_fc = pre;
						after_fc = post;
						saw_fc = true;
					}
					if (patched && pre.pc == 0xfe)
					{
						after_fe = post;
						saw_fe = true;
					}
					if (patched && pre.pc == 0xff)
					{
						after_ff = post;
						saw_ff = true;
					}
				}

