joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
				if (!saw_eb || !saw_ec || !saw_ed || !saw_first_ee || !saw_fc || !saw_fe || !saw_ff)
					throw emu_fatalerror("hit1 mix variant %s did not reach expected final path", label);

				osd_printf_info(
					"INFO dsp3 onset hit1mix variant label=%s step=%d l0a=%06x eb_ca=%02x eb_cstar=%08x eb_creg=%08x c02=%08x c64=%08x "
					"eb_macc=%013llx after_ec_creg=%08x ed_macc=%013llx first_l0b_after_ee=%06x first_ee_macc=%013llx "
					"l09_at_fc=%06x l0b_at_fc=%06x fc_macc=%013llx fe_maccr=%013llx so_after_fe=%06x/%06x so_after_ff=%06x/%06x\n",
					label,
					hit_step,
					logical0(before_eb, 0x0a),
					before_eb.ca,
					before_eb.cmem[before_eb.ca],
					before_eb.creg,
					before_eb.cmem[0x02],
					before_eb.cmem[0x64],
					(unsigned long long)after_eb.macc,
					after_ec.creg,
					(unsigned long long)after_ed.macc,
					logical0(first_after_ee, 0x0b),
					(unsigned long long)first_after_ee.macc,
					logical0(before_fc, 0x09),
					logical0(before_fc, 0x0b),
					(unsigned long long)after_fc.macc,
					(unsigned long long)after_fe.macc_read,
					after_fe.so[0],
					after_fe.so[1],
					after_ff.so[0],
					after_ff.so[1]);
			};

			const u32 cur_eb_creg = cur_pceb1.creg;
			const u32 cur_eb_cstar = cur_pceb1.cmem[cur_pceb1.ca];
			const u32 prev_eb_cstar = prev_pceb1.cmem[prev_pceb1.ca];
			const u32 cur_c02 = cur_pceb1.cmem[0x02];
			const u32 cur_c64 = cur_pceb1.cmem[0x64];
			run_hit1_mix_variant("cur", false, false, 0, false, 0, false, 0, false, 0);
			run_hit1_mix_variant("prev_l0a", true, false, 0, false, 0, false, 0, false, 0);
			run_hit1_mix_variant("eb_creg_half", false, true, signed_half32(cur_eb_creg), false, 0, false, 0, false, 0);
			run_hit1_mix_variant("eb_creg_zero", false, true, 0, false, 0, false, 0, false, 0);
			run_hit1_mix_variant("eb_cstar_prev", false, false, 0, true, prev_eb_cstar, false, 0, false, 0);
			run_hit1_mix_variant("eb_cstar_half", false, false, 0, true, signed_half32(cur_eb_cstar), false, 0, false, 0);
			run_hit1_mix_variant("eb_cstar_zero", false, false, 0, true, 0, false, 0, false, 0);
			run_hit1_mix_variant("eb_cstar_neg", false, false, 0, true, signed_neg32(cur_eb_cstar), false, 0, false, 0);
			run_hit1_mix_variant("c02_half", false, false, 0, false, 0, true, signed_half32(cur_c02), false, 0);
			run_hit1_mix_variant("c02_zero", false, false, 0, false, 0, true, 0, false, 0);
			run_hit1_mix_variant("c64_half", false, false, 0, false, 0, false, 0, true, signed_half32(cur_c64));
			run_hit1_mix_variant("c64_zero", false, false, 0, false, 0, false, 0, true, 0);
			run_hit1_mix_variant("c64_neg", false, false, 0, false, 0, false, 0, true, signed_neg32(cur_c64));
		}
	}

void tms57002test_state::probe_dsp3_serial_side_boundary_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kBaseLogPath[] = "00-extracted/kprop_serial_side_boundary_20260408/baseline/error.log";
	static constexpr char kFlipLogPath[] = "00-extracted/kprop_serial_side_boundary_20260408/flip_input/error.log";
	static constexpr char kBaseRamPath[] = "00-extracted/kprop_serial_side_boundary_20260408/baseline/ram/su480001_pc00_pre.bin";
	static constexpr char kFlipRamPath[] = "00-extracted/kprop_serial_side_boundary_20260408/flip_input/ram/su480001_pc00_pre.bin";

	struct pc28_state
	{
		u64 macc_pre = 0;
		u64 macc_post = 0;
		u32 d03 = 0;
		u32 d04 = 0;
		u32 d05 = 0;
		u32 so0 = 0;
		u32 so1 = 0;
	};

	const std::vector<u32> program = load_program_words(kProgramPath);
	const std::vector<std::string> base_lines = load_text_lines(kBaseLogPath);
	const std::vector<std::string> flip_lines = load_text_lines(kFlipLogPath);
	const tms57002_device::debug_snapshot base = load_snapshot_for_su_from_lines(base_lines, 480001);
	const tms57002_device::debug_snapshot flip = load_snapshot_for_su_from_lines(flip_lines, 480001);

	auto run_variant = [&](const char *label, bool use_flip_seed, bool patch_d05_only, bool patch_d05_to_d0f, bool patch_dmem1) -> pc28_state
	{
		const tms57002_device::debug_snapshot &seed = use_flip_seed ? flip : base;
		const char *ram_path = use_flip_seed ? kFlipRamPath : kBaseRamPath;

		m_dsp->debug_load_program(program.data(), u32(program.size()), seed.st0, seed.st1);
		load_data_space_bytes(ram_path, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(seed);

		if (!use_flip_seed)
		{
			if (patch_d05_only)
			{
				const u8 phys = u8(base.ba0 + 0x05);
				m_dsp->debug_write_dmem0(phys, flip.dmem0[phys]);
			}
			if (patch_d05_to_d0f)
			{
				for (u8 logical = 0x05; logical <= 0x0f; logical++)
				{
					const u8 phys = u8(base.ba0 + logical);
					m_dsp->debug_write_dmem0(phys, flip.dmem0[phys]);
				}
			}
			if (patch_dmem1)
			{
				for (u8 idx = 0; idx < 0x20; idx++)
					m_dsp->debug_write_dmem1(idx, flip.dmem1[idx]);
			}
		}

		for (int step = 0; step < 0x200; step++)
		{
			if (m_dsp->state_int(TMS57002_PC) == 0x28 && m_dsp->state_int(TMS57002_ID) == 0x00)
			{
				pc28_state out;
				out.macc_pre = m_dsp->debug_macc();
				out.d03 = m_dsp->dmem0_value(u8(m_dsp->debug_ba0() + 0x03));
				out.d04 = m_dsp->dmem0_value(u8(m_dsp->debug_ba0() + 0x04));
				out.d05 = m_dsp->dmem0_value(u8(m_dsp->debug_ba0() + 0x05));
				m_dsp->debug_run_cycles(1);
				out.macc_post = m_dsp->debug_macc();
				out.so0 = m_dsp->debug_serial_output_register(0);
				out.so1 = m_dsp->debug_serial_output_register(1);
				osd_printf_info(
					"INFO dsp3 serialside boundary label=%s d03=%06x d04=%06x d05=%06x macc=%013llx->%013llx so=%06x/%06x\n",
					label,
					out.d03,
					out.d04,
					out.d05,
					(unsigned long long)out.macc_pre,
					(unsigned long long)out.macc_post,
					out.so0,
					out.so1);
				return out;
			}
			m_dsp->debug_run_cycles(1);
		}

		throw emu_fatalerror("Failed to reach DSP3 serial-side boundary PC28 for %s", label);
	};

	const pc28_state base_state = run_variant("base", false, false, false, false);
	const pc28_state flip_state = run_variant("flip", true, false, false, false);
	const pc28_state d05_state = run_variant("base+d05", false, true, false, false);
	const pc28_state d05_0f_state = run_variant("base+d05_0f", false, false, true, false);
	const pc28_state dmem1_state = run_variant("base+dmem1", false, false, false, true);
	const pc28_state combo_state = run_variant("base+d05_0f+dmem1", false, false, true, true);

	check_equal("dsp3 serialside base pc28 live macc", s64(base_state.macc_post), s64(0x00004f3fbfff5ULL));
	check_equal("dsp3 serialside flip pc28 live macc", s64(flip_state.macc_post), s64(0x0000531fffff5ULL));

	osd_printf_info(
		"INFO dsp3 serialside boundary delta base->flip=%013llx d05only=%013llx d05_0f=%013llx dmem1=%013llx combo=%013llx\n",
		(unsigned long long)(flip_state.macc_post - base_state.macc_post),
		(unsigned long long)(d05_state.macc_post - base_state.macc_post),
		(unsigned long long)(d05_0f_state.macc_post - base_state.macc_post),
		(unsigned long long)(dmem1_state.macc_post - base_state.macc_post),
		(unsigned long long)(combo_state.macc_post - base_state.macc_post));
}

void tms57002test_state::probe_dsp3_a02_fix_su95299_coeff_sensitivity()
{
	static constexpr char kProgramPath[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kLogPath[] = "tmp/kprop_a02_clip_tape_95296_v3/dspsnap.log";
	static constexpr char kRamDir[] = "tmp/kprop_a02_clip_tape_95296_v3/ram";
	static constexpr u64 kStartSu = 95299;
	static constexpr int kCyclesPerSample = 512;

	const std::vector<u32> program = load_program_words(kProgramPath);
	const std::vector<std::string> lines = load_text_lines(kLogPath);
	const tms57002_device::debug_snapshot prev = load_snapshot_for_su_from_lines(lines, kStartSu - 1);
	const tms57002_device::debug_snapshot start = load_snapshot_for_su_from_lines(lines, kStartSu);
	const tms57002_device::debug_snapshot expect = load_snapshot_for_su_from_lines(lines, kStartSu + 1);
	const tms57002_device::debug_snapshot expect2 = load_snapshot_for_su_from_lines(lines, kStartSu + 2);
	const tms57002_device::debug_snapshot expect3 = load_snapshot_for_su_from_lines(lines, kStartSu + 3);
	const std::string prev_ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", kRamDir, (unsigned long long)(kStartSu - 1));
	const std::string start_ram_path = util::string_format("%s/su%06llu_pc00_pre.bin", kRamDir, (unsigned long long)kStartSu);

	struct boundary_state
	{
		u32 so0 = 0;
		u32 so1 = 0;
		s64 macc = 0;
		u32 aacc = 0;
		u8 ba0 = 0;
		u32 l50 = 0;
		u32 l53 = 0;
		u32 l56 = 0;
		u32 l59 = 0;
		u32 c42 = 0;
		u32 c4a = 0;
		u32 c4b = 0;
		u32 cc0 = 0;
		u32 cc1 = 0;
	};

