joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	auto capture_boundary = [&](const char *label, const tms57002_device::debug_snapshot &seed, const char *ram_path = nullptr) -> boundary_state
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), seed.st0, seed.st1);
		load_data_space_bytes(ram_path ? ram_path : start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(seed);
		for (int i = 0; i < kCyclesPerSample; i++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(expect.serial_input_frame);

		boundary_state out;
		out.so0 = m_dsp->debug_serial_output_register(0);
		out.so1 = m_dsp->debug_serial_output_register(1);
		out.macc = s64(m_dsp->debug_macc());
		out.aacc = u32(m_dsp->debug_aacc());
		out.ba0 = m_dsp->debug_ba0();
		out.l50 = m_dsp->dmem0_value((out.ba0 + 0x50) & 0xff);
		out.l53 = m_dsp->dmem0_value((out.ba0 + 0x53) & 0xff);
		out.l56 = m_dsp->dmem0_value((out.ba0 + 0x56) & 0xff);
		out.l59 = m_dsp->dmem0_value((out.ba0 + 0x59) & 0xff);
		out.c42 = m_dsp->cmem_value(0x42);
		out.c4a = m_dsp->cmem_value(0x4a);
		out.c4b = m_dsp->cmem_value(0x4b);
		out.cc0 = m_dsp->cmem_value(0xc0);
		out.cc1 = m_dsp->cmem_value(0xc1);

		osd_printf_info(
			"INFO dsp3 a02 fixcoeff label=%s so=%06x/%06x aacc=%08x macc=%013llx ba0=%02x l50=%06x l53=%06x l56=%06x l59=%06x "
			"c42=%08x c4a=%08x c4b=%08x cc0=%08x cc1=%08x\n",
			label,
			out.so0,
			out.so1,
			out.aacc,
			(unsigned long long)out.macc,
			out.ba0,
			out.l50,
			out.l53,
			out.l56,
			out.l59,
			out.c42,
			out.c4a,
			out.c4b,
			out.cc0,
			out.cc1);
		return out;
	};

	const boundary_state base = capture_boundary("base", start);

	auto copy_logical_from_prev = [&](tms57002_device::debug_snapshot &variant, std::initializer_list<u8> logical_addrs)
	{
		for (u8 logical : logical_addrs)
		{
			const u8 dst = u8(start.ba0 + logical);
			const u8 src = u8(prev.ba0 + logical);
			variant.dmem0[dst] = prev.dmem0[src];
		}
	};

	auto copy_serial = [&](tms57002_device::debug_snapshot &variant, const tms57002_device::debug_snapshot &src)
	{
		variant.si = src.si;
		variant.serial_input_latch = src.serial_input_latch;
		variant.serial_input_active = src.serial_input_active;
		variant.serial_input_frame = src.serial_input_frame;
		variant.serial_input_prev_frame = src.serial_input_prev_frame;
		variant.serial_input_pending = src.serial_input_pending;
		variant.serial_input_valid = src.serial_input_valid;
		variant.serial_input_active_valid = src.serial_input_active_valid;
		variant.serial_input_prev_valid = src.serial_input_prev_valid;
		variant.serial_input_pending_valid = src.serial_input_pending_valid;
		variant.serial_output_pending_valid = src.serial_output_pending_valid;
		variant.serial_frame_mode = src.serial_frame_mode;
		variant.serial_input_timing_mode = src.serial_input_timing_mode;
		variant.serial_frame_clocks = src.serial_frame_clocks;
		variant.serial_exec_halfcycles = src.serial_exec_halfcycles;
		variant.serial_input_pending_halfcycle = src.serial_input_pending_halfcycle;
		variant.serial_output_pending_halfcycle = src.serial_output_pending_halfcycle;
		variant.sync_polarity_rising = src.sync_polarity_rising;
		variant.serial_output_muted = src.serial_output_muted;
	};

	auto capture_boundary_with_runtime_patch = [&](const char *label, bool patch_cc0, bool patch_cc1) -> boundary_state
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (int i = 0; i < kCyclesPerSample; i++)
		{
			const u8 executed_pc = u8(m_dsp->state_int(TMS57002_PC));
			const u8 executed_id = u8(m_dsp->state_int(TMS57002_ID));
			m_dsp->debug_run_cycles(1);
			if (executed_id == 0x1f && executed_pc == 0x34 && patch_cc0)
				m_dsp->debug_write_cmem(0xc0, prev.cmem[0xc0]);
			if (executed_id == 0x1f && executed_pc == 0x3a && patch_cc1)
				m_dsp->debug_write_cmem(0xc1, prev.cmem[0xc1]);
		}
		m_dsp->debug_begin_sample_frame(expect.serial_input_frame);

		boundary_state out;
		out.so0 = m_dsp->debug_serial_output_register(0);
		out.so1 = m_dsp->debug_serial_output_register(1);
		out.macc = s64(m_dsp->debug_macc());
		out.aacc = u32(m_dsp->debug_aacc());
		out.ba0 = m_dsp->debug_ba0();
		out.l50 = m_dsp->dmem0_value((out.ba0 + 0x50) & 0xff);
		out.l53 = m_dsp->dmem0_value((out.ba0 + 0x53) & 0xff);
		out.l56 = m_dsp->dmem0_value((out.ba0 + 0x56) & 0xff);
		out.l59 = m_dsp->dmem0_value((out.ba0 + 0x59) & 0xff);
		out.c42 = m_dsp->cmem_value(0x42);
		out.c4a = m_dsp->cmem_value(0x4a);
		out.c4b = m_dsp->cmem_value(0x4b);
		out.cc0 = m_dsp->cmem_value(0xc0);
		out.cc1 = m_dsp->cmem_value(0xc1);

		osd_printf_info(
			"INFO dsp3 a02 fixcoeff label=%s so=%06x/%06x aacc=%08x macc=%013llx ba0=%02x l50=%06x l53=%06x l56=%06x l59=%06x "
			"c42=%08x c4a=%08x c4b=%08x cc0=%08x cc1=%08x\n",
			label,
			out.so0,
			out.so1,
			out.aacc,
			(unsigned long long)out.macc,
			out.ba0,
			out.l50,
			out.l53,
			out.l56,
			out.l59,
			out.c42,
			out.c4a,
			out.c4b,
			out.cc0,
			out.cc1);
		return out;
	};

	auto capture_boundary_with_store_restore = [&](const char *label, bool restore_l50, bool restore_l53, bool restore_l56, bool restore_l59) -> boundary_state
	{
		auto start_logical = [&](u8 logical) -> u32
		{
			return start.dmem0[u8(start.ba0 + logical)];
		};

		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (int i = 0; i < kCyclesPerSample; i++)
		{
			const u8 executed_pc = u8(m_dsp->state_int(TMS57002_PC));
			const u8 executed_id = u8(m_dsp->state_int(TMS57002_ID));
			m_dsp->debug_run_cycles(1);
			if (executed_id != 0x1f)
				continue;
			const u8 ba0_cur = m_dsp->debug_ba0();
			if (executed_pc == 0xaa && restore_l50)
				m_dsp->debug_write_dmem0(u8(ba0_cur + 0x50), start_logical(0x50));
			if (executed_pc == 0xb0 && restore_l53)
				m_dsp->debug_write_dmem0(u8(ba0_cur + 0x53), start_logical(0x53));
			if (executed_pc == 0xb6 && restore_l56)
				m_dsp->debug_write_dmem0(u8(ba0_cur + 0x56), start_logical(0x56));
			if (executed_pc == 0xbc && restore_l59)
				m_dsp->debug_write_dmem0(u8(ba0_cur + 0x59), start_logical(0x59));
		}
		m_dsp->debug_begin_sample_frame(expect.serial_input_frame);

