joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
		boundary_state out;
		out.so0 = m_dsp->debug_serial_output_register(0);
		out.so1 = m_dsp->debug_serial_output_register(1);
		out.macc = s64(m_dsp->debug_macc());
		out.aacc = u32(m_dsp->debug_aacc());
		out.ba0 = m_dsp->debug_ba0();
		out.l50 = m_dsp->dmem0_value((out.ba0 + 0x50) & 0xff);
		out.l53 = m_dsp->dmem0_value((out.ba0 + 0x53) & 0xff);
		out.l56 = m_dsp->dmem0_value((out.ba0 + 0x56) & 0xff);
		out.l59 = m_dsp->dmem0_value((out.ba0 + 0x59) & 0xff);
		out.c42 = m_dsp->cmem_value(0x42);
		out.c4a = m_dsp->cmem_value(0x4a);
		out.c4b = m_dsp->cmem_value(0x4b);
		out.cc0 = m_dsp->cmem_value(0xc0);
		out.cc1 = m_dsp->cmem_value(0xc1);

		osd_printf_info(
			"INFO dsp3 a02 fixcoeff label=%s so=%06x/%06x aacc=%08x macc=%013llx ba0=%02x l50=%06x l53=%06x l56=%06x l59=%06x "
			"c42=%08x c4a=%08x c4b=%08x cc0=%08x cc1=%08x\n",
			label,
			out.so0,
			out.so1,
			out.aacc,
			(unsigned long long)out.macc,
			out.ba0,
			out.l50,
			out.l53,
			out.l56,
			out.l59,
			out.c42,
			out.c4a,
			out.c4b,
			out.cc0,
			out.cc1);
		return out;
	};

	auto capture_boundary_h3_with_store_restore = [&](const char *label, bool restore_l50, bool restore_l53, bool restore_l56, bool restore_l59) -> boundary_state
	{
		auto start_logical = [&](u8 logical) -> u32
		{
			return start.dmem0[u8(start.ba0 + logical)];
		};

		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (int i = 0; i < kCyclesPerSample; i++)
		{
			const u8 executed_pc = u8(m_dsp->state_int(TMS57002_PC));
			const u8 executed_id = u8(m_dsp->state_int(TMS57002_ID));
			m_dsp->debug_run_cycles(1);
			if (executed_id != 0x1f)
				continue;
			const u8 ba0_cur = m_dsp->debug_ba0();
			if (executed_pc == 0xaa && restore_l50)
				m_dsp->debug_write_dmem0(u8(ba0_cur + 0x50), start_logical(0x50));
			if (executed_pc == 0xb0 && restore_l53)
				m_dsp->debug_write_dmem0(u8(ba0_cur + 0x53), start_logical(0x53));
			if (executed_pc == 0xb6 && restore_l56)
				m_dsp->debug_write_dmem0(u8(ba0_cur + 0x56), start_logical(0x56));
			if (executed_pc == 0xbc && restore_l59)
				m_dsp->debug_write_dmem0(u8(ba0_cur + 0x59), start_logical(0x59));
		}
		m_dsp->debug_begin_sample_frame(expect.serial_input_frame);
		for (int i = 0; i < kCyclesPerSample; i++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(expect2.serial_input_frame);
		for (int i = 0; i < kCyclesPerSample; i++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(expect3.serial_input_frame);

		boundary_state out;
		out.so0 = m_dsp->debug_serial_output_register(0);
		out.so1 = m_dsp->debug_serial_output_register(1);
		out.macc = s64(m_dsp->debug_macc());
		out.aacc = u32(m_dsp->debug_aacc());
		out.ba0 = m_dsp->debug_ba0();
		out.l50 = m_dsp->dmem0_value((out.ba0 + 0x50) & 0xff);
		out.l53 = m_dsp->dmem0_value((out.ba0 + 0x53) & 0xff);
		out.l56 = m_dsp->dmem0_value((out.ba0 + 0x56) & 0xff);
		out.l59 = m_dsp->dmem0_value((out.ba0 + 0x59) & 0xff);
		out.c42 = m_dsp->cmem_value(0x42);
		out.c4a = m_dsp->cmem_value(0x4a);
		out.c4b = m_dsp->cmem_value(0x4b);
		out.cc0 = m_dsp->cmem_value(0xc0);
		out.cc1 = m_dsp->cmem_value(0xc1);

		osd_printf_info(
			"INFO dsp3 a02 fixcoeff_h3 label=%s so=%06x/%06x aacc=%08x macc=%013llx ba0=%02x l50=%06x l53=%06x l56=%06x l59=%06x "
			"c42=%08x c4a=%08x c4b=%08x cc0=%08x cc1=%08x\n",
			label,
			out.so0,
			out.so1,
			out.aacc,
			(unsigned long long)out.macc,
			out.ba0,
			out.l50,
			out.l53,
			out.l56,
			out.l59,
			out.c42,
			out.c4a,
			out.c4b,
			out.cc0,
			out.cc1);
		return out;
	};

	auto capture_boundary_with_accum_patch = [&](const char *label, bool patch_second_b4, bool patch_second_ba) -> boundary_state
	{
		static constexpr u32 kB4Aacc = 0x4031676e;
		static constexpr u64 kB4Macc = 0x017e59e65d99cULL;
		static constexpr u64 kB4Maccr = 0xfffff0850ecabf49ULL;
		static constexpr u64 kB4Maccw = 0xfffff81b0eb5d99cULL;
		static constexpr u32 kB4Creg = 0xe0357050;

		static constexpr u32 kBaAacc = 0x7f4bca68;
		static constexpr u64 kBaMacc = 0x02fcb3c7f40d3ULL;
		static constexpr u64 kBaMaccr = 0x017e59e65d99cULL;
		static constexpr u64 kBaMaccw = 0x017e59e65d99cULL;
		static constexpr u32 kBaCreg = 0x3fffffff;

		int b4_seen = 0;
		int ba_seen = 0;

		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (int i = 0; i < kCyclesPerSample; i++)
		{
			const u8 executed_pc = u8(m_dsp->state_int(TMS57002_PC));
			const u8 executed_id = u8(m_dsp->state_int(TMS57002_ID));
			m_dsp->debug_run_cycles(1);
			if (executed_id != 0x1f)
				continue;
			if (executed_pc == 0xb4)
			{
				b4_seen++;
				if (patch_second_b4 && b4_seen == 2)
					m_dsp->debug_set_accumulators(kB4Aacc, kB4Macc, kB4Maccr, kB4Maccw, kB4Creg);
			}
			if (executed_pc == 0xba)
			{
				ba_seen++;
				if (patch_second_ba && ba_seen == 2)
					m_dsp->debug_set_accumulators(kBaAacc, kBaMacc, kBaMaccr, kBaMaccw, kBaCreg);
			}
		}
		m_dsp->debug_begin_sample_frame(expect.serial_input_frame);

		boundary_state out;
		out.so0 = m_dsp->debug_serial_output_register(0);
		out.so1 = m_dsp->debug_serial_output_register(1);
		out.macc = s64(m_dsp->debug_macc());
		out.aacc = u32(m_dsp->debug_aacc());
		out.ba0 = m_dsp->debug_ba0();
		out.l50 = m_dsp->dmem0_value((out.ba0 + 0x50) & 0xff);
		out.l53 = m_dsp->dmem0_value((out.ba0 + 0x53) & 0xff);
		out.l56 = m_dsp->dmem0_value((out.ba0 + 0x56) & 0xff);
		out.l59 = m_dsp->dmem0_value((out.ba0 + 0x59) & 0xff);
		out.c42 = m_dsp->cmem_value(0x42);
		out.c4a = m_dsp->cmem_value(0x4a);
		out.c4b = m_dsp->cmem_value(0x4b);
		out.cc0 = m_dsp->cmem_value(0xc0);
		out.cc1 = m_dsp->cmem_value(0xc1);

		osd_printf_info(
			"INFO dsp3 a02 fixcoeff label=%s so=%06x/%06x aacc=%08x macc=%013llx ba0=%02x l50=%06x l53=%06x l56=%06x l59=%06x "
			"c42=%08x c4a=%08x c4b=%08x cc0=%08x cc1=%08x\n",
			label,
			out.so0,
			out.so1,
			out.aacc,
			(unsigned long long)out.macc,
			out.ba0,
			out.l50,
			out.l53,
			out.l56,
			out.l59,
			out.c42,
			out.c4a,
			out.c4b,
			out.cc0,
			out.cc1);
		return out;
	};

