joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	auto capture_boundary_with_next_frame_override = [&](const char *label, const std::array<u32, 4> &next_frame) -> boundary_state
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (int i = 0; i < kCyclesPerSample; i++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(next_frame);

		boundary_state out;
		out.so0 = m_dsp->debug_serial_output_register(0);
		out.so1 = m_dsp->debug_serial_output_register(1);
		out.macc = s64(m_dsp->debug_macc());
		out.aacc = u32(m_dsp->debug_aacc());
		out.ba0 = m_dsp->debug_ba0();
		out.l50 = m_dsp->dmem0_value((out.ba0 + 0x50) & 0xff);
		out.l53 = m_dsp->dmem0_value((out.ba0 + 0x53) & 0xff);
		out.l56 = m_dsp->dmem0_value((out.ba0 + 0x56) & 0xff);
		out.l59 = m_dsp->dmem0_value((out.ba0 + 0x59) & 0xff);
		out.c42 = m_dsp->cmem_value(0x42);
		out.c4a = m_dsp->cmem_value(0x4a);
		out.c4b = m_dsp->cmem_value(0x4b);
		out.cc0 = m_dsp->cmem_value(0xc0);
		out.cc1 = m_dsp->cmem_value(0xc1);

		osd_printf_info(
			"INFO dsp3 a02 fixcoeff label=%s so=%06x/%06x aacc=%08x macc=%013llx ba0=%02x l50=%06x l53=%06x l56=%06x l59=%06x "
			"c42=%08x c4a=%08x c4b=%08x cc0=%08x cc1=%08x\n",
			label,
			out.so0,
			out.so1,
			out.aacc,
			(unsigned long long)out.macc,
			out.ba0,
			out.l50,
			out.l53,
			out.l56,
			out.l59,
			out.c42,
			out.c4a,
			out.c4b,
			out.cc0,
			out.cc1);
		return out;
	};

	auto capture_boundary_h3_with_frame_override = [&](const char *label, const std::array<u32, 4> &frame1, const std::array<u32, 4> &frame2, const std::array<u32, 4> &frame3) -> boundary_state
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (int i = 0; i < kCyclesPerSample; i++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(frame1);
		for (int i = 0; i < kCyclesPerSample; i++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(frame2);
		for (int i = 0; i < kCyclesPerSample; i++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(frame3);

		boundary_state out;
		out.so0 = m_dsp->debug_serial_output_register(0);
		out.so1 = m_dsp->debug_serial_output_register(1);
		out.macc = s64(m_dsp->debug_macc());
		out.aacc = u32(m_dsp->debug_aacc());
		out.ba0 = m_dsp->debug_ba0();
		out.l50 = m_dsp->dmem0_value((out.ba0 + 0x50) & 0xff);
		out.l53 = m_dsp->dmem0_value((out.ba0 + 0x53) & 0xff);
		out.l56 = m_dsp->dmem0_value((out.ba0 + 0x56) & 0xff);
		out.l59 = m_dsp->dmem0_value((out.ba0 + 0x59) & 0xff);
		out.c42 = m_dsp->cmem_value(0x42);
		out.c4a = m_dsp->cmem_value(0x4a);
		out.c4b = m_dsp->cmem_value(0x4b);
		out.cc0 = m_dsp->cmem_value(0xc0);
		out.cc1 = m_dsp->cmem_value(0xc1);

		osd_printf_info(
			"INFO dsp3 a02 fixcoeff_h3 label=%s so=%06x/%06x aacc=%08x macc=%013llx ba0=%02x l50=%06x l53=%06x l56=%06x l59=%06x "
			"c42=%08x c4a=%08x c4b=%08x cc0=%08x cc1=%08x\n",
			label,
			out.so0,
			out.so1,
			out.aacc,
			(unsigned long long)out.macc,
			out.ba0,
			out.l50,
			out.l53,
			out.l56,
			out.l59,
			out.c42,
			out.c4a,
			out.c4b,
			out.cc0,
			out.cc1);
		return out;
	};

	auto run_variant = [&](const char *label, std::initializer_list<u8> cmem_addrs)
	{
		tms57002_device::debug_snapshot variant = start;
		for (u8 addr : cmem_addrs)
			variant.cmem[addr] = prev.cmem[addr];
		const boundary_state state = capture_boundary(label, variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=%s dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			label,
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	};

	run_variant("prev_c42", { 0x42 });
	run_variant("prev_c4a", { 0x4a });
	run_variant("prev_c4b", { 0x4b });
	run_variant("prev_c42_4a_4b", { 0x42, 0x4a, 0x4b });
	run_variant("prev_c13", { 0x13 });
	run_variant("prev_c23", { 0x23 });
	run_variant("prev_c38", { 0x38 });
	run_variant("prev_c3a", { 0x3a });
	run_variant("prev_c3c", { 0x3c });
	run_variant("prev_c3d", { 0x3d });
	run_variant("prev_ca4", { 0xa4 });
	run_variant("prev_dyncoeffs", { 0x13, 0x23, 0x38, 0x3a, 0x3c, 0x3d, 0xa4 });
	run_variant("prev_dyncoeffs_cc", { 0x13, 0x23, 0x38, 0x3a, 0x3c, 0x3d, 0xa4, 0xc0, 0xc1 });
	run_variant("prev_cc0_cc1", { 0xc0, 0xc1 });
	run_variant("prev_all5", { 0x42, 0x4a, 0x4b, 0xc0, 0xc1 });
	{
		tms57002_device::debug_snapshot variant = start;
		variant.aacc = prev.aacc;
		variant.creg = prev.creg;
		const boundary_state state = capture_boundary("prev_aacc_creg", variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=prev_aacc_creg dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		tms57002_device::debug_snapshot variant = start;
		variant.macc = prev.macc;
		variant.macc_read = prev.macc_read;
		variant.macc_write = prev.macc_write;
		const boundary_state state = capture_boundary("prev_macc_triplet", variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=prev_macc_triplet dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		tms57002_device::debug_snapshot variant = start;
		variant.aacc = 0;
		variant.creg = 0;
		variant.macc = 0;
		variant.macc_read = 0;
		variant.macc_write = 0;
		const boundary_state state = capture_boundary("zero_accums", variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=zero_accums dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}

	{
		tms57002_device::debug_snapshot variant = start;
		copy_logical_from_prev(variant, { 0x56 });
		const boundary_state state = capture_boundary("prev_l56", variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=prev_l56 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		tms57002_device::debug_snapshot variant = start;
		copy_logical_from_prev(variant, { 0x59 });
		const boundary_state state = capture_boundary("prev_l59", variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=prev_l59 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		tms57002_device::debug_snapshot variant = start;
		copy_logical_from_prev(variant, { 0x50, 0x53, 0x56, 0x59 });
		const boundary_state state = capture_boundary("prev_l50_53_56_59", variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=prev_l50_53_56_59 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		tms57002_device::debug_snapshot variant = start;
		variant.si = { 0, 0, 0, 0 };
		variant.serial_input_latch = { 0, 0, 0, 0 };
		variant.serial_input_active = { 0, 0, 0, 0 };
		variant.serial_input_frame = { 0, 0, 0, 0 };
		variant.serial_input_prev_frame = { 0, 0, 0, 0 };
		variant.serial_input_pending = { 0, 0, 0, 0 };
		variant.serial_input_valid = 0;
		variant.serial_input_active_valid = 0;
		variant.serial_input_prev_valid = 0;
		variant.serial_input_pending_valid = 0;
		variant.serial_output_pending_valid = 0;
		const boundary_state state = capture_boundary("zero_serial", variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=zero_serial dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		tms57002_device::debug_snapshot variant = start;
		copy_serial(variant, prev);
		const boundary_state state = capture_boundary("prev_serial", variant);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=prev_serial dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary("prev_xmem", start, prev_ram_path.c_str());
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=prev_xmem dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_runtime_patch("mid_prev_cc0", true, false);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_prev_cc0 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_runtime_patch("mid_prev_cc1", false, true);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_prev_cc1 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_runtime_patch("mid_prev_cc0_cc1", true, true);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_prev_cc0_cc1 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_store_restore("mid_start_l50", true, false, false, false);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_start_l50 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_store_restore("mid_start_l53", false, true, false, false);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_start_l53 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_store_restore("mid_start_l56", false, false, true, false);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_start_l56 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_store_restore("mid_start_l59", false, false, false, true);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_start_l59 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_store_restore("mid_start_l56_l59", false, false, true, true);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_start_l56_l59 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state base_h3 = capture_boundary_h3_with_store_restore("base_h3", false, false, false, false);
		const boundary_state state = capture_boundary_h3_with_store_restore("mid_start_l56_h3", false, false, true, false);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff_h3 delta label=mid_start_l56_h3 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base_h3.so0),
			s32(state.so1) - s32(base_h3.so1),
			s32(state.l50) - s32(base_h3.l50),
			s32(state.l53) - s32(base_h3.l53),
			s32(state.l56) - s32(base_h3.l56),
			s32(state.l59) - s32(base_h3.l59),
			(long long)(state.macc - base_h3.macc));
	}
	{
		const boundary_state base_h3 = capture_boundary_h3_with_store_restore("base_h3", false, false, false, false);
		const boundary_state state = capture_boundary_h3_with_store_restore("mid_start_l59_h3", false, false, false, true);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff_h3 delta label=mid_start_l59_h3 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base_h3.so0),
			s32(state.so1) - s32(base_h3.so1),
			s32(state.l50) - s32(base_h3.l50),
			s32(state.l53) - s32(base_h3.l53),
			s32(state.l56) - s32(base_h3.l56),
			s32(state.l59) - s32(base_h3.l59),
			(long long)(state.macc - base_h3.macc));
	}
	{
		const boundary_state base_h3 = capture_boundary_h3_with_store_restore("base_h3", false, false, false, false);
		const boundary_state state = capture_boundary_h3_with_store_restore("mid_start_l56_l59_h3", false, false, true, true);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff_h3 delta label=mid_start_l56_l59_h3 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base_h3.so0),
			s32(state.so1) - s32(base_h3.so1),
			s32(state.l50) - s32(base_h3.l50),
			s32(state.l53) - s32(base_h3.l53),
			s32(state.l56) - s32(base_h3.l56),
			s32(state.l59) - s32(base_h3.l59),
			(long long)(state.macc - base_h3.macc));
	}
	{
		const boundary_state state = capture_boundary_with_accum_patch("mid_firstpass_b4", true, false);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_firstpass_b4 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_accum_patch("mid_firstpass_ba", false, true);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_firstpass_ba dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_accum_patch("mid_firstpass_b4_ba", true, true);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=mid_firstpass_b4_ba dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_next_frame_override("zero_next_frame", { 0, 0, 0, 0 });
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=zero_next_frame dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state state = capture_boundary_with_next_frame_override("hold_start_frame", start.serial_input_frame);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff delta label=hold_start_frame dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base.so0),
			s32(state.so1) - s32(base.so1),
			s32(state.l50) - s32(base.l50),
			s32(state.l53) - s32(base.l53),
			s32(state.l56) - s32(base.l56),
			s32(state.l59) - s32(base.l59),
			(long long)(state.macc - base.macc));
	}
	{
		const boundary_state base_h3 = capture_boundary_h3_with_frame_override("base_h3_frame", expect.serial_input_frame, expect2.serial_input_frame, expect3.serial_input_frame);
		const boundary_state state = capture_boundary_h3_with_frame_override("zero_future_frames_h3", { 0, 0, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 });
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff_h3 delta label=zero_future_frames_h3 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base_h3.so0),
			s32(state.so1) - s32(base_h3.so1),
			s32(state.l50) - s32(base_h3.l50),
			s32(state.l53) - s32(base_h3.l53),
			s32(state.l56) - s32(base_h3.l56),
			s32(state.l59) - s32(base_h3.l59),
			(long long)(state.macc - base_h3.macc));
	}
	{
		const boundary_state base_h3 = capture_boundary_h3_with_frame_override("base_h3_frame", expect.serial_input_frame, expect2.serial_input_frame, expect3.serial_input_frame);
		const boundary_state state = capture_boundary_h3_with_frame_override("hold_start_frames_h3", start.serial_input_frame, start.serial_input_frame, start.serial_input_frame);
		osd_printf_info(
			"INFO dsp3 a02 fixcoeff_h3 delta label=hold_start_frames_h3 dso=%d/%d dl50=%d dl53=%d dl56=%d dl59=%d dmacc=%lld\n",
			s32(state.so0) - s32(base_h3.so0),
			s32(state.so1) - s32(base_h3.so1),
			s32(state.l50) - s32(base_h3.l50),
			s32(state.l53) - s32(base_h3.l53),
			s32(state.l56) - s32(base_h3.l56),
			s32(state.l59) - s32(base_h3.l59),
			(long long)(state.macc - base_h3.macc));
	}
}

