joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
void tms57002test_state::probe_dsp3_a02_fix_su95298_b3_operand_source()
{
	static constexpr char kProgramPathPrimary[] = "tmp/kprop_dsp3_dump.sTfkHh/dump_dsp3.bin";
	static constexpr char kProgramPathFallback[] = "00-extracted/kprop_a02_sine_live_dump/dump_dsp3.bin";
	static constexpr char kLogPath[] = "tmp/kprop_a02_fix_sample_tape_text95297/dspsnap.log";
	static constexpr char kRamPath[] = "tmp/kprop_a02_fix_sample_tape_text95297/ram/su095298_pc00_pre.bin";
	static constexpr u64 kStartSu = 95298;

	const char *program_path = std::ifstream(kProgramPathPrimary).good() ? kProgramPathPrimary : kProgramPathFallback;
	const std::vector<u32> program = load_program_words(program_path);
	const std::vector<std::string> lines = load_text_lines(kLogPath);
	const tms57002_device::debug_snapshot start = load_snapshot_for_su_from_lines(lines, kStartSu);

	struct b3_state
	{
		u64 macc = 0;
		u64 maccr = 0;
		u64 maccw = 0;
		u32 creg = 0;
		u32 p06 = 0;
		u32 p09 = 0;
		u32 p0f = 0;
		u32 p10 = 0;
	};

	auto run_variant = [&](const char *label, std::initializer_list<u8> zero_dmem0, std::initializer_list<u8> zero_dmem1) -> b3_state
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (u8 addr : zero_dmem0)
			m_dsp->debug_write_dmem0(addr, 0);
		for (u8 addr : zero_dmem1)
			m_dsp->debug_write_dmem1(addr, 0);

		int seen = 0;
		for (int step = 0; step < 0x400; step++)
		{
			const u8 pc = u8(m_dsp->state_int(TMS57002_PC));
			const u8 id = u8(m_dsp->state_int(TMS57002_ID));
			m_dsp->debug_run_cycles(1);
			if (pc == 0xb3 && id == 0x1f)
			{
				seen++;
				if (seen == 2)
				{
					b3_state out;
					out.macc = m_dsp->debug_macc();
					out.maccr = m_dsp->debug_macc_read();
					out.maccw = m_dsp->debug_macc_write();
					out.creg = m_dsp->debug_creg();
					out.p06 = m_dsp->dmem0_value(0x06);
					out.p09 = m_dsp->dmem0_value(0x09);
					out.p0f = m_dsp->dmem0_value(0x0f);
					out.p10 = m_dsp->dmem0_value(0x10);
					osd_printf_info(
						"INFO dsp3 fixb3src label=%s macc=%013llx maccr=%013llx maccw=%013llx creg=%08x "
						"p06=%06x p09=%06x p0f=%06x p10=%06x\n",
						label,
						(unsigned long long)out.macc,
						(unsigned long long)out.maccr,
						(unsigned long long)out.maccw,
						out.creg,
						out.p06,
						out.p09,
						out.p0f,
						out.p10);
					return out;
				}
			}
		}

		throw emu_fatalerror("Failed to reach second DSP3 fix B3 target for %s", label);
	};

	const b3_state base = run_variant("base", {}, {});
	const b3_state low_group = run_variant("zero_dmem0_07080f1011", { 0x07, 0x08, 0x0f, 0x10, 0x11 }, {});
	const b3_state high_group = run_variant("zero_dmem0_bbbcbdbeff", { 0xbb, 0xbc, 0xbd, 0xbe, 0xbf }, {});
	const b3_state only_bb = run_variant("zero_dmem0_bb", { 0xbb }, {});
	const b3_state only_bc = run_variant("zero_dmem0_bc", { 0xbc }, {});
	const b3_state only_bd = run_variant("zero_dmem0_bd", { 0xbd }, {});
	const b3_state only_be = run_variant("zero_dmem0_be", { 0xbe }, {});
	const b3_state only_bf = run_variant("zero_dmem0_bf", { 0xbf }, {});
	const b3_state dmem1_1e = run_variant("zero_dmem1_1e", {}, { 0x1e });
	const b3_state dmem1_1f = run_variant("zero_dmem1_1f", {}, { 0x1f });

	osd_printf_info(
		"INFO dsp3 fixb3src delta low=%013llx high=%013llx bb=%013llx bc=%013llx bd=%013llx be=%013llx bf=%013llx d1_1e=%013llx d1_1f=%013llx\n",
		(unsigned long long)(low_group.macc - base.macc),
		(unsigned long long)(high_group.macc - base.macc),
		(unsigned long long)(only_bb.macc - base.macc),
		(unsigned long long)(only_bc.macc - base.macc),
		(unsigned long long)(only_bd.macc - base.macc),
		(unsigned long long)(only_be.macc - base.macc),
		(unsigned long long)(only_bf.macc - base.macc),
		(unsigned long long)(dmem1_1e.macc - base.macc),
		(unsigned long long)(dmem1_1f.macc - base.macc));
}

void tms57002test_state::probe_dsp3_a02_tape_cycle_budget()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kLogPath[] = "00-extracted/kprop_a02_sample_tape_20260408/error.log";
	static constexpr char kRamDir[] = "00-extracted/kprop_a02_sample_tape_20260408/ram";

	const std::vector<u32> program = load_program_words(kProgramPath);
	const std::vector<std::string> lines = load_text_lines(kLogPath);
	const tms57002_device::debug_snapshot start = load_snapshot_for_su_from_lines(lines, 480003);
	const tms57002_device::debug_snapshot expect = load_snapshot_for_su_from_lines(lines, 480004);
	const std::string start_ram_path = util::string_format("%s/su480003_pc00_pre.bin", kRamDir);

	auto score_variant = [&](int cycles) -> void
	{
		m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
		load_data_space_bytes(start_ram_path.c_str(), m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
		for (int i = 0; i < cycles; i++)
			m_dsp->debug_run_cycles(1);
		m_dsp->debug_begin_sample_frame(expect.serial_input_frame);
		const tms57002_device::debug_snapshot actual = m_dsp->debug_capture_snapshot();

		int score = 0;
		auto bump = [&](bool cond) { if (cond) score++; };
		bump(actual.aacc != expect.aacc);
		bump(actual.macc != expect.macc);
		bump(actual.macc_read != expect.macc_read);
		bump(actual.macc_write != expect.macc_write);
		bump(actual.xoa != expect.xoa);
		bump(actual.xwr != expect.xwr);
		bump(actual.so[0] != expect.so[0]);
		bump(actual.so[1] != expect.so[1]);
		bump(actual.dmem0[(actual.ba0 + 0x54) & 0xff] != expect.dmem0[(expect.ba0 + 0x54) & 0xff]);
		bump(actual.cmem[0x42] != expect.cmem[0x42]);

		osd_printf_info(
			"INFO dsp3 a02 tapecycles su=480003 cycles=%d score=%d aacc=%08x macc=%013llx xoa=%05x xwr=%06x so=%06x/%06x l54=%06x c42=%08x\n",
			cycles,
			score,
			actual.aacc,
			(unsigned long long)actual.macc,
			actual.xoa,
			actual.xwr,
			actual.so[0],
			actual.so[1],
			actual.dmem0[(actual.ba0 + 0x54) & 0xff],
			actual.cmem[0x42]);
	};

	for (int cycles = 504; cycles <= 520; cycles++)
		score_variant(cycles);
}

