joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
void tms57002test_state::test_dsp3_a02_su480006_input_sensitivity()
{
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_firstbad_seed/snapshot_su480006_pc00_pre_sine.log";
	static constexpr char kExecPath[] = "00-extracted/kprop_a02_firstbad_seed/execpost_su480006_full_sine.log";
	static constexpr char kRamPath[] = "00-extracted/kprop_a02_firstbad_seed/xmem_su480006_pc00_pre_sine.bin";

	test_dsp3_input_sensitivity_case("dsp3 a02 su480006", kSnapshotPath, kExecPath, kRamPath);
}

void tms57002test_state::test_dsp3_a02_su480001_pc68_mac_matches_input()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSinePath[] = "tmp/kprop_a02_su480001_start_sine/error.log";
	static constexpr char kImpulsePath[] = "tmp/kprop_a02_su480001_start_impulse/error.log";
	static constexpr char kRamPath[] = "tmp/kprop_a02_su480001_start_sine/xmem.bin";

	struct pc68_state
	{
		u32 aacc = 0;
		s64 macc_pre = 0;
		s64 macc_post = 0;
		u32 logical_d02 = 0;
		u8 ba0 = 0;
	};

	auto run_to_pc68 = [&](const tms57002_device::debug_snapshot &snapshot) -> pc68_state
	{
		const std::vector<u32> program = load_program_words(kProgramPath);
		if (program.size() != 0x100)
			throw emu_fatalerror("Unexpected DSP3 program size %zu in %s", program.size(), kProgramPath);

		m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
		load_data_space_bytes(kRamPath, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(snapshot);

		for (int step = 0; step < 0x200; step++)
		{
			if (m_dsp->state_int(TMS57002_PC) == 0x68 && m_dsp->state_int(TMS57002_ID) == 0x00)
			{
				pc68_state out;
				out.aacc = u32(m_dsp->debug_aacc());
				out.macc_pre = s64(m_dsp->debug_macc());
				out.ba0 = m_dsp->debug_ba0();
				out.logical_d02 = m_dsp->dmem0_value((out.ba0 + 0x02) & 0xff);
				m_dsp->debug_run_cycles(1);
				out.macc_post = s64(m_dsp->debug_macc());
				return out;
			}
			m_dsp->debug_run_cycles(1);
		}

		throw emu_fatalerror("Failed to reach DSP3 SU480001 PC68 ID00 replay target");
	};

	const tms57002_device::debug_snapshot sine = load_snapshot_from_log(kSinePath);
	const tms57002_device::debug_snapshot impulse = load_snapshot_from_log(kImpulsePath);
	const pc68_state sine_state = run_to_pc68(sine);
	const pc68_state impulse_state = run_to_pc68(impulse);

	check_equal("dsp3 a02 su480001 pc68 pre aacc match", sine_state.aacc, impulse_state.aacc);
	check_equal("dsp3 a02 su480001 pc68 pre macc match", sine_state.macc_pre, impulse_state.macc_pre);
	check_equal("dsp3 a02 su480001 pc68 ba0 match", sine_state.ba0, impulse_state.ba0);
	check_equal("dsp3 a02 su480001 pc68 sine logical d02", sine_state.logical_d02, 0);
	check_equal("dsp3 a02 su480001 pc68 impulse logical d02", impulse_state.logical_d02, 0x001000);
	check_equal("dsp3 a02 su480001 pc68 sine mac delta", sine_state.macc_post - sine_state.macc_pre, 0);

	const s64 expected_delta = (s64(s32(sine_state.aacc)) * sx24(impulse_state.logical_d02)) >> 7;
	check_equal("dsp3 a02 su480001 pc68 impulse mac delta", impulse_state.macc_post - impulse_state.macc_pre, expected_delta);
}

void tms57002test_state::dump_dsp3_a02_su480006_replay_block()
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	static constexpr char kSnapshotPath[] = "00-extracted/kprop_a02_firstbad_seed/snapshot_su480006_pc00_pre_sine.log";

	const std::vector<u32> program = load_program_words(kProgramPath);
	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(kSnapshotPath);

	m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
	m_dsp->debug_restore_snapshot(snapshot);

	for (int step = 0; step < 0x2a; step++)
	{
		const u32 curpc = m_dsp->state_int(TMS57002_PC);
		m_dsp->debug_run_cycles(1);
		if (curpc >= 0x1b && curpc <= 0x29)
		{
			osd_printf_info(
				"INFO dsp3 a02 su480006 replay pc%02x ca=%02x id=%02x aacc=%08x macc=%013llx maccr=%013llx maccw=%013llx creg=%08x xoa=%05x xba=%05x xmadr=%05x xmcyc=%02x xmfet=%02x d00=%06x ddc=%06x ddd=%06x dde=%06x ddf=%06x xrd=%06x so=%06x/%06x\n",
				curpc,
				m_dsp->state_int(TMS57002_CA),
				m_dsp->state_int(TMS57002_ID),
				u32(m_dsp->debug_aacc()),
				(unsigned long long)m_dsp->debug_macc(),
				(unsigned long long)m_dsp->debug_macc_read(),
				(unsigned long long)m_dsp->debug_macc_write(),
				m_dsp->debug_creg(),
				m_dsp->debug_xoa(),
				m_dsp->debug_xba(),
				m_dsp->debug_xm_adr(),
				m_dsp->debug_xm_cycles(),
				m_dsp->debug_xm_fetches(),
				m_dsp->dmem0_value(0x00),
				m_dsp->dmem0_value(0xdc),
				m_dsp->dmem0_value(0xdd),
				m_dsp->dmem0_value(0xde),
				m_dsp->dmem0_value(0xdf),
				m_dsp->debug_xrd(),
				m_dsp->debug_serial_output_register(0),
				m_dsp->debug_serial_output_register(1));
		}
	}
}

void tms57002test_state::test_dsp3_snapshot_replay_case_with_program(const char *label, const char *program_path, const char *snapshot_path, const char *exec_path, const char *ram_path)
{
	const std::vector<u32> program = load_program_words(program_path);
	const tms57002_device::debug_snapshot snapshot = load_snapshot_from_log(snapshot_path);
	const std::vector<exec_post_expectation> expected = load_exec_post_expectations(exec_path);

	if (program.size() != 0x100)
		throw emu_fatalerror("Unexpected DSP3 program size %zu in %s", program.size(), program_path);

	m_dsp->debug_load_program(program.data(), u32(program.size()), snapshot.st0, snapshot.st1);
	load_data_space_bytes(ram_path, m_dsp->space(AS_DATA));
	m_dsp->debug_restore_snapshot(snapshot);

	for (std::size_t step = 0; step < expected.size(); step++)
	{
		const auto &exp = expected[step];
		const u8 expected_next_pc = (step + 1 < expected.size()) ? expected[step + 1].executed_pc : u8(exp.executed_pc + 1);

		m_dsp->debug_run_cycles(1);

		char name[128];
		std::snprintf(name, sizeof(name), "%s pc%02x next pc", label, exp.executed_pc);
		check_equal(name, m_dsp->state_int(TMS57002_PC), expected_next_pc);
		std::snprintf(name, sizeof(name), "%s pc%02x ca", label, exp.executed_pc);
		check_equal(name, m_dsp->state_int(TMS57002_CA), exp.ca);
		std::snprintf(name, sizeof(name), "%s pc%02x id", label, exp.executed_pc);
		check_equal(name, m_dsp->state_int(TMS57002_ID), exp.id);
		std::snprintf(name, sizeof(name), "%s pc%02x st1", label, exp.executed_pc);
		check_equal(name, m_dsp->state_int(TMS57002_ST1), exp.st1);
		std::snprintf(name, sizeof(name), "%s pc%02x aacc", label, exp.executed_pc);
		check_equal(name, u32(m_dsp->debug_aacc()), exp.aacc);
		std::snprintf(name, sizeof(name), "%s pc%02x macc", label, exp.executed_pc);
		check_equal(name, s64(m_dsp->debug_macc()), s64(exp.macc));
		std::snprintf(name, sizeof(name), "%s pc%02x maccr", label, exp.executed_pc);
		check_equal(name, s64(m_dsp->debug_macc_read()), s64(exp.maccr));
		std::snprintf(name, sizeof(name), "%s pc%02x maccw", label, exp.executed_pc);
		check_equal(name, s64(m_dsp->debug_macc_write()), s64(exp.maccw));
		std::snprintf(name, sizeof(name), "%s pc%02x creg", label, exp.executed_pc);
		check_equal(name, m_dsp->debug_creg(), exp.creg);
		if (exp.has_extended)
		{
			std::snprintf(name, sizeof(name), "%s pc%02x d00", label, exp.executed_pc);
			check_equal(name, m_dsp->dmem0_value(0x00), exp.d00);
			std::snprintf(name, sizeof(name), "%s pc%02x ddc", label, exp.executed_pc);
			check_equal(name, m_dsp->dmem0_value(0xdc), exp.ddc);
			std::snprintf(name, sizeof(name), "%s pc%02x ddd", label, exp.executed_pc);
			check_equal(name, m_dsp->dmem0_value(0xdd), exp.ddd);
			std::snprintf(name, sizeof(name), "%s pc%02x dde", label, exp.executed_pc);
			check_equal(name, m_dsp->dmem0_value(0xde), exp.dde);
			std::snprintf(name, sizeof(name), "%s pc%02x ddf", label, exp.executed_pc);
			check_equal(name, m_dsp->dmem0_value(0xdf), exp.ddf);
			std::snprintf(name, sizeof(name), "%s pc%02x xrd", label, exp.executed_pc);
			check_equal(name, m_dsp->debug_xrd(), exp.xrd);
		}
		std::snprintf(name, sizeof(name), "%s pc%02x d56", label, exp.executed_pc);
		check_equal(name, m_dsp->dmem0_value(0x56), exp.d56);
		std::snprintf(name, sizeof(name), "%s pc%02x d5d", label, exp.executed_pc);
		check_equal(name, m_dsp->dmem0_value(0x5d), exp.d5d);
		std::snprintf(name, sizeof(name), "%s pc%02x d5f", label, exp.executed_pc);
		check_equal(name, m_dsp->dmem0_value(0x5f), exp.d5f);
		std::snprintf(name, sizeof(name), "%s pc%02x so0", label, exp.executed_pc);
		check_equal(name, m_dsp->debug_serial_output_register(0), exp.so0);
		std::snprintf(name, sizeof(name), "%s pc%02x so1", label, exp.executed_pc);
		check_equal(name, m_dsp->debug_serial_output_register(1), exp.so1);
	}
}

void tms57002test_state::test_dsp3_snapshot_replay_case(const char *label, const char *snapshot_path, const char *exec_path, const char *ram_path)
{
	static constexpr char kProgramPath[] = "00-extracted/korgprop_dsp_offline_extract/dsp3_init.bin";
	test_dsp3_snapshot_replay_case_with_program(label, kProgramPath, snapshot_path, exec_path, ram_path);
}

void tms57002test_state::run_filter_replay_from_env()
{
	const char *pmem_path = required_env("TMS57TEST_REPLAY_PMEM");
	const char *cmem_path = required_env("TMS57TEST_REPLAY_CMEM");
	const char *serial_path = required_env("TMS57TEST_REPLAY_SERIAL");
	const char *out_path = required_env("TMS57TEST_REPLAY_OUT");
	const char *dmem0_path = std::getenv("TMS57TEST_REPLAY_DMEM0");
	const char *dmem1_path = std::getenv("TMS57TEST_REPLAY_DMEM1");
	const char *cload_path = std::getenv("TMS57TEST_REPLAY_CLOAD");

	const std::vector<u32> program = load_hex_words(pmem_path, 0x00ffffffU);
	const std::vector<u32> cmem = load_hex_words(cmem_path);
	const std::vector<u32> dmem0 = (dmem0_path && dmem0_path[0]) ? load_hex_words(dmem0_path, 0x00ffffffU) : std::vector<u32>{};
	const std::vector<u32> dmem1 = (dmem1_path && dmem1_path[0]) ? load_hex_words(dmem1_path, 0x00ffffffU) : std::vector<u32>{};
	const std::vector<serial_replay_row> rows = load_serial_replay_rows(serial_path);
	const std::vector<cload_replay_row> cload_rows = load_cload_replay_rows(cload_path);

	if (program.empty())
		throw emu_fatalerror("No PMEM words in %s", pmem_path);
	if (rows.empty())
		throw emu_fatalerror("No serial rows in %s", serial_path);

