joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
	m_dsp->debug_load_program(program.data(), u32(program.size()), env_hex("TMS57TEST_REPLAY_ST0"), env_hex("TMS57TEST_REPLAY_ST1"));
	m_dsp->set_sync_polarity(env_bool("TMS57TEST_REPLAY_SYNC_RISING", true));
	m_dsp->set_serial_frame_model(env_bool("TMS57TEST_REPLAY_FRAME_MODEL", true));
	m_dsp->set_serial_frame_clocks(env_int("TMS57TEST_REPLAY_FRAME_CLOCKS", 64));
	m_dsp->set_serial_frame_flip_input(env_bool("TMS57TEST_REPLAY_FLIP_INPUT", false));
	m_dsp->set_serial_frame_flip_output(env_bool("TMS57TEST_REPLAY_FLIP_OUTPUT", false));
	m_dsp->set_serial_output_write_handoff(
			env_bool("TMS57TEST_REPLAY_WRITE_HANDOFF", false));
	m_dsp->set_stream_output_raw(env_bool("TMS57TEST_REPLAY_STREAM_RAW", false));
	m_dsp->mute_w(1);

	for (u32 i = 0; i < cmem.size() && i < 0x100; i++)
		m_dsp->debug_write_cmem(u8(i), cmem[i]);
	for (u32 i = 0; i < dmem0.size() && i < 0x100; i++)
		m_dsp->debug_write_dmem0(u8(i), dmem0[i]);
	for (u32 i = 0; i < dmem1.size() && i < 0x20; i++)
		m_dsp->debug_write_dmem1(u8(i), dmem1[i]);

	const int max_cycles = env_int("TMS57TEST_REPLAY_MAX_CYCLES", 4096);

	// Optional mid-run reload: at TMS57TEST_REPLAY_RELOAD_FRAME, swap in a new
	// program image (PC/control reset, like a host PLOAD) and overwrite all
	// provided CMEM cells, leaving DMEM/XMEM/accumulators untouched — mirrors
	// the Prophecy firmware's mute-protected hardware-image reload.
	const char *reload_pmem_path = std::getenv("TMS57TEST_REPLAY_RELOAD_PMEM");
	const char *reload_cmem_path = std::getenv("TMS57TEST_REPLAY_RELOAD_CMEM");
	const int reload_frame = env_int("TMS57TEST_REPLAY_RELOAD_FRAME", -1);
	const std::vector<u32> reload_pmem = (reload_pmem_path && reload_pmem_path[0]) ? load_hex_words(reload_pmem_path, 0x00ffffffU) : std::vector<u32>{};
	const std::vector<u32> reload_cmem = (reload_cmem_path && reload_cmem_path[0]) ? load_hex_words(reload_cmem_path) : std::vector<u32>{};
	if (reload_frame >= 0 && reload_pmem.empty())
		throw emu_fatalerror("TMS57TEST_REPLAY_RELOAD_FRAME set but no reload PMEM");

	// Optional reload schedule: TMS57TEST_REPLAY_RELOAD_SCHEDULE names a text
	// file of lines "FRAME PMEM_PATH CMEM_PATH ST0 ST1" (CMEM_PATH may be "-"
	// for program-only loads). Each entry applies before the named frame, in
	// file order — replays a whole boot/setup PLOAD lifecycle standalone.
	struct reload_entry { u32 frame; std::vector<u32> pmem; std::vector<u32> cmem; u32 st0; u32 st1; };
	std::vector<reload_entry> reload_schedule;
	if (const char *sched_path = std::getenv("TMS57TEST_REPLAY_RELOAD_SCHEDULE"); sched_path && sched_path[0])
	{
		for (const std::string &line : load_text_lines(sched_path))
		{
			if (line.empty() || line[0] == '#')
				continue;
			std::istringstream ss(line);
			std::string pmem_file, cmem_file, st0_s, st1_s;
			u32 frame = 0;
			if (!(ss >> frame >> pmem_file >> cmem_file >> st0_s >> st1_s))
				throw emu_fatalerror("Bad reload schedule line: %s", line);
			reload_entry e;
			e.frame = frame;
			e.pmem = load_hex_words(pmem_file.c_str(), 0x00ffffffU);
			if (cmem_file != "-")
				e.cmem = load_hex_words(cmem_file.c_str());
			e.st0 = u32(std::strtoul(st0_s.c_str(), nullptr, 16));
			e.st1 = u32(std::strtoul(st1_s.c_str(), nullptr, 16));
			if (e.pmem.empty())
				throw emu_fatalerror("Empty reload PMEM %s", pmem_file);
			reload_schedule.push_back(std::move(e));
		}
	}

	std::ofstream out(out_path);
	if (!out)
		throw emu_fatalerror("Unable to open %s for writing", out_path);

	out << "frame\tsi0\tsi1\tsi2\tsi3\tso0\tso1\tso2\tso3\n";
	u32 cload_applied = 0;
	for (const serial_replay_row &row : rows)
	{
		if (reload_frame >= 0 && row.frame == u32(reload_frame))
		{
			m_dsp->debug_load_program(reload_pmem.data(), u32(reload_pmem.size()),
					env_hex("TMS57TEST_REPLAY_RELOAD_ST0", env_hex("TMS57TEST_REPLAY_ST0")),
					env_hex("TMS57TEST_REPLAY_RELOAD_ST1", env_hex("TMS57TEST_REPLAY_ST1")));
			for (u32 i = 0; i < reload_cmem.size() && i < 0x100; i++)
				m_dsp->debug_write_cmem(u8(i), reload_cmem[i]);
			osd_printf_info("TMS57REPLAY reload applied at frame %d\n", reload_frame);
		}
		for (const reload_entry &e : reload_schedule)
		{
			if (e.frame == row.frame)
			{
				m_dsp->debug_load_program(e.pmem.data(), u32(e.pmem.size()), e.st0, e.st1);
				for (u32 i = 0; i < e.cmem.size() && i < 0x100; i++)
					m_dsp->debug_write_cmem(u8(i), e.cmem[i]);
				osd_printf_info("TMS57REPLAY schedule reload at frame %u (st0=%06x st1=%06x)\n", e.frame, e.st0, e.st1);
			}
		}
		for (const cload_replay_row &cload_row : cload_rows)
		{
			if (cload_row.frame == row.frame)
			{
				apply_replay_cload(*m_dsp, cload_row.sa, cload_row.value);
				cload_applied++;
			}
		}
		const std::array<u32, 4> so = m_dsp->debug_run_sample_frame(row.si, max_cycles);
		out << row.frame;
		for (u32 i = 0; i < 4; i++)
		{
			out << '\t';
			write_hex24(out, row.si[i]);
		}
		for (u32 i = 0; i < 4; i++)
		{
			out << '\t';
			write_hex24(out, so[i]);
		}
		out << '\n';
	}

	const char *dump_path = std::getenv("TMS57TEST_REPLAY_STATE_DUMP");
	if (dump_path && dump_path[0])
	{
		std::ofstream dump(dump_path);
		if (!dump)
			throw emu_fatalerror("Unable to open %s for writing", dump_path);
		for (u32 i = 0; i < 0x100; i++)
			dump << util::string_format("dmem0 %02x 0x%06x\n", i, m_dsp->dmem0_value(u8(i)));
		for (u32 i = 0; i < 0x20; i++)
			dump << util::string_format("dmem1 %02x 0x%06x\n", i, m_dsp->dmem1_value(u8(i)));
	}

	osd_printf_info("TMS57REPLAY rows=%zu cload=%u out=%s\n", rows.size(), cload_applied, out_path);
}

void tms57002test_state::probe_dsp3_a12_drone_regrowth()
{
	// Free-running replay of the A12 voice program from a mid-drone MAME
	// snapshot, with optional CMEM overrides/zeroing — the standalone repro
	// for the post-all-off regrowth. Prints per-sample SO + key cells.
	const char *program_path = required_env("TMS57TEST_DRONE_PROGRAM_PATH");
	const char *snap_log = required_env("TMS57TEST_DRONE_SNAP_LOG");
	const u64 snap_su = parse_dec_u64(required_env("TMS57TEST_DRONE_SNAP_SU"));
	const char *ram_path = std::getenv("TMS57TEST_DRONE_RAM_PATH");
	const int samples = env_int("TMS57TEST_DRONE_SAMPLES", 300);
	const bool fresh_state = env_bool("TMS57TEST_DRONE_FRESH_STATE");
	const int cycles_per_sample = env_int("TMS57TEST_DRONE_CYCLES_PER_SAMPLE", 512);
	const int serial_frame_clocks = env_int("TMS57TEST_DRONE_SERIAL_FRAME_CLOCKS", cycles_per_sample);
	const bool frame_model = env_bool("TMS57TEST_DRONE_FRAME_MODEL");
	const bool sample_frame_api = env_bool("TMS57TEST_DRONE_SAMPLE_FRAME_API");
	const bool host_sequence = env_bool("TMS57TEST_DRONE_HOST_SEQUENCE");
	m_dsp->set_ca_inc_delayed(env_bool("TMS57TEST_CA_INC_DELAYED"));
	m_dsp->set_abs_saturate(env_bool("TMS57TEST_ABS_SATURATE"));
	m_dsp->set_smhc_post_slot(env_bool("TMS57TEST_SMHC_POST_SLOT"));

	const std::vector<u32> program = load_program_words(program_path);
	const std::vector<std::string> lines = load_text_lines(snap_log);
	tms57002_device::debug_snapshot start = load_snapshot_for_su_from_lines(lines, snap_su);
	start.st0 = env_hex("TMS57TEST_DRONE_ST0", start.st0);
	start.st1 = env_hex("TMS57TEST_DRONE_ST1", start.st1);
	if (env_bool("TMS57TEST_DRONE_RESET_EXEC"))
	{
		start.pc = 0;
		start.hpc = 0;
		start.ca = 0;
		start.id = 0;
		start.ba0 = 0;
		start.ba1 = 0;
		start.rptc = 0;
		start.rptc_next = 0;
		start.sa = 0;
		start.hidx = 0;
		start.sti = 0;
		start.aacc = 0;
		start.macc = 0;
		start.macc_read = 0;
		start.macc_write = 0;
		start.creg = 0;
		start.xoa = 0;
		start.xba = 0;
		start.xwr = 0;
		start.xrd = 0;
		start.txrd = 0;
		start.xm_adr = 0;
		start.xm_cycles = 0;
		start.xm_fetches = 0;
	}
	if (env_bool("TMS57TEST_DRONE_SERIAL_ZERO"))
	{
		start.si.fill(0);
		start.serial_input_latch.fill(0);
		start.serial_input_active.fill(0);
		start.serial_input_frame.fill(0);
		start.serial_input_prev_frame.fill(0);
		start.serial_input_pending.fill(0);
		start.serial_input_valid = 0;
		start.serial_input_active_valid = 0;
		start.serial_input_prev_valid = 0;
		start.serial_input_pending_valid = 0;
	}

	m_dsp->debug_load_program(program.data(), u32(program.size()), start.st0, start.st1);
	if (frame_model)
	{
		m_dsp->set_serial_frame_model(true);
		m_dsp->set_serial_frame_clocks(serial_frame_clocks);
	}
	if (!fresh_state)
	{
		if (ram_path && ram_path[0])
			load_data_space_bytes(ram_path, m_dsp->space(AS_DATA));
		m_dsp->debug_restore_snapshot(start);
	}

	if (const char *set = std::getenv("TMS57TEST_DRONE_CMEM_SET"))
	{
		// Malformed entries are skipped LOUDLY, never silently dropped along
		// with the rest of the list (a bisect with a typo must not produce a
		// quiet wrong verdict).
		int applied = 0, skipped = 0;
		const char *p = set;
		while (*p)
		{
			char *eq = nullptr;
			const unsigned long addr = std::strtoul(p, &eq, 16);
			char *next = nullptr;
			unsigned long val = 0;
			bool ok = eq && eq != p && *eq == '=';
			if (ok)
			{
				val = std::strtoul(eq + 1, &next, 16);
				ok = next && next != eq + 1 && addr <= 0xff;
			}
			if (ok)
			{
				m_dsp->debug_write_cmem(u8(addr), u32(val));
				applied++;
				p = next;
			}
			else
			{
				skipped++;
				osd_printf_error("TMS57TEST_DRONE_CMEM_SET: malformed entry at '%.16s' (skipped)\n", p);
				while (*p && *p != ',' && *p != ' ')
					p++;
			}
			while (*p == ',' || *p == ' ')
				p++;
		}
		osd_printf_info("TMS57TEST_DRONE_CMEM_SET: applied=%d skipped=%d\n", applied, skipped);
		if (skipped)
			throw emu_fatalerror("TMS57TEST_DRONE_CMEM_SET had %d malformed entries; refusing to run a partial force", skipped);
	}
	if (const char *zero = std::getenv("TMS57TEST_DRONE_CMEM_ZERO"))
	{
		const char *p = zero;
		while (*p)
		{
			char *next = nullptr;
			const unsigned long addr = std::strtoul(p, &next, 16);
			if (next == p)
				break;
			if (addr <= 0xff)
				m_dsp->debug_write_cmem(u8(addr), 0);
			p = next;
			while (*p == ',' || *p == ' ')
				p++;
		}
	}
	if (env_bool("TMS57TEST_DRONE_ZERO_DMEM"))
	{
		for (u32 a = 0; a < 256; a++)
			m_dsp->debug_write_dmem0(u8(a), 0);
		for (u32 a = 0; a < 32; a++)
			m_dsp->debug_write_dmem1(u8(a), 0);
	}
	if (env_bool("TMS57TEST_DRONE_ZERO_XRAM"))
	{
		address_space &space = m_dsp->space(AS_DATA);
		for (u32 addr = 0; addr < 0x40000; addr++)
			space.write_byte(addr, 0);
	}
	if (host_sequence)
	{
		const std::array<u32, 256> cmem_image = m_dsp->debug_capture_snapshot().cmem;

