joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
		m_dsp->pload_w(1);
		m_dsp->cload_w(1);
		m_dsp->debug_reset_live_state(false);
		host_download_cmem_image(*m_dsp, cmem_image);
		m_dsp->debug_reset_live_state(false);
		host_download_program_image(*m_dsp, program, start.st0, start.st1);
		m_dsp->debug_reset_live_state(false);
		m_dsp->pload_w(1);
		m_dsp->cload_w(1);
		if (frame_model)
		{
			m_dsp->set_serial_frame_model(true);
			m_dsp->set_serial_frame_clocks(serial_frame_clocks);
		}
	}

	osd_printf_info(
		"DRONEREGROW setup ST0=%06x ST1=%06x PC=%02x CA=%02x ID=%02x BA0=%02x BA1=%02x "
		"AACC=%08x MACC=%013llx SI=%06x/%06x/%06x/%06x RESET_EXEC=%u SERIAL_ZERO=%u ZERO_DMEM=%u ZERO_XRAM=%u "
		"FRESH_STATE=%u CYCLES_PER_SAMPLE=%d SERIAL_FRAME_CLOCKS=%d FRAME_MODEL=%u SAMPLE_FRAME_API=%u HOST_SEQUENCE=%u\n",
		start.st0, start.st1, start.pc, start.ca, start.id, start.ba0, start.ba1,
		start.aacc, (unsigned long long)start.macc,
		start.serial_input_frame[0], start.serial_input_frame[1],
		start.serial_input_frame[2], start.serial_input_frame[3],
		u32(env_bool("TMS57TEST_DRONE_RESET_EXEC")),
		u32(env_bool("TMS57TEST_DRONE_SERIAL_ZERO")),
		u32(env_bool("TMS57TEST_DRONE_ZERO_DMEM")),
		u32(env_bool("TMS57TEST_DRONE_ZERO_XRAM")),
		u32(fresh_state),
		cycles_per_sample,
		serial_frame_clocks,
		u32(frame_model),
		u32(sample_frame_api),
		u32(host_sequence));
	// Optional extra per-sample cells: "d30,c31,c32,..." appended to each row as name=value.
	struct extra_cell { char kind; u8 addr; };
	std::vector<extra_cell> extra_cells;
	if (const char *cells = std::getenv("TMS57TEST_DRONE_PRINT_CELLS"))
	{
		std::string s = cells;
		for (size_t p = 0; p < s.size(); )
		{
			size_t c = s.find(',', p);
			if (c == std::string::npos) c = s.size();
			std::string tok = s.substr(p, c - p);
			if (tok.size() >= 2 && (tok[0] == 'd' || tok[0] == 'c'))
				extra_cells.push_back({ tok[0], u8(std::strtol(tok.c_str() + 1, nullptr, 16)) });
			p = c + 1;
		}
	}
	osd_printf_info("DRONEREGROW header sample,so0,so1,so2,so3,c21,c00,cD8,cDD,d02,d03,d05,d06,ba0\n");
	for (int n = 0; n < samples; n++)
	{
		std::array<u32, 4> observed_so;
		if (sample_frame_api)
			observed_so = m_dsp->debug_run_sample_frame(start.serial_input_frame, cycles_per_sample);
		else if (n < env_int("TMS57TEST_DRONE_STEP_SAMPLES", 0))
		{
			u8 last_pc = 0xff;
			u64 last_macc = ~u64(0);
			u32 last_aacc = ~u32(0);
			for (int cyc = 0; cyc < cycles_per_sample; cyc++)
			{
				m_dsp->debug_run_cycles(1);
				const tms57002_device::debug_snapshot ss = m_dsp->debug_capture_snapshot();
				if (ss.pc != last_pc || ss.macc != last_macc || ss.aacc != last_aacc)
					osd_printf_info("DRONESTEP %d,%d,pc=%02x,ca=%02x,ba0=%02x,aacc=%08x,macc=%013llx,creg=%08x\n",
						n, cyc, ss.pc, ss.ca, ss.ba0, ss.aacc, (unsigned long long)ss.macc, ss.creg);
				last_pc = ss.pc;
				last_macc = ss.macc;
				last_aacc = ss.aacc;
			}
			m_dsp->debug_begin_sample_frame(start.serial_input_frame);
		}
		else
		{
			m_dsp->debug_run_cycles(cycles_per_sample);
			m_dsp->debug_begin_sample_frame(start.serial_input_frame);
		}
		const tms57002_device::debug_snapshot s = m_dsp->debug_capture_snapshot();
		if (!sample_frame_api)
			observed_so = s.so;
		const u32 d02 = s.dmem0[(s.ba0 + 0x02) & 0xff];
		const u32 d03 = s.dmem0[(s.ba0 + 0x03) & 0xff];
		const u32 d05 = s.dmem0[(s.ba0 + 0x05) & 0xff];
		const u32 d06 = s.dmem0[(s.ba0 + 0x06) & 0xff];
		std::string extra;
		for (const extra_cell &ec : extra_cells)
		{
			const u32 v = (ec.kind == 'c') ? s.cmem[ec.addr] : s.dmem0[(s.ba0 + ec.addr) & 0xff];
			extra += util::string_format(",%c%02X=%08x", ec.kind, ec.addr, v);
		}
		osd_printf_info(
			"DRONEREGROW %d,%06x,%06x,%06x,%06x,%08x,%08x,%08x,%08x,%06x,%06x,%06x,%06x,%02x%s\n",
			n, observed_so[0], observed_so[1], observed_so[2], observed_so[3],
			s.cmem[0x21], s.cmem[0x00], s.cmem[0xd8], s.cmem[0xdd],
			d02, d03, d05, d06, s.ba0, extra);
	}
}

void tms57002test_state::run_all_focused_tests()
{
	struct entry { const char *name; void (tms57002test_state::*fn)(); };
	static const entry tests[] = {
		{ "aovm_neg_abs_int32_min", &tms57002test_state::test_aovm_neg_abs_int32_min },
		{ "cmem_update_multiword_sequence", &tms57002test_state::test_cmem_update_multiword_sequence },
		{ "cmem_update_new_address_breaks_active_run", &tms57002test_state::test_cmem_update_new_address_breaks_active_run },
		{ "cmem_update_waits_for_cload_high", &tms57002test_state::test_cmem_update_waits_for_cload_high },
		{ "domh_sfmo2_trace_cases", &tms57002test_state::test_domh_sfmo2_trace_cases },
		{ "dsp3_lmhd_srbd_uses_store_updated_dmem_for_macc", &tms57002test_state::test_dsp3_lmhd_srbd_uses_store_updated_dmem_for_macc },
		{ "dsp3_mpy_dis_uses_incoming_dmem", &tms57002test_state::test_dsp3_mpy_dis_uses_incoming_dmem },
		{ "dsp3_rde_sacc_uses_store_updated_cmem_for_xoa", &tms57002test_state::test_dsp3_rde_sacc_uses_store_updated_cmem_for_xoa },
		{ "dsp3_rde_word0_sel1_dram_latency", &tms57002test_state::test_dsp3_rde_word0_sel1_dram_latency },
		{ "dsp3_wre_smhd_orders_store_before_xwr", &tms57002test_state::test_dsp3_wre_smhd_orders_store_before_xwr },
		{ "example53_bank_switched_serial_access", &tms57002test_state::test_example53_bank_switched_serial_access },
		{ "example53_dos_deadline", &tms57002test_state::test_example53_dos_deadline },
		{ "example53_one_frame_output_latency", &tms57002test_state::test_example53_one_frame_output_latency },
		{ "instruction_level_serial_passthrough", &tms57002test_state::test_instruction_level_serial_passthrough },
		{ "lacc_lira_same_word_uses_pre_lacc_aacc", &tms57002test_state::test_lacc_lira_same_word_uses_pre_lacc_aacc },
		{ "mac_a_d_and_smld_port_semantics", &tms57002test_state::test_mac_a_d_and_smld_port_semantics },
		{ "multiplier_a_port_drops_low_byte", &tms57002test_state::test_multiplier_a_port_drops_low_byte },
		{ "sequential_pc_wrap_halts_until_sync", &tms57002test_state::test_sequential_pc_wrap_halts_until_sync },
		{ "macc_output_clipping", &tms57002test_state::test_macc_output_clipping },
		{ "macc_output_unrounded_exceptions", &tms57002test_state::test_macc_output_unrounded_exceptions },
		{ "pc33_mpy_mac_direct_coeff_chain", &tms57002test_state::test_pc33_mpy_mac_direct_coeff_chain },
		{ "pc33_producer_smhc_phase", &tms57002test_state::test_pc33_producer_smhc_phase },
		{ "xmem_micro_oracles", &tms57002test_state::test_xmem_micro_oracles },
	};

	int passed = 0, failed = 0, errored = 0;
	for (const entry &t : tests)
	{
		const int before = m_failures;
		osd_printf_info("=== TMS57TEST_ALL: %s ===\n", t.name);
		try { (this->*t.fn)(); }
		catch (const std::exception &e)
		{
			errored++;
			osd_printf_info("ERRORTEST %s %s\n", t.name, e.what());
			continue;
		}
		catch (...) { errored++; osd_printf_info("ERRORTEST %s (unknown exception)\n", t.name); continue; }
		const int delta = m_failures - before;
		if (delta == 0) { passed++; osd_printf_info("PASSTEST %s\n", t.name); }
		else { failed++; osd_printf_info("FAILTEST %s %d check(s)\n", t.name, delta); }
	}
	osd_printf_info("TMS57TEST_ALL_SUMMARY tests=%d passed=%d failed=%d errored=%d blocked=%d failed_checks=%d\n",
			int(std::size(tests)), passed, failed, errored, 0, m_failures);
}

void tms57002test_state::run_legacy_research_tests()
{
	struct entry { const char *name; void (tms57002test_state::*fn)(); };
	static const entry tests[] = {
		{ "dsp3_a02_sine_su480003_snapshot_replay", &tms57002test_state::test_dsp3_a02_sine_su480003_snapshot_replay },
		{ "dsp3_a02_su480001_pc68_mac_matches_input", &tms57002test_state::test_dsp3_a02_su480001_pc68_mac_matches_input },
		{ "dsp3_a02_su480002_input_sensitivity", &tms57002test_state::test_dsp3_a02_su480002_input_sensitivity },
		{ "dsp3_a02_su480003_input_sensitivity", &tms57002test_state::test_dsp3_a02_su480003_input_sensitivity },
		{ "dsp3_a02_su480004_input_sensitivity", &tms57002test_state::test_dsp3_a02_su480004_input_sensitivity },
		{ "dsp3_a02_su480004_snapshot_replay", &tms57002test_state::test_dsp3_a02_su480004_snapshot_replay },
		{ "dsp3_a02_su480005_input_sensitivity", &tms57002test_state::test_dsp3_a02_su480005_input_sensitivity },
		{ "dsp3_a02_su480005_snapshot_replay", &tms57002test_state::test_dsp3_a02_su480005_snapshot_replay },
		{ "dsp3_a02_su480006_input_sensitivity", &tms57002test_state::test_dsp3_a02_su480006_input_sensitivity },
		{ "dsp3_a02_su480006_snapshot_replay", &tms57002test_state::test_dsp3_a02_su480006_snapshot_replay },
		{ "dsp3_a02_su480082_snapshot_replay", &tms57002test_state::test_dsp3_a02_su480082_snapshot_replay },
	};

	int passed = 0, failed = 0, errored = 0, blocked = 1;
	osd_printf_info(
			"BLOCKEDTEST dsp3_a02_f8_ff_tail_chain incomplete synthetic fixture retained for research history; "
			"portable hardware coverage is tracked separately\n");
	for (const entry &t : tests)
	{
		const int before = m_failures;
		osd_printf_info("=== TMS57TEST_LEGACY: %s ===\n", t.name);
		try { (this->*t.fn)(); }
		catch (const std::exception &e)
		{
			if (std::strstr(e.what(), "Unable to open"))
			{
				blocked++;
				osd_printf_info("BLOCKEDTEST %s %s\n", t.name, e.what());
			}
			else
			{
				errored++;
				osd_printf_info("ERRORTEST %s %s\n", t.name, e.what());
			}
			continue;
		}
		catch (...) { errored++; osd_printf_info("ERRORTEST %s (unknown exception)\n", t.name); continue; }
		const int delta = m_failures - before;
		if (delta == 0) { passed++; osd_printf_info("PASSTEST %s\n", t.name); }
		else { failed++; osd_printf_info("FAILTEST %s %d check(s)\n", t.name, delta); }
	}
	osd_printf_info("TMS57TEST_LEGACY_SUMMARY tests=%d passed=%d failed=%d errored=%d blocked=%d failed_checks=%d release_denominator=0\n",
			int(std::size(tests) + 1), passed, failed, errored, blocked, m_failures);
}

