joelanders/mame-profligacy/src/mame/skeleton/tms57002test.cpp
void tms57002test_state::run_tests_now()
{
	if (const char *only = std::getenv("TMS57TEST_ONLY"))
	{
		osd_printf_info("Running focused TMS57002 test: %s\n", only);
		if (!std::strcmp(only, "all"))
		{
			run_all_focused_tests();
			machine().schedule_exit();
			if (m_failures != 0)
				throw emu_fatalerror(1, "%d TMS57002 tests failed", m_failures);
			return;
		}
		if (!std::strcmp(only, "legacy"))
		{
			run_legacy_research_tests();
			machine().schedule_exit();
			if (m_failures != 0)
				throw emu_fatalerror(1, "%d legacy TMS57002 tests failed", m_failures);
			return;
		}
		if (!std::strcmp(only, "filter-replay"))
		{
			run_filter_replay_from_env();
			machine().schedule_exit();
			return;
		}
		else if (!std::strcmp(only, "fixcoeff"))
			probe_dsp3_a02_fix_su95299_coeff_sensitivity();
		else if (!std::strcmp(only, "fixb3src"))
			probe_dsp3_a02_fix_su95298_b3_operand_source();
		else if (!std::strcmp(only, "tapeboundary"))
			probe_dsp3_a02_tape_boundary_replay();
		else if (!std::strcmp(only, "onset"))
			probe_dsp3_a02_onset_boundary_replay();
		else if (!std::strcmp(only, "drone_regrowth"))
			probe_dsp3_a12_drone_regrowth();
		else if (!std::strcmp(only, "serialside"))
			probe_dsp3_serial_side_boundary_sensitivity();
		else if (!std::strcmp(only, "lacc_lira"))
			test_lacc_lira_same_word_uses_pre_lacc_aacc();
		else if (!std::strcmp(only, "cmem_update"))
			test_cmem_update_multiword_sequence();
		else if (!std::strcmp(only, "cmem_update_cload_boundary"))
			test_cmem_update_waits_for_cload_high();
		else if (!std::strcmp(only, "cmem_update_address_run"))
			test_cmem_update_new_address_breaks_active_run();
		else if (!std::strcmp(only, "pc33_chain"))
			test_pc33_mpy_mac_direct_coeff_chain();
		else if (!std::strcmp(only, "pc33_producer"))
			test_pc33_producer_smhc_phase();
		else if (!std::strcmp(only, "store_mpy_ports"))
			test_mac_a_d_and_smld_port_semantics();
		else if (!std::strcmp(only, "mac_a_d_port"))
			test_mac_a_d_full_width_port();
		else if (!std::strcmp(only, "mpy_a_port"))
			test_multiplier_a_port_drops_low_byte();
		else if (!std::strcmp(only, "pc_wrap_halt"))
			test_sequential_pc_wrap_halts_until_sync();
		else if (!std::strcmp(only, "smld_raw_port"))
			test_smld_raw_low_port();
		else if (!std::strcmp(only, "aovm_neg_abs"))
			test_aovm_neg_abs_int32_min();
		else if (!std::strcmp(only, "mpy_dis_incoming"))
			test_dsp3_mpy_dis_uses_incoming_dmem();
		else if (!std::strcmp(only, "domh_movm_rounding"))
			test_domh_movm_rounding_oracle_boundaries();
		else if (!std::strcmp(only, "dos_deadline"))
			test_example53_dos_deadline();
		else if (!std::strcmp(only, "rde_latency"))
			test_dsp3_rde_word0_sel1_dram_latency();
		else if (!std::strcmp(only, "wre_smhd"))
			test_dsp3_wre_smhd_orders_store_before_xwr();
		else if (!std::strcmp(only, "xmem_micro"))
			test_xmem_micro_oracles();
		else
			throw emu_fatalerror(1, "Unknown TMS57TEST_ONLY=%s", only);

		if (m_failures != 0)
			throw emu_fatalerror(1, "%d TMS57002 tests failed", m_failures);
		throw emu_fatalerror(0, "Focused TMS57002 test completed");
	}

	osd_printf_info("Running TMS57002 helper semantics tests\n");
	test_macc_output_clipping();
	test_macc_output_unrounded_exceptions();
	test_domh_sfmo2_trace_cases();
	test_instruction_level_serial_passthrough();
	test_example53_bank_switched_serial_access();
	test_example53_one_frame_output_latency();
	test_example53_dos_deadline();
	test_dsp3_mpy_dis_uses_incoming_dmem();
	test_dsp3_wre_smhd_orders_store_before_xwr();
	test_dsp3_rde_sacc_uses_store_updated_cmem_for_xoa();
	test_dsp3_lmhd_srbd_uses_store_updated_dmem_for_macc();
	test_lacc_lira_same_word_uses_pre_lacc_aacc();
	test_cmem_update_multiword_sequence();
	test_cmem_update_waits_for_cload_high();
	test_cmem_update_new_address_breaks_active_run();
	test_pc33_mpy_mac_direct_coeff_chain();
	test_dsp3_rde_word0_sel1_dram_latency();
	test_dsp3_a02_su480002_input_sensitivity();
	test_dsp3_a02_su480003_input_sensitivity();
	test_dsp3_a02_sine_su480003_snapshot_replay();
	test_dsp3_a02_su480004_snapshot_replay();
	test_dsp3_a02_su480004_input_sensitivity();
	test_dsp3_a02_su480005_snapshot_replay();
	test_dsp3_a02_su480005_input_sensitivity();
	probe_dsp3_a02_su480005_state_sensitivity();
	probe_dsp3_a02_su480005_first_diff_variants();
	probe_dsp3_a02_su480004_producers();
	probe_dsp3_a02_su480004_producer_site_ba0_variants();
	probe_dsp3_a02_su480005_ba0_phase_sensitivity();
	probe_dsp3_a02_su480005_site_ba0_variants();
	probe_dsp3_a02_su480005_repeat_site_ba0_variants();
	probe_dsp3_a02_tape_su480003_group_sensitivity();
	probe_dsp3_a02_tape_su480003_producer_sensitivity();
	probe_dsp3_a02_tape_su480002_hot_producer_sensitivity();
	probe_dsp3_a02_tape_su480002_serial_firstdiff();
	probe_dsp3_a02_tape_su480002_serial_path_checks();
	probe_dsp3_serial_side_boundary_sensitivity();
	probe_dsp3_a02_fix_su95299_coeff_sensitivity();
	probe_dsp3_a02_tape_boundary_replay();
	probe_dsp3_a02_tape_cycle_budget();
	test_dsp3_a02_su480006_snapshot_replay();
	test_dsp3_a02_su480006_input_sensitivity();
	test_dsp3_a02_su480001_pc68_mac_matches_input();
	dump_dsp3_a02_su480006_replay_block();
	test_dsp3_a02_su480082_snapshot_replay();

	if (m_failures != 0)
		throw emu_fatalerror(1, "%d TMS57002 tests failed", m_failures);

	throw emu_fatalerror(0, "All TMS57002 tests passed");
}


static INPUT_PORTS_START(tms57002test)
INPUT_PORTS_END


void tms57002test_state::tms57002test(machine_config &config)
{
	TMS57002(config, m_dsp, XTAL(24'576'000));
	m_dsp->set_addrmap(AS_DATA, &tms57002test_state::dsp_ram_map);

	screen_device &screen(SCREEN(config, "screen"));
	screen.set_raw(1'000'000, 80, 0, 64, 80, 0, 64);
	screen.set_screen_update(FUNC(tms57002test_state::screen_update));
}

void tms57002test_state::dsp_ram_map(address_map &map)
{
	map(0x00000, 0x3ffff).ram();
}


ROM_START(tms57002test)
	ROM_REGION(0x10, "dsp", ROMREGION_ERASE00)
ROM_END

} // anonymous namespace


GAME(2026, tms57002test, 0, tms57002test, tms57002test, tms57002test_state, empty_init, ROT0, "MAME", "TMS57002 Semantics Harness", MACHINE_NO_SOUND_HW)
